<********** I WASN'T IN LAB ON THURSDAY BECAUSE I WAS SICK***************>

Script started on 2020-02-07 22:31:15-05:00 [TERM="xterm-256color" TTY="/dev/pts/4" COLUMNS="80" LINES="24"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied
]0;aservet1@remote04: ~/i240a/work/lab2[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2[01;31m (master)[00m$ exit

Script done on 2020-02-07 22:31:18-05:00 [COMMAND_EXIT_CODE="0"]
Script started on 2020-02-07 22:32:30-05:00 [TERM="xterm-256color" TTY="/dev/pts/4" COLUMNS="80" LINES="24"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied
]0;aservet1@remote04: ~/i240a/work/lab2[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2[01;31m (master)[00m$ ls
[0m[01;34mexercises[0m  [01;34mlab2[0m  lab2.html  lab2.LOG  lab2.pdf  lab2.umt
]0;aservet1@remote04: ~/i240a/work/lab2[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2[01;31m (master)[00m$ cd lab2/
]0;aservet1@remote04: ~/i240a/work/lab2/lab2[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/lab2[01;31m (master)[00m$ clear
[H[2J[3J]0;aservet1@remote04: ~/i240a/work/lab2/lab2[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/lab2[01;31m (master)[00m$ ls
hl-fine_blue.css  hl-fine_blue.sty
]0;aservet1@remote04: ~/i240a/work/lab2/lab2[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/lab2[01;31m (master)[00m$ ls
hl-fine_blue.css  hl-fine_blue.sty
]0;aservet1@remote04: ~/i240a/work/lab2/lab2[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/lab2[01;31m (master)[00m$ cd [K[K[Kcd ..
]0;aservet1@remote04: ~/i240a/work/lab2[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2[01;31m (master)[00m$ ls
[0m[01;34mexercises[0m  [01;34mlab2[0m  lab2.html  lab2.LOG  lab2.pdf  lab2.umt
]0;aservet1@remote04: ~/i240a/work/lab2[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2[01;31m (master)[00m$ cd exercises/
]0;aservet1@remote04: ~/i240a/work/lab2/exercises[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises[01;31m (master)[00m$ ls
[0m[01;34m1-hello[0m  [01;34m2-hello[0m  [01;34m3-overload[0m  Makefile
]0;aservet1@remote04: ~/i240a/work/lab2/exercises[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises[01;31m (master)[00m$ cd 1-hello/
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ clear
[H[2J[3J]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ ls
hello.cc  Makefile  README
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ ls ..
[0m[01;34m1-hello[0m  [01;34m2-hello[0m  [01;34m3-overload[0m  Makefile
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ ls ..;\[K[K/..
[0m[01;34mexercises[0m  [01;34mlab2[0m  lab2.html  lab2.LOG  lab2.pdf  lab2.umt
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ clear
[H[2J[3J]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ ls
hello.cc  Makefile  README
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ cat README 
Print out a line saying hello to each command-line argument.
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ ./hello 
usage: ./hello NAME...
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ ./hello bart lis a
hello bart
hello lisa
hello ]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lisa
Temporary breakpoint 1 at 0x11cd: file hello.cc, line 13.
Starting program: /import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/1-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffdff8) at hello.cc:13
13	  if (argc == 1) {
(gdb) l
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
(gdb) l 5
1	#include <iostream>
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
(gdb) l 10
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
(gdb) l
15	    std::exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
21	  }
22	}
(gdb) l
Line number 23 out of range; hello.cc has 22 lines.
(gdb) l
Line number 23 out of range; hello.cc has 22 lines.
(gdb) l -10
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
(gdb) l -10
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
(gdb) b sayHello
Breakpoint 2 at 0x555555555181: file hello.cc, line 7.
(gdb) p argc
$1 = 3
(gdb) p argv
$2 = (const char **) 0x7fffffffdff8
(gdb) p *argv@3
$3 = {
  0x7fffffffe290 "/import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/1-hello/hello", 0x7fffffffe2de "bart", 0x7fffffffe2e3 "lisa"}
(gdb) p argv[0]
$4 = 0x7fffffffe290 "/import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/1-hello/hello"
(gdb) p argv[0][1P]1]
$5 = 0x7fffffffe2de "bart"
(gdb) p argv[1][1P]3]
$6 = 0x0
(gdb) p argv[3][1P]1]0]0]
$7 = 0x62642f656c636172 <error: Cannot access memory at address 0x62642f656c636172>
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      sayHello(argv[i]);
(gdb) p i
$8 = 1
(gdb) c
Continuing.

Breakpoint 2, sayHello (name=0x7fffffffe2de "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) l
2	#include <cstdlib>
3	
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
(gdb) backtrace
#0  sayHello (name=0x7fffffffe2de "bart") at hello.cc:7
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffdff8) at hello.cc:19
(gdb) p argc
No symbol "argc" in current context.
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffdff8) at hello.cc:19
19	      sayHello(argv[i]);
(gdb) p i
$9 = 1
(gdb) p argc
$10 = 3
(gdb) p arv[K[K[K@argv4
A syntax error in expression, near `argv4'.
(gdb) p @argv4[K3
A syntax error in expression, near `argv3'.
(gdb) p @argv3*@argv3
A syntax error in expression, near `@argv3'.
(gdb) p *@argv3[1Pargv3[C[C[C[C@3
$11 = {
  0x7fffffffe290 "/import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/1-hello/hello", 0x7fffffffe2de "bart", 0x7fffffffe2e3 "lisa"}
(gdb) p *argv@3[C[K4
$12 = {
  0x7fffffffe290 "/import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/1-hello/hello", 0x7fffffffe2de "bart", 0x7fffffffe2e3 "lisa", 0x0}
(gdb) p *argv@4[K100
$13 = {
  0x7fffffffe290 "/import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/1-hello/hello", 0x7fffffffe2de "bart", 0x7fffffffe2e3 "lisa", 0x0, 
  0x7fffffffe2e8 "SHELL=/bin/bash", 
  0x7fffffffe2f8 "DERBY_HOME=/usr/lib/jvm/java-8-oracle/db", 
  0x7fffffffe321 "JAVA_HOME=/usr/lib/jvm/java-8-oracle", 
  0x7fffffffe346 "SSH_AUTH_SOCK=/tmp/ssh-7vJtAmwlpzgz/agent.3585275", 
  0x7fffffffe378 "SSH_AGENT_PID=3585276", 
  0x7fffffffe38e "PWD=/home/aservet1/i240a/work/lab2/exercises/1-hello", 
  0x7fffffffe3c3 "LOGNAME=aservet1", 0x7fffffffe3d4 "XDG_SESSION_TYPE=tty", 
  0x7fffffffe3e9 "_=/usr/bin/gdb", 
  0x7fffffffe3f8 "J2REDIR=/usr/lib/jvm/java-8-oracle/jre", 
  0x7fffffffe41f "LINES=24", 
  0x7fffffffe428 "VIRTUALENVWRAPPER_SCRIPT=/usr/share/virtualenvwrapper/virtualenvwrapper.sh", 0x7fffffffe473 "HOME=/home/aservet1", 
  0x7fffffffe487 "LANG=en_US.UTF-8", 
  0x7fffffffe498 "LS_COLORS=rs=0:di=01;34:ln=01;36:mh=00:pi=40;33:so=01;35:do=01;35:bd=40;33;01:cd=40;33;01:or=40;31;01:mi=00:su=37;41:sg=30;43:ca=30;41:tw=30;42:ow=34;42:st=37;44:ex=01;32:*.tar=01;31:*.tgz=01;31:*.arc"..., 
  0x7fffffffea7a "_VIRTUALENVWRAPPER_API= mkvirtualenv rmvirtualenv lsvirtualenv showvirtualenv workon add2virtualenv cdsitepackages cdvirtualenv lssitepackages toggleglobalsitepackages cpvirtualenv setvirtualenvprojec"..., 
  0x7fffffffecff "COLUMNS=80", 
--Type <RET> for more, q to quit, c to continue without paging--q
0x7fffffffed0a "SSH_CONNECTION=149.125.41.189 443Quit
(gdb) l
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
21	  }
22	}
(gdb) l 1[K-
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
(gdb) l
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
21	  }
22	}
(gdb) l-
Undefined command: "l-".  Try "help".
(gdb) l- -
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
(gdb) l
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
21	  }
22	}
(gdb) l -
4	static void
5	sayHello(const char *name)
6	{
7	  std::cout << "hello " << name << std::endl;
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
(gdb) l
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
19	      sayHello(argv[i]);
20	    }
21	  }
22	}
(gdb) backtrace
#0  sayHello (name=0x7fffffffe2de "bart") at hello.cc:7
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffdff8) at hello.cc:19
(gdb) prnt name[K[K[K[K[K[K[K[K name
$14 = '\000' <repeats 32 times>
(gdb) down
#0  sayHello (name=0x7fffffffe2de "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) p name
$15 = 0x7fffffffe2de "bart"
(gdb) c
Continuing.
hello bart

Breakpoint 2, sayHello (name=0x7fffffffe2e3 "lisa") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) p name
$16 = 0x7fffffffe2e3 "lisa"
(gdb) c
Continuing.
hello lisa

Breakpoint 2, sayHello (name=0x0) at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) say[K[K[Kp name
$17 = 0x0
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffdff8) at hello.cc:19
19	      sayHello(argv[i]);
(gdb) p i
$18 = 3
(gdb) p arg[Kc[Kgc
$19 = 3
(gdb) q
A debugging session is active.

	Inferior 1 [process 3586397] will be killed.

Quit anyway? (y or n) y
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ ls
[0m[01;32mhello[0m  hello.cc  Makefile  README
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ nano hello.cc 
[?1049h[22;0;0t[1;24r(B[m[4l[?7h[39;49m[?1h=[?1h=[?1h=[?25l[39;49m(B[m[H[2J[22;33H(B[0;7m[ Reading File ](B[m[22;32H(B[0;7m[ Read 22 lines ](B[m[H(B[0;7m  GNU nano 3.2                        hello.cc                                  [1;79H(B[m[23d(B[0;7m^G(B[m Get Help  (B[0;7m^O(B[m Write Out (B[0;7m^W(B[m Where Is  (B[0;7m^K(B[m Cut Text  (B[0;7m^J(B[m Justify   (B[0;7m^C(B[m Cur Pos[24d(B[0;7m^X(B[m Exit[14G(B[0;7m^R(B[m Read File (B[0;7m^\(B[m Replace   (B[0;7m^U(B[m Uncut Text(B[0;7m^T(B[m To Spell  (B[0;7m^_(B[m Go To Line[22d[3d(B[0;1m[36m#include[39m(B[m (B[0;1m[33m<iostream>[4d[36m#include[39m(B[m (B[0;1m[33m<cstdlib>[6d(B[0m[32mstatic[39m(B[m [32mvoid[7d[39m(B[msayHello([32mconst[39m(B[m [32mchar[39m(B[m *name)[8d{[9d std::cout << (B[0;1m[33m"hello "[39m(B[m << name << std::endl;[10d}[12d[32mint[39m[42m [13d[49m(B[mmain([32mint[39m(B[m argc, [32mconst[39m(B[m [32mchar[39m(B[m *argv[])[14d{[15d (B[0;1m[33mif[39m(B[m (argc == 1) {[16;5Hstd::cerr << (B[0;1m[33m"usage: "[39m(B[m << argv[0] << (B[0;1m[33m" NAME..."[39m(B[m << std::endl;[17;5Hstd::exit(1);[18;3H}[19d(B[0;1m[33melse[39m(B[m {[20;5H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 1; i <= argc; i++) {[21;7HsayHello(argv[i]);[3d[?12l[?25h[?25l[4d[?12l[?25h[?25l[5d[?12l[?25h[?25l[6d[?12l[?25h[?25l[7d[?12l[?25h[?25l[8d[?12l[?25h[?25l[9d[?12l[?25h[?25l[10d[?12l[?25h[?25l[11d[?12l[?25h[?25l[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20d[?12l[?25h[?25l[21d[?12l[?25h[?25l7[2;21r8[10S[1;24r[10;18r[10;1H[4T[1;24r[2;1H[K[10;5H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 1; i <= argc; i++) {[11;7HsayHello(argv[i]);[12;5H}[13;3H}[14d}[K[15d[K[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[A[?12l[?25h[?25l[11;25H[?12l[?25h[?25l[?12l[?25h[?25l[A[?12l[?25h[?25l=[?12l[?25h[?25l[1;71H(B[0;7mModified[22d(B[m[K[1;79H[10;24H[1P[?12l[?25h[?25l[23;14H       (B[0;7mM-D(B[m DOS Format      (B[0;7mM-A(B[m Append          (B[0;7mM-B(B[m Backup File[24;2H(B[0;7mC(B[m Cancel           (B[0;7mM-M(B[m Mac Format      (B[0;7mM-P(B[m Prepend         (B[0;7m^T(B[m To Files[K[22d(B[0;7mFile Name to Write: hello.cc                                                    [22;1H(B[m[22;29H[?12l[?25h[?25l[K[1;79H[1;71H(B[0;7m        (B[m[22;32H(B[0;7m[ Wrote 22 lines ](B[m[23;14H(B[0;7m^O(B[m Write Out (B[0;7m^W(B[m Where Is  (B[0;7m^K(B[m Cut Text  (B[0;7m^J(B[m Justify   (B[0;7m^C(B[m Cur Pos[24;2H(B[0;7mX(B[m Exit      (B[0;7m^R(B[m Read File (B[0;7m^\(B[m Replace   (B[0;7m^U(B[m Uncut Text(B[0;7m^T(B[m To Spell  (B[0;7m^_(B[m Go To Line[22d[10;24H[?12l[?25h[?25l[22d[J[24;80H[?12l[?25h[24;1H[?1049l[23;0;0t[?1l>]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ ./hello bart lis a  
hello bart
hello lisa
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/1-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/1-hello[01;31m (master)[00m$ cd ../2-hello/
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ clear
[H[2J[3J]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ ls
hello.cc  Makefile  README
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ ls ..
[0m[01;34m1-hello[0m  [01;34m2-hello[0m  [01;34m3-overload[0m  Makefile
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ clear
[H[2J[3J]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ ls
hello.cc  Makefile  README
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ ./hello lisa bar t
Hello Lisa
Hello Bart
Segmentation fault
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ ./hello ;[K''l'i's'a' 's' [A]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ [C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ci'm'p's'o'n'[C ''b'a'r't' 's'i'm'p's'o'n'
Hello Lisa Simpson-V
Hello Bart Simpson-V
Segmentation fault
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ make
make: 'hello' is up to date.
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ clear
[H[2J[3J]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ ls
[0m[01;32mhello[0m  hello.cc  Makefile  README
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) s ''b'a'r't' 's'u'[1P'i'm'p's'o'n'[C ''l'i's'a' 's'i'm'p's'n'[1P'o'n'
The program is not being run.
(gdb) s 'bart simpson' 'lisa simpson'[1@r[1@a[1P[1P[1@t[1@a[1@r[1@t
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/2-hello/hello 'bart simpson' 'lisa simpson'

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffdfd8) at hello.cc:36
36	  if (argc == 1) {
(gdb) backtrace
#0  main (argc=3, argv=0x7fffffffdfd8) at hello.cc:36
(gdb) pr[K argc
$1 = 3
(gdb) p argv[K[K[K[K*argv@3
$2 = {
  0x7fffffffe278 "/import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/2-hello/hello", 0x7fffffffe2c6 "bart simpson", 0x7fffffffe2d3 "lisa simpson"}
(gdb) l
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
(gdb) l
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) l
Line number 49 out of range; hello.cc has 48 lines.
(gdb) b upcaseWords
Breakpoint 2 at 0x5555555551b5: file hello.cc, line 13.
(gdb) c
Continuing.

Breakpoint 2, upcaseWords (in=0x7fffffffe2c6 "bart simpson", 
    out=0x7fffffffde80 "") at hello.cc:13
13	  bool inWord = false;
(gdb) backtrace
#0  upcaseWords (in=0x7fffffffe2c6 "bart simpson", out=0x7fffffffde80 "")
    at hello.cc:13
#1  0x00005555555553e7 in main (argc=3, argv=0x7fffffffdfd8) at hello.cc:44
(gdb) l
8	 *  has enough space for the strlen(in) characters of in.
9	 */
10	void
11	upcaseWords(const char in[], char out[])
12	{
13	  bool inWord = false;
14	  const int n = std::strlen(in);
15	  for (int i = 0; i < n; i++) {
16	    if (!inWord && std::isalpha(in[i])) {
17	      out[i] = std::toupper(in[i]);
(gdb) l
18	    }
19	    else {
20	      out[i] = in[i];
21	    }
22	    inWord = std::isalpha(in[i]);
23	  }
24	}
25	
26	static void
27	sayHello(const char *name)
(gdb) backtrace
#0  upcaseWords (in=0x7fffffffe2c6 "bart simpson", out=0x7fffffffde80 "")
    at hello.cc:13
#1  0x00005555555553e7 in main (argc=3, argv=0x7fffffffdfd8) at hello.cc:44
(gdb) p out
$3 = 0x7fffffffde80 ""
(gdb) up
#1  0x00005555555553e7 in main (argc=3, argv=0x7fffffffdfd8) at hello.cc:44
44	      upcaseWords(name, friendlyName);
(gdb) l
39	  }
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) q
A debugging session is active.

	Inferior 1 [process 3587630] will be killed.

Quit anyway? (y or n) y
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ ls
[0m[01;32mhello[0m  hello.cc  Makefile  README
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ cd[K[Knano hello.cc 
[?1049h[22;0;0t[1;24r(B[m[4l[?7h[39;49m[?1h=[?1h=[?1h=[?25l[39;49m(B[m[H[2J[22;33H(B[0;7m[ Reading File ](B[m[22;32H(B[0;7m[ Read 48 lines ](B[m[H(B[0;7m  GNU nano 3.2                        hello.cc                                  [1;79H(B[m[23d(B[0;7m^G(B[m Get Help  (B[0;7m^O(B[m Write Out (B[0;7m^W(B[m Where Is  (B[0;7m^K(B[m Cut Text  (B[0;7m^J(B[m Justify   (B[0;7m^C(B[m Cur Pos[24d(B[0;7m^X(B[m Exit[14G(B[0;7m^R(B[m Read File (B[0;7m^\(B[m Replace   (B[0;7m^U(B[m Uncut Text(B[0;7m^T(B[m To Spell  (B[0;7m^_(B[m Go To Line[22d[3d(B[0;1m[36m#include[39m(B[m (B[0;1m[33m<locale>[4d[36m#include[39m(B[m (B[0;1m[33m<iostream>[5d[36m#include[39m(B[m (B[0;1m[33m<cstdlib>[6d[36m#include[39m(B[m (B[0;1m[33m<cstring>[8d[34m/** Upcase the initial letter of each word from in, copying the[9d *  results into out.  The caller is responsible to ensure that out[10d *  has enough space for the strlen(in) characters of in.[11d */[12d(B[0m[32mvoid[13d[39m(B[mupcaseWords([32mconst[39m(B[m [32mchar[39m(B[m in[], [32mchar[39m(B[m out[])[14d{[15d [32mbool[39m(B[m inWord = false;[16;3H[32mconst[39m(B[m [32mint[39m(B[m n = std::strlen(in);[17;3H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 0; i < n; i++) {[18;5H(B[0;1m[33mif[39m(B[m (!inWord && std::isalpha(in[i])) {[19;7Hout[i] = std::toupper(in[i]);[20;5H}[21d(B[0;1m[33melse[39m(B[m {[3d[?12l[?25h[?25l[4d[?12l[?25h[?25l[5d[?12l[?25h[?25l[6d[?12l[?25h[?25l[7d[?12l[?25h[?25l[8d[?12l[?25h[?25l[9d[?12l[?25h[?25l[10d[?12l[?25h[?25l[11d[?12l[?25h[?25l[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20d[?12l[?25h[?25l[21d[?12l[?25h[?25l7[2;21r8[10S[1;24r[2;1H[K[12;7Hout[i] = in[i];[13;5H}[14dinWord = std::isalpha(in[i]);[15;3H}[16d}[18d[32mstatic[39m(B[m [32mvoid[19d[39m(B[msayHello([32mconst[39m(B[m [32mchar[39m(B[m *name)[20d{[21d std::cout << (B[0;1m[33m"Hello "[39m(B[m << name << std::endl;[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[22d[K[19d[?12l[?25h[?25l[20d[?12l[?25h[?25l[21d[?12l[?25h[?25l7[2;22r8[22d[10S[1;24r[2;1H[K[12d}[15d[32mint[16d[39m(B[mmain([32mint[39m(B[m argc, [32mconst[39m(B[m [32mchar[39m(B[m *argv[])[17d{[18d (B[0;1m[33mif[39m(B[m (argc == 1) {[19;5Hstd::cerr << (B[0;1m[33m"usage: "[39m(B[m << argv[0] << (B[0;1m[33m" NAME..."[39m(B[m << std::endl;[20;5Hstd::exit(1);[21;3H}[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[A[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[2;21r[2;1H[10T[1;24r[3;1HupcaseWords([32mconst[39m(B[m [32mchar[39m(B[m in[], [32mchar[39m(B[m out[])[4d{[5d [32mbool[39m(B[m inWord = false;[6;3H[32mconst[39m(B[m [32mint[39m(B[m n = std::strlen(in);[7;3H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 0; i < n; i++) {[8;5H(B[0;1m[33mif[39m(B[m (!inWord && std::isalpha(in[i])) {[9;7Hout[i] = std::toupper(in[i]);[10;5H}[11d(B[0;1m[33melse[39m(B[m {[12;7Hout[i] = in[i];[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[9G[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l [?12l[?25h[?25ln[?12l[?25h[?25l [?12l[?25h[?25l=[?12l[?25h[?25l [?12l[?25h[?25ls[?12l[?25h[?25lt[?12l[?25h[?25ld[?12l[?25h[?25l:[?12l[?25h[?25l:[?12l[?25h[?25ls[?12l[?25h[?25lt[?12l[?25h[?25lr[?12l[?25h[?25ll[?12l[?25h[?25le[?12l[?25h[?25ln[?12l[?25h[?25l([?12l[?25h[?25li[?12l[?25h[?25ln[?12l[?25h[?25l)[?12l[?25h[?25l[7d[?12l[?25h[?25l[8d[?12l[?25h[?25l[9d[?12l[?25h[?25l[10;6H[?12l[?25h[?25l[11;11H[?12l[?25h[?25l[12;22H[?12l[?25h[?25l[13;6H[?12l[?25h[?25l[14;32H[?12l[?25h[?25l[15;4H[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18;12H[?12l[?25h[?25l[19;27H[?12l[?25h[?25l[20d{[?12l[?25h[?25l[21;32H[?12l[?25h[?25l7[2;22r8[22d[10S[1;24r[2;1H[K[12d}[15d[32mint[16d[39m(B[mmain([32mint[39m(B[m argc, [32mconst[39m(B[m [32mchar[39m(B[m *argv[])[17d{[18d (B[0;1m[33mif[39m(B[m (argc == 1) {[19;5Hstd::cerr << (B[0;1m[33m"usage: "[39m(B[m << argv[0] << (B[0;1m[33m" NAME..."[39m(B[m << std::endl;[20;5Hstd::exit(1);[21;3H}[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15;4H[?12l[?25h[?25l[16;32H[?12l[?25h[?25l[17d{[?12l[?25h[?25l[18;19H[?12l[?25h[?25l[19;32H[?12l[?25h[?25l[20;18H[?12l[?25h[?25l[21;4H[?12l[?25h[?25l7[2;22r8[22d[10S[1;24r[2;1H[K[12d  (B[0;1m[33melse[39m(B[m {[13;5H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 1; i <= argc; i++) {[14;7H[32mconst[39m(B[m [32mchar[39m(B[m *name = argv[i];[15;7H[32mchar[39m(B[m friendlyName[strlen(name)];[16;7HupcaseWords(name, friendlyName);[17;7HsayHello(friendlyName);[18;5H}[19;3H}[20d}[12;9H[?12l[?25h[?25l[13;32H[?12l[?25h[?25l[14d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18;6H[?12l[?25h[?25l[17;30H[?12l[?25h[?25l[Adl[?12l[?25h[?25l[A[?12l[?25h[?25ln[?12l[?25h[?25la[?12l[?25h[?25lm[?12l[?25h[?25le[?12l[?25h[?25l)[?12l[?25h[?25l][?12l[?25h[?25l[?12l[?25h[?25l[1;71H(B[0;7mModified(B[m[15;37H+];[?12l[?25h[?25l1];[?12l[?25h[?25l[23;14H       (B[0;7mM-D(B[m DOS Format      (B[0;7mM-A(B[m Append          (B[0;7mM-B(B[m Backup File[24;2H(B[0;7mC(B[m Cancel           (B[0;7mM-M(B[m Mac Format      (B[0;7mM-P(B[m Prepend         (B[0;7m^T(B[m To Files[K[22d(B[0;7mFile Name to Write: hello.cc                                                    [22;1H(B[m[22;29H[?12l[?25h[?25l[K[1;79H[1;71H(B[0;7m        (B[m[22;32H(B[0;7m[ Wrote 48 lines ](B[m[23;14H(B[0;7m^O(B[m Write Out (B[0;7m^W(B[m Where Is  (B[0;7m^K(B[m Cut Text  (B[0;7m^J(B[m Justify   (B[0;7m^C(B[m Cur Pos[24;2H(B[0;7mX(B[m Exit      (B[0;7m^R(B[m Read File (B[0;7m^\(B[m Replace   (B[0;7m^U(B[m Uncut Text(B[0;7m^T(B[m To Spell  (B[0;7m^_(B[m Go To Line[22d[15;39H[?12l[?25h[?25l[22d[J[24;80H[?12l[?25h[24;1H[?1049l[23;0;0t[?1l>]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ makenano hello.cc ls[Kgdb hellols[Kclear[1Pmake./hello 'lisa simpson' 'bart simpson'[A]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ [C[C[C[C[C[C[C[Clisa bart[K[A]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ [C[C[C[C[C[C[C[C'lisa simpson' 'bart simpson'
Hello Lisa Simpson‰U
Hello Bart Simpson‰U
Segmentation fault
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ ./hello 'lisa simpson' 'bart simpson'[A]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ make[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C./hello 'lisa simpson' 'bart simpson'[A]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ make[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cnano hello.cc 
[?1049h[22;0;0t[1;24r(B[m[4l[?7h[39;49m[?1h=[?1h=[?1h=[?25l[39;49m(B[m[H[2J[22;33H(B[0;7m[ Reading File ](B[m[22;32H(B[0;7m[ Read 48 lines ](B[m[H(B[0;7m  GNU nano 3.2                        hello.cc                                  [1;79H(B[m[23d(B[0;7m^G(B[m Get Help  (B[0;7m^O(B[m Write Out (B[0;7m^W(B[m Where Is  (B[0;7m^K(B[m Cut Text  (B[0;7m^J(B[m Justify   (B[0;7m^C(B[m Cur Pos[24d(B[0;7m^X(B[m Exit[14G(B[0;7m^R(B[m Read File (B[0;7m^\(B[m Replace   (B[0;7m^U(B[m Uncut Text(B[0;7m^T(B[m To Spell  (B[0;7m^_(B[m Go To Line[22d[3d(B[0;1m[36m#include[39m(B[m (B[0;1m[33m<locale>[4d[36m#include[39m(B[m (B[0;1m[33m<iostream>[5d[36m#include[39m(B[m (B[0;1m[33m<cstdlib>[6d[36m#include[39m(B[m (B[0;1m[33m<cstring>[8d[34m/** Upcase the initial letter of each word from in, copying the[9d *  results into out.  The caller is responsible to ensure that out[10d *  has enough space for the strlen(in) characters of in.[11d */[12d(B[0m[32mvoid[13d[39m(B[mupcaseWords([32mconst[39m(B[m [32mchar[39m(B[m in[], [32mchar[39m(B[m out[])[14d{[15d [32mbool[39m(B[m inWord = false;[16;3H[32mconst[39m(B[m [32mint[39m(B[m n = std::strlen(in);[17;3H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 0; i < n; i++) {[18;5H(B[0;1m[33mif[39m(B[m (!inWord && std::isalpha(in[i])) {[19;7Hout[i] = std::toupper(in[i]);[20;5H}[21d(B[0;1m[33melse[39m(B[m {[3d[?12l[?25h[?25l[4d[?12l[?25h[?25l[22d[J[24;80H[?12l[?25h[24;1H[?1049l[23;0;0t[?1l>]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ gc[Kdb
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word".
(gdb) start ''b'a'r't' 's'i'm'p's'o'n' '[1P'[C ''l'i's'a' 's'i'm'p'l'[1P's'o'n'
No symbol table loaded.  Use the "file" command.
(gdb) l
No symbol table is loaded.  Use the "file" command.
(gdb) lstart 'bart simpson' 'lisa simpson'[C[C[C[C[C[Cl[K[Kstart bar[K[K[K[K[K[K[K[K[Kquit
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ start b[K[K[K[K[K[K[Kgdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start ''a'[1P'b'a'r't' 's'i'm'p's'o'n'[C ''l'i's'a' 's'i'm'p's'o'n'
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/2-hello/hello 'bart simpson' 'lisa simpson'

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffdfd8) at hello.cc:36
36	  if (argc == 1) {
(gdb) l
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
(gdb) l
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) quit
A debugging session is active.

	Inferior 1 [process 3588279] will be killed.

Quit anyway? (y or n) nan[K[K[KEOF [assumed Y]
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ ls
[0m[01;32mhello[0m  hello.cc  Makefile  README
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ nano hello.cc 
[?1049h[22;0;0t[1;24r(B[m[4l[?7h[39;49m[?1h=[?1h=[?1h=[?25l[39;49m(B[m[H[2J[22;33H(B[0;7m[ Reading File ](B[m[22;32H(B[0;7m[ Read 48 lines ](B[m[H(B[0;7m  GNU nano 3.2                        hello.cc                                  [1;79H(B[m[23d(B[0;7m^G(B[m Get Help  (B[0;7m^O(B[m Write Out (B[0;7m^W(B[m Where Is  (B[0;7m^K(B[m Cut Text  (B[0;7m^J(B[m Justify   (B[0;7m^C(B[m Cur Pos[24d(B[0;7m^X(B[m Exit[14G(B[0;7m^R(B[m Read File (B[0;7m^\(B[m Replace   (B[0;7m^U(B[m Uncut Text(B[0;7m^T(B[m To Spell  (B[0;7m^_(B[m Go To Line[22d[3d(B[0;1m[36m#include[39m(B[m (B[0;1m[33m<locale>[4d[36m#include[39m(B[m (B[0;1m[33m<iostream>[5d[36m#include[39m(B[m (B[0;1m[33m<cstdlib>[6d[36m#include[39m(B[m (B[0;1m[33m<cstring>[8d[34m/** Upcase the initial letter of each word from in, copying the[9d *  results into out.  The caller is responsible to ensure that out[10d *  has enough space for the strlen(in) characters of in.[11d */[12d(B[0m[32mvoid[13d[39m(B[mupcaseWords([32mconst[39m(B[m [32mchar[39m(B[m in[], [32mchar[39m(B[m out[])[14d{[15d [32mbool[39m(B[m inWord = false;[16;3H[32mconst[39m(B[m [32mint[39m(B[m n = std::strlen(in);[17;3H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 0; i < n; i++) {[18;5H(B[0;1m[33mif[39m(B[m (!inWord && std::isalpha(in[i])) {[19;7Hout[i] = std::toupper(in[i]);[20;5H}[21d(B[0;1m[33melse[39m(B[m {[3d[?12l[?25h[?25l[?12l[?25h[?25l[4d[?12l[?25h[?25l[5d[?12l[?25h[?25l[6d[?12l[?25h[?25l[7d[?12l[?25h[?25l[8d[?12l[?25h[?25l[9d[?12l[?25h[?25l[10d[?12l[?25h[?25l[11d[?12l[?25h[?25l[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20d[?12l[?25h[?25l[21d[?12l[?25h[?25l[1;71H(B[0;7mModified(B[m[21d[1P[?12l[?25h[?25l    (B[0;1m[33melse[39m(B[m { [?12l[?25h[?25l[23;14H       (B[0;7mM-D(B[m DOS Format      (B[0;7mM-A(B[m Append          (B[0;7mM-B(B[m Backup File[24;2H(B[0;7mC(B[m Cancel           (B[0;7mM-M(B[m Mac Format      (B[0;7mM-P(B[m Prepend         (B[0;7m^T(B[m To Files[K[22d(B[0;7mFile Name to Write: hello.cc                                                    [22;1H(B[m[22;29H[?12l[?25h[?25l[K[1;79H[1;71H(B[0;7m        (B[m[22;32H(B[0;7m[ Wrote 48 lines ](B[m[23;14H(B[0;7m^O(B[m Write Out (B[0;7m^W(B[m Where Is  (B[0;7m^K(B[m Cut Text  (B[0;7m^J(B[m Justify   (B[0;7m^C(B[m Cur Pos[24;2H(B[0;7mX(B[m Exit      (B[0;7m^R(B[m Read File (B[0;7m^\(B[m Replace   (B[0;7m^U(B[m Uncut Text(B[0;7m^T(B[m To Spell  (B[0;7m^_(B[m Go To Line[22d[A [?12l[?25h[?25l[22d[J[24;80H[?12l[?25h[24;1H[?1049l[23;0;0t[?1l>]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ gdb hello 
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start ''b'a'r't' 's'i'm'p's'o'n'[C ''l'i's'a' 's'i'm'p's'o'n'
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/2-hello/hello 'bart simpson' 'lisa simpson'

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffdfd8) at hello.cc:36
warning: Source file is more recent than executable.
36	  if (argc == 1) {
(gdb) l
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
(gdb) n
41	    for (int i = 1; i <= argc; i++) {
(gdb) n
46	    }
(gdb) n
42	      const char *name = argv[i];
(gdb) n
43	      char friendlyName[strlen(name)+1];
(gdb) n
44	      upcaseWords(name, friendlyName);
(gdb) n[Kb 44
Breakpoint 2 at 0x5555555553d0: file hello.cc, line 44.
(gdb) n
45	      sayHello(friendlyName);
(gdb) q[Kk
Kill the program being debugged? (y or n) y
[Inferior 1 (process 3588425) killed]
(gdb) knb 44n[Klstart 'bart simpson' 'lisa simpson'[C[C[C[C[C[Cl[Kstart 'bart simpson' 'lisa simpson'
Temporary breakpoint 3 at 0x5555555552e1: file hello.cc, line 36.
Starting program: /import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/2-hello/hello 'bart simpson' 'lisa simpson'

Temporary breakpoint 3, main (argc=3, argv=0x7fffffffdfd8) at hello.cc:36
36	  if (argc == 1) {
(gdb) l
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
(gdb) s
41	    for (int i = 1; i <= argc; i++) {
(gdb) s
46	    }
(gdb) l
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) l
Line number 49 out of range; hello.cc has 48 lines.
(gdb) l -
39	  }
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) l -
29	  std::cout << "Hello " << name << std::endl;
30	}
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
(gdb) l
39	  }
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) n
42	      const char *name = argv[i];
(gdb) n
43	      char friendlyName[strlen(name)+1];
(gdb) n

Breakpoint 2, main (argc=3, argv=0x7fffffffdfd8) at hello.cc:44
44	      upcaseWords(name, friendlyName);
(gdb) s
upcaseWords (in=0x7fffffffe2c6 "bart simpson", out=0x7fffffffde80 "")
    at hello.cc:13
13	  bool inWord = false;
(gdb) l
8	 *  has enough space for the strlen(in) characters of in.
9	 */
10	void
11	upcaseWords(const char in[], char out[])
12	{
13	  bool inWord = false;
14	  const int n = std::strlen(in);
15	  for (int i = 0; i < n; i++) {
16	    if (!inWord && std::isalpha(in[i])) {
17	      out[i] = std::toupper(in[i]);
(gdb) n
14	  const int n = std::strlen(in);
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) l
10	void
11	upcaseWords(const char in[], char out[])
12	{
13	  bool inWord = false;
14	  const int n = std::strlen(in);
15	  for (int i = 0; i < n; i++) {
16	    if (!inWord && std::isalpha(in[i])) {
17	      out[i] = std::toupper(in[i]);
18	    }
19	    else {
(gdb) n
16	    if (!inWord && std::isalpha(in[i])) {
(gdb) n
17	      out[i] = std::toupper(in[i]);
(gdb) n
22	    inWord = std::isalpha(in[i]);
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) n
16	    if (!inWord && std::isalpha(in[i])) {
(gdb) p i
$1 = 1
(gdb) p n
$2 = 12
(gdb) n
20	      out[i] = in[i];
(gdb) n
22	    inWord = std::isalpha(in[i]);
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) n
16	    if (!inWord && std::isalpha(in[i])) {
(gdb) n
20	      out[i] = in[i];
(gdb) n
22	    inWord = std::isalpha(in[i]);
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) n
16	    if (!inWord && std::isalpha(in[i])) {
(gdb) n
20	      out[i] = in[i];
(gdb) n
22	    inWord = std::isalpha(in[i]);
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) p i
$3 = 3
(gdb)  12
Undefined command: "12".  Try "help".
(gdb) n 12
15	  for (int i = 0; i < n; i++) {
(gdb) p i
$4 = 6
(gdb) n 12
15	  for (int i = 0; i < n; i++) {
(gdb) p i
$5 = 9
(gdb) n 3
22	    inWord = std::isalpha(in[i]);
(gdb) p i
$6 = 10
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) n
16	    if (!inWord && std::isalpha(in[i])) {
(gdb) n
20	      out[i] = in[i];
(gdb) n
22	    inWord = std::isalpha(in[i]);
(gdb) n
15	  for (int i = 0; i < n; i++) {
(gdb) n
24	}
(gdb) n[Kp i
No symbol "i" in current context.
(gdb) l
19	    else {
20	      out[i] = in[i];
21	    }
22	    inWord = std::isalpha(in[i]);
23	  }
24	}
25	
26	static void
27	sayHello(const char *name)
28	{
(gdb) p out
$7 = 0x7fffffffde80 "Bart SimpsonUU"
(gdb) n
main (argc=3, argv=0x7fffffffdfd8) at hello.cc:45
45	      sayHello(friendlyName);
(gdb) p p[Kout
No symbol "out" in current context.
(gdb) l
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) info locals
name = 0x7fffffffe2c6 "bart simpson"
friendlyName = "Bart SimpsonU"
i = 1
(gdb) info variables
All defined variables:

File ../csu/init-first.c:
38:	int __libc_argc;
39:	char **__libc_argv;
34:	int __libc_multiple_libcs;

File ../elf/dl-sysdep.c:
58:	int __GI___libc_enable_secure;
63:	void *__GI___libc_stack_end;
60:	int __libc_multiple_libcs;
65:	void *_dl_random;

File ../login/utmp_file.c:
121:	const utfuncs __libc_utmp_file_functions;
39:	static int file_fd;
41:	static off64_t file_offset;
40:	static _Bool file_writable;
44:	static utmp last_entry;

File ../misc/syslog.c:
68:	static int LogFacility;
64:	static int LogFile;
--Type <RET> for more, q to quit, c to continue without paging--
69:	static int LogMask;
66:	static int LogStat;
67:	static const char *LogTag;
63:	static int LogType;
329:	static sockaddr_un SyslogAddr;
65:	static int connected;
73:	static __libc_lock_t syslog_lock;

File ../nss/getXXbyYY.c:
89:	static char *buffer;
86:	static __libc_lock_t lock;

File ../nss/getXXent.c:
65:	static char *buffer;
62:	static __libc_lock_t lock;

File ../nss/getXXent_r.c:
100:	static service_user *last_nip;
112:	static __libc_lock_t lock;
98:	static service_user *nip;
102:	static service_user *startp;
108:	static int stayopen_tmp;

--Type <RET> for more, q to quit, c to continue without paging--
File ../signal/allocrtsig.c:
33:	static int current_rtmax;
32:	static int current_rtmin;

File ../stdlib/strtol_l.c:
187:	const unsigned long __strtol_ul_max_tab[];
190:	const unsigned char __strtol_ul_rem_tab[];

File ../sysdeps/gnu/errlist.c:
19:	const char * const_sys_errlist_internal[135];
1473:	const int _sys_nerr_internal;

File ../sysdeps/gnu/siglist.c:
33:	const char * const__new_sys_sigabbrev[65];
25:	const char * const__new_sys_siglist[65];

File ../sysdeps/gnu/unwind-resume.c:
27:	void (*__libgcc_s_resume)(_Unwind_Exception *);
30:	static _Unwind_Reason_Code (*libgcc_s_personality)(int, 
    _Unwind_Action, _Unwind_Exception_Class, _Unwind_Exception *, 
    _Unwind_Context *);

File ../sysdeps/ieee754/dbl-64/asincos.tbl:
--Type <RET> for more, q to quit, c to continue without paging--
2597:	static const union {
    int4 i[5136];
    double x[2568];
} asncs;

File ../sysdeps/ieee754/dbl-64/atnat.h:
105:	static const number a;
106:	static const number b;
107:	static const number c;
108:	static const number d;
88:	static const number d11;
89:	static const number d13;
84:	static const number d3;
85:	static const number d5;
86:	static const number d7;
87:	static const number d9;
109:	static const number e;
99:	static const number f11;
100:	static const number f13;
101:	static const number f15;
102:	static const number f17;
103:	static const number f19;
91:	static const number f3;
--Type <RET> for more, q to quit, c to continue without paging--
93:	static const number f5;
95:	static const number f7;
97:	static const number f9;
92:	static const number ff3;
94:	static const number ff5;
96:	static const number ff7;
98:	static const number ff9;
110:	static const number hpi;
112:	static const number hpi1;
111:	static const number mhpi;
113:	static const number u1;
114:	static const number u21;
115:	static const number u22;
116:	static const number u23;
117:	static const number u24;
118:	static const number u31;
119:	static const number u32;
120:	static const number u4;
121:	static const number u5;
122:	static const number u6;
123:	static const number u7;
124:	static const number u8;
125:	static const number u9[4];
--Type <RET> for more, q to quit, c to continue without paging--

File ../sysdeps/ieee754/dbl-64/atnat2.h:
105:	static const number d11;
106:	static const number d13;
101:	static const number d3;
102:	static const number d5;
103:	static const number d7;
104:	static const number d9;
116:	static const number f11;
117:	static const number f13;
118:	static const number f15;
119:	static const number f17;
120:	static const number f19;
108:	static const number f3;
110:	static const number f5;
112:	static const number f7;
114:	static const number f9;
109:	static const number ff3;
111:	static const number ff5;
113:	static const number ff7;
115:	static const number ff9;
126:	static const number hpi;
127:	static const number hpi1;
--Type <RET> for more, q to quit, c to continue without paging--
122:	static const number inv16;
128:	static const number mhpi;
125:	static const number mopi;
130:	static const number mqpi;
132:	static const number mtqpi;
123:	static const number opi;
124:	static const number opi1;
129:	static const number qpi;
131:	static const number tqpi;
155:	static const number two500;
156:	static const number twom500;
133:	static const number u1;
134:	static const number u2;
135:	static const number u3;
136:	static const number u4;
137:	static const number u5;
138:	static const number u6;
139:	static const number u7;
140:	static const number u8;
141:	static const number u91;
142:	static const number u92;
143:	static const number u93;
144:	static const number u94;
--Type <RET> for more, q to quit, c to continue without paging--
145:	static const number ua1;
146:	static const number ua2;
147:	static const number ub;
148:	static const number uc;
149:	static const number ud[5];
154:	static const number ue;

File ../sysdeps/ieee754/dbl-64/branred.h:
51:	static const mynumber big;
52:	static const mynumber big1;
53:	static const mynumber hp0;
54:	static const mynumber hp1;
55:	static const mynumber mp1;
56:	static const mynumber mp2;
78:	static const double split;
48:	static const mynumber t576;
50:	static const mynumber tm24;
49:	static const mynumber tm600;
61:	static const double toverp[75];

File ../sysdeps/ieee754/dbl-64/dosincos.h:
73:	static const mynumber big;
64:	static const mynumber c2;
--Type <RET> for more, q to quit, c to continue without paging--
66:	static const mynumber c4;
68:	static const mynumber c6;
70:	static const mynumber c8;
65:	static const mynumber cc2;
67:	static const mynumber cc4;
69:	static const mynumber cc6;
71:	static const mynumber cc8;
75:	static const mynumber hp0;
76:	static const mynumber hp1;
58:	static const mynumber s3;
60:	static const mynumber s5;
62:	static const mynumber s7;
59:	static const mynumber ss3;
61:	static const mynumber ss5;
63:	static const mynumber ss7;

File ../sysdeps/ieee754/dbl-64/e_atanh.c:
45:	static const double huge;

File ../sysdeps/ieee754/dbl-64/e_exp10.c:
22:	static const double log10_high;
23:	static const double log10_low;

--Type <RET> for more, q to quit, c to continue without paging--
File ../sysdeps/ieee754/dbl-64/e_exp2.c:
38:	static const double TWO1023;
39:	static const double TWOM1000;

File ../sysdeps/ieee754/dbl-64/e_j0.c:
73:	static const double R[6];
77:	static const double S[5];
149:	static const double U[7];
156:	static const double V[4];
68:	static const double huge;
70:	static const double invsqrtpi;
69:	static const double one;
285:	static const double pR2[6];
269:	static const double pR3[6];
253:	static const double pR5[6];
237:	static const double pR8[6];
293:	static const double pS2[5];
277:	static const double pS3[5];
261:	static const double pS5[5];
245:	static const double pS8[5];
403:	static const double qR2[6];
386:	static const double qR3[6];
369:	static const double qR5[6];
--Type <RET> for more, q to quit, c to continue without paging--
352:	static const double qR8[6];
411:	static const double qS2[6];
394:	static const double qS3[6];
377:	static const double qS5[6];
360:	static const double qS8[6];
71:	static const double tpi;
82:	static const double zero;

File ../sysdeps/ieee754/dbl-64/e_j1.c:
76:	static const double R[4];
80:	static const double S[6];
152:	static const double U0[5];
159:	static const double V0[5];
71:	static const double huge;
73:	static const double invsqrtpi;
72:	static const double one;
293:	static const double pr2[6];
277:	static const double pr3[6];
261:	static const double pr5[6];
245:	static const double pr8[6];
301:	static const double ps2[5];
285:	static const double ps3[5];
269:	static const double ps5[5];
--Type <RET> for more, q to quit, c to continue without paging--
253:	static const double ps8[5];
412:	static const double qr2[6];
395:	static const double qr3[6];
378:	static const double qr5[6];
361:	static const double qr8[6];
420:	static const double qs2[6];
403:	static const double qs3[6];
386:	static const double qs5[6];
369:	static const double qs8[6];
74:	static const double tpi;
86:	static const double zero;

File ../sysdeps/ieee754/dbl-64/e_jn.c:
47:	static const double invsqrtpi;
49:	static const double one;
48:	static const double two;
51:	static const double zero;

File ../sysdeps/ieee754/dbl-64/e_lgamma_r.c:
90:	static const double a0;
91:	static const double a1;
100:	static const double a10;
101:	static const double a11;
--Type <RET> for more, q to quit, c to continue without paging--
92:	static const double a2;
93:	static const double a3;
94:	static const double a4;
95:	static const double a5;
96:	static const double a6;
97:	static const double a7;
98:	static const double a8;
99:	static const double a9;
87:	static const double half;
88:	static const double one;
89:	static const double pi;
139:	static const double r1;
140:	static const double r2;
141:	static const double r3;
142:	static const double r4;
143:	static const double r5;
144:	static const double r6;
132:	static const double s0;
133:	static const double s1;
134:	static const double s2;
135:	static const double s3;
136:	static const double s4;
137:	static const double s5;
--Type <RET> for more, q to quit, c to continue without paging--
138:	static const double s6;
106:	static const double t0;
107:	static const double t1;
116:	static const double t10;
117:	static const double t11;
118:	static const double t12;
119:	static const double t13;
120:	static const double t14;
108:	static const double t2;
109:	static const double t3;
110:	static const double t4;
111:	static const double t5;
112:	static const double t6;
113:	static const double t7;
114:	static const double t8;
115:	static const double t9;
102:	static const double tc;
103:	static const double tf;
105:	static const double tt;
86:	static const double two52;
121:	static const double u0;
122:	static const double u1;
123:	static const double u2;
--Type <RET> for more, q to quit, c to continue without paging--
124:	static const double u3;
125:	static const double u4;
126:	static const double u5;
127:	static const double v1;
128:	static const double v2;
129:	static const double v3;
130:	static const double v4;
131:	static const double v5;
145:	static const double w0;
146:	static const double w1;
147:	static const double w2;
148:	static const double w3;
149:	static const double w4;
150:	static const double w5;
151:	static const double w6;
153:	static const double zero;

File ../sysdeps/ieee754/dbl-64/e_pow.c:
48:	static const double huge;
48:	static const double tiny;

File ../sysdeps/ieee754/dbl-64/e_sinh.c:
41:	static const double one;
--Type <RET> for more, q to quit, c to continue without paging--
41:	static const double shuge;

File ../sysdeps/ieee754/dbl-64/eexp.tbl:
29:	static const double TBL2[268];
166:	static const double half;
167:	static const double one;
169:	static const double t2;
170:	static const double t3;
171:	static const double t4;
172:	static const double t5;

File ../sysdeps/ieee754/dbl-64/k_rem_pio2.c:
140:	static const double PIo2[8];
138:	static const int init_jk[4];
153:	static const double one;
154:	static const double two24;
155:	static const double twon24;
152:	static const double zero;

File ../sysdeps/ieee754/dbl-64/lgamma_neg.c:
80:	static const double e_hi;
80:	static const double e_lo;
85:	static const double lgamma_coeff[12];
--Type <RET> for more, q to quit, c to continue without paging--
24:	static const double lgamma_zeros[52][2];
109:	static const double poly_coeff[101];
222:	static const size_t poly_deg[8];
234:	static const size_t poly_end[8];

File ../sysdeps/ieee754/dbl-64/mpa.c:
53:	const mp_no __mpone;
54:	const mp_no __mptwo;

File ../sysdeps/ieee754/dbl-64/mpatan.h:
141:	const int __atan_np[33];
101:	const number __atan_twonm1[33];
90:	const number __atan_xm[8];

File ../sysdeps/ieee754/dbl-64/mpsqrt.h:
34:	const int __mpsqrt_mp[33];

File ../sysdeps/ieee754/dbl-64/powtwo.tbl:
26:	static const double powtwo[28];

File ../sysdeps/ieee754/dbl-64/root.tbl:
25:	static const double inroot[128];

--Type <RET> for more, q to quit, c to continue without paging--
File ../sysdeps/ieee754/dbl-64/s_asinh.c:
33:	static const double huge;
32:	static const double ln2;
31:	static const double one;

File ../sysdeps/ieee754/dbl-64/s_cbrt.c:
29:	static const double factor[5];

File ../sysdeps/ieee754/dbl-64/s_erf.c:
134:	static const double efx;
130:	static const double erx;
126:	static const double half;
127:	static const double one;
148:	static const double pa[7];
135:	static const double pp[5];
155:	static const double qa[7];
140:	static const double qq[6];
164:	static const double ra[8];
183:	static const double rb[7];
172:	static const double sa[9];
190:	static const double sb[8];
125:	static const double tiny;
128:	static const double two;
--Type <RET> for more, q to quit, c to continue without paging--

File ../sysdeps/ieee754/dbl-64/s_expm1.c:
127:	static const double Q[6];
120:	static const double huge;
125:	static const double invln2;
123:	static const double ln2_hi;
124:	static const double ln2_lo;
122:	static const double o_threshold;
121:	static const double tiny;

File ../sysdeps/ieee754/dbl-64/s_log1p.c:
92:	static const double Lp[8];
89:	static const double ln2_hi;
90:	static const double ln2_lo;
91:	static const double two54;
100:	static const double zero;

File ../sysdeps/ieee754/dbl-64/s_sin.c:
89:	static const double cs2;
90:	static const double cs4;
91:	static const double cs6;
87:	static const double sn3;
88:	static const double sn5;
--Type <RET> for more, q to quit, c to continue without paging--c

File ../sysdeps/ieee754/dbl-64/s_tanh.c:
47:	static const double one;
47:	static const double tiny;
47:	static const double two;

File ../sysdeps/ieee754/dbl-64/sincos32.h:
56:	static const mp_no hp;
38:	static const number hpinv;
45:	static const mp_no oofac27;
50:	static const mp_no pi;
39:	static const number toint;
64:	static const double toverp[75];

File ../sysdeps/ieee754/dbl-64/sincostab.c:
472:	const union {
    int4 i[880];
    double x[440];
} __sincostab;

File ../sysdeps/ieee754/dbl-64/t_exp.c:
79:	const double __exp_atable[355];
31:	const float __exp_deltatable[178];

File ../sysdeps/ieee754/dbl-64/t_exp2.h:
3:	static const double exp2_accuratetable[512];
518:	static const float exp2_deltatable[512];

File ../sysdeps/ieee754/dbl-64/uasncs.h:
40:	static const mynumber a1;
41:	static const mynumber a2;
63:	static const double big;
56:	static const double c2;
57:	static const double c3;
58:	static const double c4;
59:	static const double c5;
60:	static const double c6;
61:	static const double c7;
49:	static const double f1;
50:	static const double f2;
51:	static const double f3;
52:	static const double f4;
53:	static const double f5;
54:	static const double f6;
42:	static const mynumber hp0;
43:	static const mynumber hp1;
65:	static const double rt0;
66:	static const double rt1;
67:	static const double rt2;
68:	static const double rt3;
63:	static const double t24;
63:	static const double t27;

File ../sysdeps/ieee754/dbl-64/uatan.tbl:
5583:	static const number cij[241][7];
7274:	static const number hij[241][16];

File ../sysdeps/ieee754/dbl-64/uexp.h:
34:	static const int4 badint;
33:	static const int4 bigint;
32:	static const double hhuge;
35:	static const int4 hugeint;
53:	static const mynumber inf;
35:	static const int4 infint;
56:	static const mynumber ln_two1;
57:	static const mynumber ln_two2;
58:	static const mynumber log2e;
60:	static const mynumber p2;
61:	static const mynumber p3;
34:	static const int4 smallint;
54:	static const mynumber t256;
63:	static const mynumber three33;
64:	static const mynumber three51;
32:	static const double tiny;
32:	static const double zero;

File ../sysdeps/ieee754/dbl-64/uexp.tbl:
910:	static const union {
    int i[1424];
    double x[712];
} coar;
1271:	static const union {
    int4 i[2048];
    double x[1024];
} fine;

File ../sysdeps/ieee754/dbl-64/upow.h:
48:	static const mynumber INF;
52:	static const mynumber bigu;
53:	static const mynumber bigv;
50:	static const mynumber ln2a;
51:	static const mynumber ln2b;
49:	static const mynumber nINF;
47:	static const mynumber nZERO;
60:	static const double p2;
60:	static const double p3;
60:	static const double p4;
61:	static const double q2;
61:	static const double q3;
61:	static const double q4;
62:	static const double q5;
62:	static const double q6;
63:	static const double r3;
64:	static const double r4;
65:	static const double r5;
66:	static const double r6;
67:	static const double r7;
68:	static const double r8;
69:	static const double s3;
71:	static const double s4;
72:	static const double s5;
73:	static const double s6;
74:	static const double s7;
75:	static const double s8;
70:	static const double ss3;
54:	static const mynumber t52;
55:	static const mynumber two52e;

File ../sysdeps/ieee754/dbl-64/upow.tbl:
5108:	static const union {
    int4 i[5800];
    double x[2900];
} ui;
8010:	static const union {
    int4 i[4350];
    double x[2175];
} vj;

File ../sysdeps/ieee754/dbl-64/urem.h:
41:	static const mynumber ZERO;
38:	static const mynumber big;
42:	static const mynumber nZERO;
39:	static const mynumber t128;
40:	static const mynumber tm128;

File ../sysdeps/ieee754/dbl-64/usncs.h:
35:	static const double aa;
36:	static const double bb;
37:	static const double big;
38:	static const double hp0;
39:	static const double hp1;
45:	static const double hpinv;
40:	static const double mp1;
41:	static const double mp2;
42:	static const double mp3;
43:	static const double pp3;
44:	static const double pp4;
30:	static const double s1;
31:	static const double s2;
32:	static const double s3;
33:	static const double s4;
34:	static const double s5;
46:	static const double toint;

File ../sysdeps/ieee754/dbl-64/wordsize-64/e_acosh.c:
32:	static const double ln2;
31:	static const double one;

File ../sysdeps/ieee754/dbl-64/wordsize-64/e_cosh.c:
37:	static const double half;
37:	static const double huge;
37:	static const double one;

File ../sysdeps/ieee754/dbl-64/wordsize-64/e_fmod.c:
23:	static const double Zero[2];
23:	static const double one;

File ../sysdeps/ieee754/dbl-64/wordsize-64/e_log10.c:
51:	static const double ivln10;
52:	static const double log10_2hi;
53:	static const double log10_2lo;
50:	static const double two54;

File ../sysdeps/ieee754/dbl-64/wordsize-64/e_log2.c:
61:	static const double Lg1;
62:	static const double Lg2;
63:	static const double Lg3;
64:	static const double Lg4;
65:	static const double Lg5;
66:	static const double Lg6;
67:	static const double Lg7;
59:	static const double ln2;
60:	static const double two54;
69:	static const double zero;

File ../sysdeps/ieee754/dbl-64/wordsize-64/s_modf.c:
28:	static const double one;

File ../sysdeps/ieee754/dbl-64/wordsize-64/s_nearbyint.c:
30:	static const double TWO52[2];

File ../sysdeps/ieee754/dbl-64/wordsize-64/s_remquo.c:
26:	static const double zero;

File ../sysdeps/ieee754/dbl-64/wordsize-64/s_rint.c:
27:	static const double TWO52[2];

File ../sysdeps/ieee754/dbl-64/wordsize-64/s_scalbln.c:
25:	static const double huge;
26:	static const double tiny;
23:	static const double two54;
24:	static const double twom54;

File ../sysdeps/ieee754/dbl-64/wordsize-64/s_scalbn.c:
25:	static const double huge;
26:	static const double tiny;
23:	static const double two54;
24:	static const double twom54;

File ../sysdeps/ieee754/float128/../ldbl-128/e_acoshl.c:
35:	static const _Float128 ln2;
34:	static const _Float128 one;

File ../sysdeps/ieee754/float128/../ldbl-128/e_acosl.c:
100:	static const _Float128 P0;
101:	static const _Float128 P1;
110:	static const _Float128 P10;
102:	static const _Float128 P2;
103:	static const _Float128 P3;
104:	static const _Float128 P4;
105:	static const _Float128 P5;
106:	static const _Float128 P6;
107:	static const _Float128 P7;
108:	static const _Float128 P8;
109:	static const _Float128 P9;
111:	static const _Float128 Q0;
112:	static const _Float128 Q1;
113:	static const _Float128 Q2;
114:	static const _Float128 Q3;
115:	static const _Float128 Q4;
116:	static const _Float128 Q5;
117:	static const _Float128 Q6;
118:	static const _Float128 Q7;
119:	static const _Float128 Q8;
120:	static const _Float128 Q9;
123:	static const _Float128 acosr4375;
93:	static const _Float128 acosr5625;
61:	static const _Float128 one;
129:	static const _Float128 pS0;
130:	static const _Float128 pS1;
131:	static const _Float128 pS2;
132:	static const _Float128 pS3;
133:	static const _Float128 pS4;
134:	static const _Float128 pS5;
135:	static const _Float128 pS6;
136:	static const _Float128 pS7;
137:	static const _Float128 pS8;
138:	static const _Float128 pS9;
124:	static const _Float128 pimacosr4375;
94:	static const _Float128 pimacosr5625;
62:	static const _Float128 pio2_hi;
63:	static const _Float128 pio2_lo;
140:	static const _Float128 qS0;
141:	static const _Float128 qS1;
142:	static const _Float128 qS2;
143:	static const _Float128 qS3;
144:	static const _Float128 qS4;
145:	static const _Float128 qS5;
146:	static const _Float128 qS6;
147:	static const _Float128 qS7;
148:	static const _Float128 qS8;
69:	static const _Float128 rS0;
70:	static const _Float128 rS1;
79:	static const _Float128 rS10;
71:	static const _Float128 rS2;
72:	static const _Float128 rS3;
73:	static const _Float128 rS4;
74:	static const _Float128 rS5;
75:	static const _Float128 rS6;
76:	static const _Float128 rS7;
77:	static const _Float128 rS8;
78:	static const _Float128 rS9;
81:	static const _Float128 sS0;
82:	static const _Float128 sS1;
83:	static const _Float128 sS2;
84:	static const _Float128 sS3;
85:	static const _Float128 sS4;
86:	static const _Float128 sS5;
87:	static const _Float128 sS6;
88:	static const _Float128 sS7;
89:	static const _Float128 sS8;
90:	static const _Float128 sS9;

File ../sysdeps/ieee754/float128/../ldbl-128/e_asinl.c:
129:	static const _Float128 asinr5625;
70:	static const _Float128 huge;
69:	static const _Float128 one;
80:	static const _Float128 pS0;
81:	static const _Float128 pS1;
82:	static const _Float128 pS2;
83:	static const _Float128 pS3;
84:	static const _Float128 pS4;
85:	static const _Float128 pS5;
86:	static const _Float128 pS6;
87:	static const _Float128 pS7;
88:	static const _Float128 pS8;
89:	static const _Float128 pS9;
71:	static const _Float128 pio2_hi;
72:	static const _Float128 pio2_lo;
73:	static const _Float128 pio4_hi;
91:	static const _Float128 qS0;
92:	static const _Float128 qS1;
93:	static const _Float128 qS2;
94:	static const _Float128 qS3;
95:	static const _Float128 qS4;
96:	static const _Float128 qS5;
97:	static const _Float128 qS6;
98:	static const _Float128 qS7;
99:	static const _Float128 qS8;
105:	static const _Float128 rS0;
106:	static const _Float128 rS1;
115:	static const _Float128 rS10;
107:	static const _Float128 rS2;
108:	static const _Float128 rS3;
109:	static const _Float128 rS4;
110:	static const _Float128 rS5;
111:	static const _Float128 rS6;
112:	static const _Float128 rS7;
113:	static const _Float128 rS8;
114:	static const _Float128 rS9;
117:	static const _Float128 sS0;
118:	static const _Float128 sS1;
119:	static const _Float128 sS2;
120:	static const _Float128 sS3;
121:	static const _Float128 sS4;
122:	static const _Float128 sS5;
123:	static const _Float128 sS6;
124:	static const _Float128 sS7;
125:	static const _Float128 sS8;
126:	static const _Float128 sS9;

File ../sysdeps/ieee754/float128/../ldbl-128/e_atan2l.c:
51:	static const _Float128 pi;
52:	static const _Float128 pi_lo;
50:	static const _Float128 pi_o_2;
49:	static const _Float128 pi_o_4;
47:	static const _Float128 tiny;
48:	static const _Float128 zero;

File ../sysdeps/ieee754/float128/../ldbl-128/e_atanhl.c:
40:	static const _Float128 huge;
40:	static const _Float128 one;
42:	static const _Float128 zero;

File ../sysdeps/ieee754/float128/../ldbl-128/e_coshl.c:
57:	static const _Float128 half;
57:	static const _Float128 huge;
57:	static const _Float128 one;
58:	static const _Float128 ovf_thresh;

File ../sysdeps/ieee754/float128/../ldbl-128/e_exp10l.c:
22:	static const _Float128 log10_high;
23:	static const _Float128 log10_low;

File ../sysdeps/ieee754/float128/../ldbl-128/e_expl.c:
73:	static const _Float128 C[18];

File ../sysdeps/ieee754/float128/../ldbl-128/e_fmodl.c:
24:	static const _Float128 Zero[2];
24:	static const _Float128 one;

File ../sysdeps/ieee754/float128/../ldbl-128/e_gammal_r.c:
29:	static const _Float128 gamma_coeff[14];

File ../sysdeps/ieee754/float128/../ldbl-128/e_j0l.c:
118:	static const _Float128 J0_2D[7];
108:	static const _Float128 J0_2N[7];
99:	static const _Float128 ONEOSQPI;
146:	static const _Float128 P16_ID[10];
133:	static const _Float128 P16_IN[10];
363:	static const _Float128 P2_2r3D[9];
351:	static const _Float128 P2_2r3N[9];
334:	static const _Float128 P2r3_2r7D[9];
321:	static const _Float128 P2r3_2r7N[10];
304:	static const _Float128 P2r7_3r2D[9];
291:	static const _Float128 P2r7_3r2N[10];
273:	static const _Float128 P3r2_4D[10];
260:	static const _Float128 P3r2_4N[10];
242:	static const _Float128 P4_5D[10];
229:	static const _Float128 P4_5N[10];
211:	static const _Float128 P5_8D[10];
197:	static const _Float128 P5_8N[11];
178:	static const _Float128 P8_16D[11];
164:	static const _Float128 P8_16N[11];
395:	static const _Float128 Q16_ID[10];
381:	static const _Float128 Q16_IN[11];
626:	static const _Float128 Q2_2r3D[9];
613:	static const _Float128 Q2_2r3N[10];
595:	static const _Float128 Q2r3_2r7D[9];
582:	static const _Float128 Q2r3_2r7N[10];
563:	static const _Float128 Q2r7_3r2D[10];
550:	static const _Float128 Q2r7_3r2N[10];
531:	static const _Float128 Q3r2_4D[10];
517:	static const _Float128 Q3r2_4N[11];
498:	static const _Float128 Q4_5D[10];
484:	static const _Float128 Q4_5N[11];
464:	static const _Float128 Q5_8D[11];
450:	static const _Float128 Q5_8N[11];
429:	static const _Float128 Q8_16D[12];
414:	static const _Float128 Q8_16N[12];
101:	static const _Float128 TWOOPI;
822:	static const _Float128 U0;
810:	static const _Float128 Y0_2D[8];
799:	static const _Float128 Y0_2N[8];
102:	static const _Float128 zero;

File ../sysdeps/ieee754/float128/../ldbl-128/e_j1l.c:
124:	static const _Float128 J0_2D[7];
114:	static const _Float128 J0_2N[7];
105:	static const _Float128 ONEOSQPI;
152:	static const _Float128 P16_ID[10];
139:	static const _Float128 P16_IN[10];
372:	static const _Float128 P2_2r3D[9];
360:	static const _Float128 P2_2r3N[9];
343:	static const _Float128 P2r3_2r7D[9];
330:	static const _Float128 P2r3_2r7N[10];
313:	static const _Float128 P2r7_3r2D[9];
300:	static const _Float128 P2r7_3r2N[10];
282:	static const _Float128 P3r2_4D[10];
269:	static const _Float128 P3r2_4N[10];
251:	static const _Float128 P4_5D[10];
237:	static const _Float128 P4_5N[11];
218:	static const _Float128 P5_8D[11];
204:	static const _Float128 P5_8N[11];
185:	static const _Float128 P8_16D[11];
170:	static const _Float128 P8_16N[12];
404:	static const _Float128 Q16_ID[10];
390:	static const _Float128 Q16_IN[11];
634:	static const _Float128 Q2_2r3D[9];
621:	static const _Float128 Q2_2r3N[10];
603:	static const _Float128 Q2r3_2r7D[9];
590:	static const _Float128 Q2r3_2r7N[10];
571:	static const _Float128 Q2r7_3r2D[10];
558:	static const _Float128 Q2r7_3r2N[10];
539:	static const _Float128 Q3r2_4D[10];
526:	static const _Float128 Q3r2_4N[10];
507:	static const _Float128 Q4_5D[10];
493:	static const _Float128 Q4_5N[11];
473:	static const _Float128 Q5_8D[11];
459:	static const _Float128 Q5_8N[11];
438:	static const _Float128 Q8_16D[12];
423:	static const _Float128 Q8_16N[12];
107:	static const _Float128 TWOOPI;
830:	static const _Float128 Y0_2D[8];
819:	static const _Float128 Y0_2N[8];
108:	static const _Float128 zero;

File ../sysdeps/ieee754/float128/../ldbl-128/e_jnl.c:
66:	static const _Float128 invsqrtpi;
68:	static const _Float128 one;
67:	static const _Float128 two;
69:	static const _Float128 zero;

File ../sysdeps/ieee754/float128/../ldbl-128/e_lgammal_r.c:
76:	static const _Float128 MAXLGM;
75:	static const _Float128 PIL;
85:	static const _Float128 RASY[13];
674:	static const _Float128 RD1[8];
218:	static const _Float128 RD10[8];
186:	static const _Float128 RD11[7];
154:	static const _Float128 RD12[7];
122:	static const _Float128 RD13[7];
641:	static const _Float128 RD1r25[9];
605:	static const _Float128 RD1r5[9];
568:	static const _Float128 RD1r75[9];
532:	static const _Float128 RD2[10];
498:	static const _Float128 RD2r5[9];
463:	static const _Float128 RD3[10];
425:	static const _Float128 RD4[10];
389:	static const _Float128 RD5[9];
353:	static const _Float128 RD6[9];
319:	static const _Float128 RD7[8];
285:	static const _Float128 RD8[8];
251:	static const _Float128 RD9[8];
706:	static const _Float128 RDr9[9];
661:	static const _Float128 RN1[9];
206:	static const _Float128 RN10[8];
174:	static const _Float128 RN11[8];
142:	static const _Float128 RN12[8];
110:	static const _Float128 RN13[8];
627:	static const _Float128 RN1r25[10];
592:	static const _Float128 RN1r5[9];
555:	static const _Float128 RN1r75[9];
518:	static const _Float128 RN2[10];
485:	static const _Float128 RN2r5[9];
449:	static const _Float128 RN3[10];
411:	static const _Float128 RN4[10];
375:	static const _Float128 RN5[10];
340:	static const _Float128 RN6[9];
306:	static const _Float128 RN7[9];
272:	static const _Float128 RN8[9];
239:	static const _Float128 RN9[8];
693:	static const _Float128 RNr9[9];
78:	static const _Float128 huge;
203:	static const _Float128 lgam10a;
204:	static const _Float128 lgam10b;
171:	static const _Float128 lgam11a;
172:	static const _Float128 lgam11b;
139:	static const _Float128 lgam12a;
140:	static const _Float128 lgam12b;
107:	static const _Float128 lgam13a;
108:	static const _Float128 lgam13b;
624:	static const _Float128 lgam1r25a;
625:	static const _Float128 lgam1r25b;
552:	static const _Float128 lgam1r75a;
553:	static const _Float128 lgam1r75b;
482:	static const _Float128 lgam2r5a;
483:	static const _Float128 lgam2r5b;
445:	static const _Float128 lgam3a;
446:	static const _Float128 lgam3b;
408:	static const _Float128 lgam4a;
409:	static const _Float128 lgam4b;
372:	static const _Float128 lgam5a;
373:	static const _Float128 lgam5b;
337:	static const _Float128 lgam6a;
338:	static const _Float128 lgam6b;
303:	static const _Float128 lgam7a;
304:	static const _Float128 lgam7b;
269:	static const _Float128 lgam8a;
270:	static const _Float128 lgam8b;
236:	static const _Float128 lgam9a;
237:	static const _Float128 lgam9b;
83:	static const _Float128 ls2pi;
77:	static const _Float128 one;
587:	static const _Float128 x0a;
588:	static const _Float128 x0b;
589:	static const _Float128 y0a;
590:	static const _Float128 y0b;

File ../sysdeps/ieee754/float128/../ldbl-128/e_log10l.c:
132:	static const _Float128 L102A;
133:	static const _Float128 L102B;
135:	static const _Float128 L10EA;
136:	static const _Float128 L10EB;
71:	static const _Float128 P[13];
87:	static const _Float128 Q[12];
110:	static const _Float128 R[6];
119:	static const _Float128 S[6];
138:	static const _Float128 SQRTH;

File ../sysdeps/ieee754/float128/../ldbl-128/e_log2l.c:
131:	static const _Float128 LOG2EA;
70:	static const _Float128 P[13];
86:	static const _Float128 Q[12];
109:	static const _Float128 R[6];
118:	static const _Float128 S[6];
133:	static const _Float128 SQRTH;

File ../sysdeps/ieee754/float128/../ldbl-128/e_logl.c:
75:	static const _Float128 l10;
76:	static const _Float128 l11;
77:	static const _Float128 l12;
78:	static const _Float128 l13;
79:	static const _Float128 l14;
80:	static const _Float128 l15;
68:	static const _Float128 l3;
69:	static const _Float128 l4;
70:	static const _Float128 l5;
71:	static const _Float128 l6;
72:	static const _Float128 l7;
73:	static const _Float128 l8;
74:	static const _Float128 l9;
183:	static const _Float128 ln2a;
184:	static const _Float128 ln2b;
85:	static const _Float128 logtbl[92];

File ../sysdeps/ieee754/float128/../ldbl-128/e_powl.c:
107:	static const _Float128 LD[5];
99:	static const _Float128 LN[5];
128:	static const _Float128 PD[4];
120:	static const _Float128 PN[5];
71:	static const _Float128 bp[2];
144:	static const _Float128 cp;
145:	static const _Float128 cp_h;
146:	static const _Float128 cp_l;
77:	static const _Float128 dp_h[2];
83:	static const _Float128 dp_l[2];
92:	static const _Float128 huge;
139:	static const _Float128 lg2;
140:	static const _Float128 lg2_h;
141:	static const _Float128 lg2_l;
89:	static const _Float128 one;
142:	static const _Float128 ovt;
93:	static const _Float128 tiny;
90:	static const _Float128 two;
91:	static const _Float128 two113;
88:	static const _Float128 zero;

File ../sysdeps/ieee754/float128/../ldbl-128/e_rem_pio2l.c:
186:	static const _Float128 c[2];
26:	static const int32_t two_over_pi[938];

File ../sysdeps/ieee754/float128/../ldbl-128/e_remainderl.c:
27:	static const _Float128 zero;

File ../sysdeps/ieee754/float128/../ldbl-128/e_sinhl.c:
61:	static const _Float128 one;
62:	static const _Float128 ovf_thresh;
61:	static const _Float128 shuge;

File ../sysdeps/ieee754/float128/../ldbl-128/k_cosl.c:
23:	static const _Float128 c[19];

File ../sysdeps/ieee754/float128/../ldbl-128/k_sincosl.c:
25:	static const _Float128 c[27];

File ../sysdeps/ieee754/float128/../ldbl-128/k_sinl.c:
25:	static const _Float128 c[19];

File ../sysdeps/ieee754/float128/../ldbl-128/k_tanl.c:
74:	static const _Float128 T0;
75:	static const _Float128 T1;
76:	static const _Float128 T2;
77:	static const _Float128 T3;
78:	static const _Float128 T4;
73:	static const _Float128 TH;
80:	static const _Float128 U0;
81:	static const _Float128 U1;
82:	static const _Float128 U2;
83:	static const _Float128 U3;
84:	static const _Float128 U4;
66:	static const _Float128 one;
67:	static const _Float128 pio4hi;
68:	static const _Float128 pio4lo;

File ../sysdeps/ieee754/float128/../ldbl-128/lgamma_negl.c:
123:	static const _Float128 e_hi;
124:	static const _Float128 e_lo;
130:	static const _Float128 lgamma_coeff[27];
23:	static const _Float128 lgamma_zeros[96][2];
169:	static const _Float128 poly_coeff[208];
389:	static const size_t poly_deg[8];
401:	static const size_t poly_end[8];

File ../sysdeps/ieee754/float128/../ldbl-128/s_asinhl.c:
41:	static const _Float128 huge;
40:	static const _Float128 ln2;
39:	static const _Float128 one;

File ../sysdeps/ieee754/float128/../ldbl-128/s_atanl.c:
69:	static const _Float128 atantbl[84];
174:	static const _Float128 huge;
162:	static const _Float128 p0;
163:	static const _Float128 p1;
164:	static const _Float128 p2;
165:	static const _Float128 p3;
166:	static const _Float128 p4;
167:	static const _Float128 q0;
168:	static const _Float128 q1;
169:	static const _Float128 q2;
170:	static const _Float128 q3;
171:	static const _Float128 q4;

File ../sysdeps/ieee754/float128/../ldbl-128/s_cbrtl.c:
61:	static const _Float128 CBRT2;
63:	static const _Float128 CBRT2I;
62:	static const _Float128 CBRT4;
64:	static const _Float128 CBRT4I;

File ../sysdeps/ieee754/float128/../ldbl-128/s_erfl.c:
246:	static const _Float128 C13a;
247:	static const _Float128 C13b;
280:	static const _Float128 C14a;
281:	static const _Float128 C14b;
313:	static const _Float128 C15a;
314:	static const _Float128 C15b;
346:	static const _Float128 C16a;
347:	static const _Float128 C16b;
379:	static const _Float128 C17a;
380:	static const _Float128 C17b;
413:	static const _Float128 C18a;
414:	static const _Float128 C18b;
446:	static const _Float128 C19a;
447:	static const _Float128 C19b;
479:	static const _Float128 C20a;
480:	static const _Float128 C20b;
739:	static const _Float128 RDr1[9];
233:	static const _Float128 RDr13[8];
267:	static const _Float128 RDr14[8];
300:	static const _Float128 RDr15[8];
333:	static const _Float128 RDr16[8];
366:	static const _Float128 RDr17[8];
400:	static const _Float128 RDr18[8];
433:	static const _Float128 RDr19[8];
705:	static const _Float128 RDr2[11];
466:	static const _Float128 RDr20[8];
669:	static const _Float128 RDr3[11];
633:	static const _Float128 RDr4[11];
599:	static const _Float128 RDr5[10];
565:	static const _Float128 RDr6[10];
532:	static const _Float128 RDr7[10];
500:	static const _Float128 RDr8[9];
725:	static const _Float128 RNr1[10];
220:	static const _Float128 RNr13[9];
254:	static const _Float128 RNr14[9];
287:	static const _Float128 RNr15[9];
320:	static const _Float128 RNr16[9];
353:	static const _Float128 RNr17[9];
387:	static const _Float128 RNr18[9];
420:	static const _Float128 RNr19[9];
689:	static const _Float128 RNr2[12];
453:	static const _Float128 RNr20[9];
653:	static const _Float128 RNr3[12];
618:	static const _Float128 RNr4[11];
584:	static const _Float128 RNr5[11];
551:	static const _Float128 RNr6[10];
518:	static const _Float128 RNr7[10];
486:	static const _Float128 RNr8[10];
168:	static const _Float128 TD1[9];
201:	static const _Float128 TD2[9];
155:	static const _Float128 TN1[9];
188:	static const _Float128 TN2[9];
148:	static const _Float128 efx;
186:	static const _Float128 erf_const;
145:	static const _Float128 one;
144:	static const _Float128 tiny;
146:	static const _Float128 two;

File ../sysdeps/ieee754/float128/../ldbl-128/s_expm1l.c:
87:	static const _Float128 C1;
88:	static const _Float128 C2;
68:	static const _Float128 P0;
69:	static const _Float128 P1;
70:	static const _Float128 P2;
71:	static const _Float128 P3;
72:	static const _Float128 P4;
73:	static const _Float128 P5;
74:	static const _Float128 P6;
75:	static const _Float128 P7;
76:	static const _Float128 Q0;
77:	static const _Float128 Q1;
78:	static const _Float128 Q2;
79:	static const _Float128 Q3;
80:	static const _Float128 Q4;
81:	static const _Float128 Q5;
82:	static const _Float128 Q6;
83:	static const _Float128 Q7;
90:	static const _Float128 big;
90:	static const _Float128 minarg;

File ../sysdeps/ieee754/float128/../ldbl-128/s_frexpl.c:
35:	static const _Float128 two114;

File ../sysdeps/ieee754/float128/../ldbl-128/s_llrintl.c:
30:	static const _Float128 two112[2];

File ../sysdeps/ieee754/float128/../ldbl-128/s_log1pl.c:
116:	static const _Float128 C1;
117:	static const _Float128 C2;
79:	static const _Float128 P0;
78:	static const _Float128 P1;
69:	static const _Float128 P10;
68:	static const _Float128 P11;
67:	static const _Float128 P12;
77:	static const _Float128 P2;
76:	static const _Float128 P3;
75:	static const _Float128 P4;
74:	static const _Float128 P5;
73:	static const _Float128 P6;
72:	static const _Float128 P7;
71:	static const _Float128 P8;
70:	static const _Float128 P9;
92:	static const _Float128 Q0;
91:	static const _Float128 Q1;
82:	static const _Float128 Q10;
81:	static const _Float128 Q11;
90:	static const _Float128 Q2;
89:	static const _Float128 Q3;
88:	static const _Float128 Q4;
87:	static const _Float128 Q5;
86:	static const _Float128 Q6;
85:	static const _Float128 Q7;
84:	static const _Float128 Q8;
83:	static const _Float128 Q9;
106:	static const _Float128 R0;
105:	static const _Float128 R1;
104:	static const _Float128 R2;
103:	static const _Float128 R3;
102:	static const _Float128 R4;
101:	static const _Float128 R5;
113:	static const _Float128 S0;
112:	static const _Float128 S1;
111:	static const _Float128 S2;
110:	static const _Float128 S3;
109:	static const _Float128 S4;
108:	static const _Float128 S5;
119:	static const _Float128 sqrth;
121:	static const _Float128 zero;

File ../sysdeps/ieee754/float128/../ldbl-128/s_lrintl.c:
30:	static const _Float128 two112[2];

File ../sysdeps/ieee754/float128/../ldbl-128/s_modfl.c:
34:	static const _Float128 one;

File ../sysdeps/ieee754/float128/../ldbl-128/s_nearbyintl.c:
33:	static const _Float128 TWO112[2];

File ../sysdeps/ieee754/float128/../ldbl-128/s_remquol.c:
27:	static const _Float128 zero;

File ../sysdeps/ieee754/float128/../ldbl-128/s_rintl.c:
35:	static const _Float128 TWO112[2];

File ../sysdeps/ieee754/float128/../ldbl-128/s_scalblnl.c:
34:	static const _Float128 huge;
35:	static const _Float128 tiny;
32:	static const _Float128 two114;
33:	static const _Float128 twom114;

File ../sysdeps/ieee754/float128/../ldbl-128/s_scalbnl.c:
34:	static const _Float128 huge;
35:	static const _Float128 tiny;
32:	static const _Float128 two114;
33:	static const _Float128 twom114;

File ../sysdeps/ieee754/float128/../ldbl-128/s_tanhl.c:
50:	static const _Float128 one;
50:	static const _Float128 tiny;
50:	static const _Float128 two;

File ../sysdeps/ieee754/float128/../ldbl-128/t_expl.h:
32:	static const _Float128 __expf128_table[930];

File ../sysdeps/ieee754/float128/../ldbl-128/t_sincosl.c:
31:	const _Float128 __sincosf128_table[332];

File ../sysdeps/ieee754/flt-32/e_acosf.c:
20:	static const float one;
24:	static const float pS0;
25:	static const float pS1;
26:	static const float pS2;
27:	static const float pS3;
28:	static const float pS4;
29:	static const float pS5;
21:	static const float pi;
22:	static const float pio2_hi;
23:	static const float pio2_lo;
30:	static const float qS1;
31:	static const float qS2;
32:	static const float qS3;
33:	static const float qS4;

File ../sysdeps/ieee754/flt-32/e_acoshf.c:
25:	static const float ln2;
24:	static const float one;

File ../sysdeps/ieee754/flt-32/e_asinf.c:
49:	static const float huge;
48:	static const float one;
58:	static const float p0;
59:	static const float p1;
60:	static const float p2;
61:	static const float p3;
62:	static const float p4;
51:	static const float pio2_hi;
52:	static const float pio2_lo;
53:	static const float pio4_hi;

File ../sysdeps/ieee754/flt-32/e_atan2f.c:
24:	static const float pi;
25:	static const float pi_lo;
23:	static const float pi_o_2;
22:	static const float pi_o_4;
20:	static const float tiny;
21:	static const float zero;

File ../sysdeps/ieee754/flt-32/e_atanhf.c:
45:	static const float huge;

File ../sysdeps/ieee754/flt-32/e_coshf.c:
22:	static const float half;
21:	static const float huge;
22:	static const float one;

File ../sysdeps/ieee754/flt-32/e_exp2f_data.c:
23:	const exp2f_data __exp2f_data;

File ../sysdeps/ieee754/flt-32/e_fmodf.c:
25:	static const float Zero[2];
25:	static const float one;

File ../sysdeps/ieee754/flt-32/e_j0f.c:
28:	static const float R02;
29:	static const float R03;
30:	static const float R04;
31:	static const float R05;
32:	static const float S01;
33:	static const float S02;
34:	static const float S03;
35:	static const float S04;
23:	static const float huge;
25:	static const float invsqrtpi;
24:	static const float one;
208:	static const float pR2[6];
192:	static const float pR3[6];
176:	static const float pR5[6];
161:	static const float pR8[6];
216:	static const float pS2[5];
200:	static const float pS3[5];
184:	static const float pS5[5];
169:	static const float pS8[5];
304:	static const float qR2[6];
287:	static const float qR3[6];
270:	static const float qR5[6];
253:	static const float qR8[6];
312:	static const float qS2[6];
295:	static const float qS3[6];
278:	static const float qS5[6];
261:	static const float qS8[6];
26:	static const float tpi;
87:	static const float u00;
88:	static const float u01;
89:	static const float u02;
90:	static const float u03;
91:	static const float u04;
92:	static const float u05;
93:	static const float u06;
94:	static const float v01;
95:	static const float v02;
96:	static const float v03;
97:	static const float v04;
37:	static const float zero;

File ../sysdeps/ieee754/flt-32/e_j1f.c:
91:	static const float U0[5];
98:	static const float V0[5];
26:	static const float huge;
28:	static const float invsqrtpi;
27:	static const float one;
218:	static const float pr2[6];
202:	static const float pr3[6];
186:	static const float pr5[6];
170:	static const float pr8[6];
226:	static const float ps2[5];
210:	static const float ps3[5];
194:	static const float ps5[5];
178:	static const float ps8[5];
315:	static const float qr2[6];
298:	static const float qr3[6];
281:	static const float qr5[6];
264:	static const float qr8[6];
323:	static const float qs2[6];
306:	static const float qs3[6];
289:	static const float qs5[6];
272:	static const float qs8[6];
31:	static const float r00;
32:	static const float r01;
33:	static const float r02;
34:	static const float r03;
35:	static const float s01;
36:	static const float s02;
37:	static const float s03;
38:	static const float s04;
39:	static const float s05;
29:	static const float tpi;
41:	static const float zero;

File ../sysdeps/ieee754/flt-32/e_jnf.c:
25:	static const float one;
24:	static const float two;
27:	static const float zero;

File ../sysdeps/ieee754/flt-32/e_lgammaf_r.c:
26:	static const float a0;
27:	static const float a1;
36:	static const float a10;
37:	static const float a11;
28:	static const float a2;
29:	static const float a3;
30:	static const float a4;
31:	static const float a5;
32:	static const float a6;
33:	static const float a7;
34:	static const float a8;
35:	static const float a9;
23:	static const float half;
24:	static const float one;
25:	static const float pi;
75:	static const float r1;
76:	static const float r2;
77:	static const float r3;
78:	static const float r4;
79:	static const float r5;
80:	static const float r6;
68:	static const float s0;
69:	static const float s1;
70:	static const float s2;
71:	static const float s3;
72:	static const float s4;
73:	static const float s5;
74:	static const float s6;
42:	static const float t0;
43:	static const float t1;
52:	static const float t10;
53:	static const float t11;
54:	static const float t12;
55:	static const float t13;
56:	static const float t14;
44:	static const float t2;
45:	static const float t3;
46:	static const float t4;
47:	static const float t5;
48:	static const float t6;
49:	static const float t7;
50:	static const float t8;
51:	static const float t9;
38:	static const float tc;
39:	static const float tf;
41:	static const float tt;
22:	static const float two23;
57:	static const float u0;
58:	static const float u1;
59:	static const float u2;
60:	static const float u3;
61:	static const float u4;
62:	static const float u5;
63:	static const float v1;
64:	static const float v2;
65:	static const float v3;
66:	static const float v4;
67:	static const float v5;
81:	static const float w0;
82:	static const float w1;
83:	static const float w2;
84:	static const float w3;
85:	static const float w4;
86:	static const float w5;
87:	static const float w6;
89:	static const float zero;

File ../sysdeps/ieee754/flt-32/e_log10f.c:
22:	static const float ivln10;
23:	static const float log10_2hi;
24:	static const float log10_2lo;
21:	static const float two25;

File ../sysdeps/ieee754/flt-32/e_log2f_data.c:
21:	const log2f_data __log2f_data;

File ../sysdeps/ieee754/flt-32/e_logf_data.c:
21:	const logf_data __logf_data;

File ../sysdeps/ieee754/flt-32/e_powf_log2_data.c:
21:	const powf_log2_data __powf_log2_data;

File ../sysdeps/ieee754/flt-32/e_rem_pio2f.c:
80:	static const float half;
82:	static const float invpio2;
59:	static const int32_t npio2_hw[32];
83:	static const float pio2_1;
84:	static const float pio2_1t;
85:	static const float pio2_2;
86:	static const float pio2_2t;
87:	static const float pio2_3;
88:	static const float pio2_3t;
81:	static const float two8;
32:	static const int32_t two_over_pi[198];
79:	static const float zero;

File ../sysdeps/ieee754/flt-32/e_remainderf.c:
19:	static const float zero;

File ../sysdeps/ieee754/flt-32/e_sinhf.c:
22:	static const float one;
22:	static const float shuge;

File ../sysdeps/ieee754/flt-32/k_cosf.c:
25:	static const float C1;
26:	static const float C2;
27:	static const float C3;
28:	static const float C4;
29:	static const float C5;
30:	static const float C6;
24:	static const float one;

File ../sysdeps/ieee754/flt-32/k_rem_pio2f.c:
30:	static const float PIo2[11];
28:	static const int init_jk[3];
46:	static const float one;
47:	static const float two8;
48:	static const float twon8;
45:	static const float zero;

File ../sysdeps/ieee754/flt-32/k_sinf.c:
27:	static const float S1;
28:	static const float S2;
29:	static const float S3;
30:	static const float S4;
31:	static const float S5;
32:	static const float S6;
26:	static const float half;

File ../sysdeps/ieee754/flt-32/k_tanf.c:
28:	static const float T[13];
25:	static const float one;
26:	static const float pio4;
27:	static const float pio4lo;

File ../sysdeps/ieee754/flt-32/lgamma_negf.c:
54:	static const float e_hi;
54:	static const float e_lo;
59:	static const float lgamma_coeff[3];
24:	static const float lgamma_zeros[26][2];
74:	static const float poly_coeff[51];
137:	static const size_t poly_deg[8];
149:	static const size_t poly_end[8];

File ../sysdeps/ieee754/flt-32/s_asinhf.c:
25:	static const float huge;
24:	static const float ln2;
23:	static const float one;

File ../sysdeps/ieee754/flt-32/s_atanf.c:
40:	static const float aT[11];
26:	static const float atanhi[4];
33:	static const float atanlo[4];
56:	static const float huge;
55:	static const float one;

File ../sysdeps/ieee754/flt-32/s_cbrtf.c:
29:	static const double factor[5];

File ../sysdeps/ieee754/flt-32/s_erff.c:
39:	static const float efx;
35:	static const float erx;
31:	static const float half;
32:	static const float one;
53:	static const float pa0;
54:	static const float pa1;
55:	static const float pa2;
56:	static const float pa3;
57:	static const float pa4;
58:	static const float pa5;
59:	static const float pa6;
40:	static const float pp0;
41:	static const float pp1;
42:	static const float pp2;
43:	static const float pp3;
44:	static const float pp4;
60:	static const float qa1;
61:	static const float qa2;
62:	static const float qa3;
63:	static const float qa4;
64:	static const float qa5;
65:	static const float qa6;
45:	static const float qq1;
46:	static const float qq2;
47:	static const float qq3;
48:	static const float qq4;
49:	static const float qq5;
69:	static const float ra0;
70:	static const float ra1;
71:	static const float ra2;
72:	static const float ra3;
73:	static const float ra4;
74:	static const float ra5;
75:	static const float ra6;
76:	static const float ra7;
88:	static const float rb0;
89:	static const float rb1;
90:	static const float rb2;
91:	static const float rb3;
92:	static const float rb4;
93:	static const float rb5;
94:	static const float rb6;
77:	static const float sa1;
78:	static const float sa2;
79:	static const float sa3;
80:	static const float sa4;
81:	static const float sa5;
82:	static const float sa6;
83:	static const float sa7;
84:	static const float sa8;
95:	static const float sb1;
96:	static const float sb2;
97:	static const float sb3;
98:	static const float sb4;
99:	static const float sb5;
100:	static const float sb6;
101:	static const float sb7;
30:	static const float tiny;
33:	static const float two;

File ../sysdeps/ieee754/flt-32/s_expm1f.c:
34:	static const float Q1;
35:	static const float Q2;
36:	static const float Q3;
37:	static const float Q4;
38:	static const float Q5;
24:	static const float huge;
32:	static const float invln2;
30:	static const float ln2_hi;
31:	static const float ln2_lo;
29:	static const float o_threshold;
28:	static const float one;
25:	static const float tiny;

File ../sysdeps/ieee754/flt-32/s_frexpf.c:
25:	static const float two25;

File ../sysdeps/ieee754/flt-32/s_log1pf.c:
27:	static const float Lp1;
28:	static const float Lp2;
29:	static const float Lp3;
30:	static const float Lp4;
31:	static const float Lp5;
32:	static const float Lp6;
33:	static const float Lp7;
24:	static const float ln2_hi;
25:	static const float ln2_lo;
26:	static const float two25;
35:	static const float zero;

File ../sysdeps/ieee754/flt-32/s_modff.c:
20:	static const float one;

File ../sysdeps/ieee754/flt-32/s_nearbyintf.c:
25:	static const float TWO23[2];

File ../sysdeps/ieee754/flt-32/s_remquof.c:
25:	static const float zero;

File ../sysdeps/ieee754/flt-32/s_rintf.c:
21:	static const float TWO23[2];

File ../sysdeps/ieee754/flt-32/s_scalblnf.c:
22:	static const float huge;
23:	static const float tiny;
20:	static const float two25;
21:	static const float twom25;

File ../sysdeps/ieee754/flt-32/s_scalbnf.c:
22:	static const float huge;
23:	static const float tiny;
20:	static const float two25;
21:	static const float twom25;

File ../sysdeps/ieee754/flt-32/s_sincosf.h:
20:	static const double C0;
21:	static const double C1;
22:	static const double C2;
23:	static const double C3;
24:	static const double C4;
38:	static const double CC0;
39:	static const double CC1;
42:	static const double PI_2_hi;
43:	static const double PI_2_lo;
27:	static const double S0;
28:	static const double S1;
29:	static const double S2;
30:	static const double S3;
31:	static const double S4;
45:	static const double SMALL;
34:	static const double SS0;
35:	static const double SS1;
46:	static const double inv_PI_4;
60:	static const double invpio4_table[8];
71:	static const double ones[2];
51:	static const double pio2_table[6];

File ../sysdeps/ieee754/flt-32/s_tanhf.c:
26:	static const float one;
26:	static const float tiny;
26:	static const float two;

File ../sysdeps/ieee754/k_standard.c:
41:	static double zero;

File ../sysdeps/ieee754/k_standardl.c:
44:	static double zero;

File ../sysdeps/ieee754/ldbl-96/e_acoshl.c:
36:	static const long double ln2;
35:	static const long double one;

File ../sysdeps/ieee754/ldbl-96/e_asinl.c:
68:	static const long double huge;
67:	static const long double one;
81:	static const long double pS0;
82:	static const long double pS1;
83:	static const long double pS2;
84:	static const long double pS3;
85:	static const long double pS4;
86:	static const long double pS5;
69:	static const long double pio2_hi;
71:	static const long double pio2_lo;
73:	static const long double pio4_hi;
88:	static const long double qS0;
89:	static const long double qS1;
90:	static const long double qS2;
91:	static const long double qS3;
92:	static const long double qS4;

File ../sysdeps/ieee754/ldbl-96/e_atanhl.c:
41:	static const long double huge;
41:	static const long double one;
43:	static const long double zero;

File ../sysdeps/ieee754/ldbl-96/e_coshl.c:
40:	static const long double half;
40:	static const long double huge;
40:	static const long double one;

File ../sysdeps/ieee754/ldbl-96/e_j0l.c:
89:	static const long double R[5];
97:	static const long double S[4];
175:	static const long double U[6];
184:	static const long double V[5];
81:	static const long double huge;
83:	static const long double invsqrtpi;
82:	static const long double one;
329:	static const long double pR2[7];
308:	static const long double pR3[7];
287:	static const long double pR5[7];
266:	static const long double pR8[7];
340:	static const long double pS2[6];
319:	static const long double pS3[6];
298:	static const long double pS5[6];
277:	static const long double pS8[6];
466:	static const long double qR2[7];
444:	static const long double qR3[7];
422:	static const long double qR5[7];
400:	static const long double qR8[7];
477:	static const long double qS2[7];
455:	static const long double qS3[7];
433:	static const long double qS5[7];
411:	static const long double qS8[7];
84:	static const long double tpi;
105:	static const long double zero;

File ../sysdeps/ieee754/ldbl-96/e_j1l.c:
91:	static const long double R[5];
99:	static const long double S[4];
176:	static const long double U0[6];
184:	static const long double V0[5];
83:	static const long double huge;
85:	static const long double invsqrtpi;
84:	static const long double one;
340:	static const long double pr2[7];
317:	static const long double pr3[7];
294:	static const long double pr5[7];
271:	static const long double pr8[7];
349:	static const long double ps2[6];
326:	static const long double ps3[6];
303:	static const long double ps5[6];
280:	static const long double ps8[6];
486:	static const long double qr2[7];
462:	static const long double qr3[7];
438:	static const long double qr5[7];
414:	static const long double qr8[7];
495:	static const long double qs2[7];
471:	static const long double qs3[7];
447:	static const long double qs5[7];
423:	static const long double qs8[7];
86:	static const long double tpi;
108:	static const long double zero;

File ../sysdeps/ieee754/ldbl-96/e_jnl.c:
66:	static const long double invsqrtpi;
66:	static const long double one;
66:	static const long double two;
68:	static const long double zero;

File ../sysdeps/ieee754/ldbl-96/e_lgammal_r.c:
107:	static const long double a0;
108:	static const long double a1;
109:	static const long double a2;
110:	static const long double a3;
111:	static const long double a4;
112:	static const long double a5;
114:	static const long double b0;
115:	static const long double b1;
116:	static const long double b2;
117:	static const long double b3;
118:	static const long double b4;
133:	static const long double g0;
134:	static const long double g1;
135:	static const long double g2;
136:	static const long double g3;
137:	static const long double g4;
138:	static const long double g5;
139:	static const long double g6;
141:	static const long double h0;
142:	static const long double h1;
143:	static const long double h2;
144:	static const long double h3;
145:	static const long double h4;
146:	static const long double h5;
99:	static const long double half;
100:	static const long double one;
101:	static const long double pi;
181:	static const long double r0;
182:	static const long double r1;
183:	static const long double r2;
184:	static const long double r3;
185:	static const long double r4;
186:	static const long double r5;
187:	static const long double r6;
173:	static const long double s0;
174:	static const long double s1;
175:	static const long double s2;
176:	static const long double s3;
177:	static const long double s4;
178:	static const long double s5;
179:	static const long double s6;
122:	static const long double tc;
123:	static const long double tf;
125:	static const long double tt;
102:	static const long double two63;
153:	static const long double u0;
154:	static const long double u1;
155:	static const long double u2;
156:	static const long double u3;
157:	static const long double u4;
158:	static const long double u5;
159:	static const long double u6;
161:	static const long double v0;
162:	static const long double v1;
163:	static const long double v2;
164:	static const long double v3;
165:	static const long double v4;
166:	static const long double v5;
195:	static const long double w0;
196:	static const long double w1;
197:	static const long double w2;
198:	static const long double w3;
199:	static const long double w4;
200:	static const long double w5;
201:	static const long double w6;
202:	static const long double w7;
204:	static const long double zero;

File ../sysdeps/ieee754/ldbl-96/e_rem_pio2l.c:
24:	static const int32_t two_over_pi[938];

File ../sysdeps/ieee754/ldbl-96/e_sinhl.c:
44:	static const long double one;
44:	static const long double shuge;

File ../sysdeps/ieee754/ldbl-96/k_cosl.c:
26:	static const long double c[19];

File ../sysdeps/ieee754/ldbl-96/k_sinl.c:
31:	static const long double c[19];

File ../sysdeps/ieee754/ldbl-96/k_tanl.c:
74:	static const long double T0;
75:	static const long double T1;
76:	static const long double T2;
77:	static const long double T3;
78:	static const long double T4;
73:	static const long double TH;
80:	static const long double U0;
81:	static const long double U1;
82:	static const long double U2;
83:	static const long double U3;
84:	static const long double U4;
66:	static const long double one;
67:	static const long double pio4hi;
68:	static const long double pio4lo;

File ../sysdeps/ieee754/ldbl-96/lgamma_negl.c:
89:	static const long double e_hi;
90:	static const long double e_lo;
95:	static const long double lgamma_coeff[16];
23:	static const long double lgamma_zeros[62][2];
123:	static const long double poly_coeff[121];
256:	static const size_t poly_deg[8];
268:	static const size_t poly_end[8];

File ../sysdeps/ieee754/ldbl-96/s_asinhl.c:
41:	static const long double huge;
40:	static const long double ln2;
39:	static const long double one;

File ../sysdeps/ieee754/ldbl-96/s_cbrtl.c:
31:	static const double factor[5];
40:	static const long double third;

File ../sysdeps/ieee754/ldbl-96/s_erfl.c:
125:	static const long double efx;
120:	static const long double erx;
116:	static const long double half;
117:	static const long double one;
153:	static const long double pa[8];
127:	static const long double pp[6];
164:	static const long double qa[7];
136:	static const long double qq[6];
182:	static const long double ra[9];
212:	static const long double rb[8];
236:	static const long double rc[6];
194:	static const long double sa[9];
223:	static const long double sb[7];
245:	static const long double sc[5];
115:	static const long double tiny;
118:	static const long double two;

File ../sysdeps/ieee754/ldbl-96/s_frexpl.c:
38:	static const long double two65;

File ../sysdeps/ieee754/ldbl-96/s_modfl.c:
31:	static const long double one;

File ../sysdeps/ieee754/ldbl-96/s_remquol.c:
26:	static const long double zero;

File ../sysdeps/ieee754/ldbl-96/s_scalblnl.c:
30:	static const long double huge;
31:	static const long double tiny;
28:	static const long double two63;
29:	static const long double twom64;

File ../sysdeps/ieee754/ldbl-96/s_tanhl.c:
51:	static const long double one;
51:	static const long double tiny;
51:	static const long double two;

File ../sysdeps/ieee754/ldbl-96/t_sincosl.c:
67:	const long double __sincosl_table[332];

File ../sysdeps/ieee754/s_lib_version.c:
28:	_LIB_VERSION_TYPE _LIB_VERSION_INTERNAL;

File ../sysdeps/ieee754/s_signgam.c:
3:	int __signgam;

File ../sysdeps/posix/gai_strerror.c:
48:	static const struct {
    int16_t code;
    uint16_t idx;
} msgidx[17];
36:	static const msgstr_t msgstr;

File ../sysdeps/posix/getaddrinfo.c:
1702:	static const void *__elf_set___libc_subfreeres_element_fini__;
145:	static const addrinfo default_hints;
1244:	static const prefixentry default_labels[8];
1294:	static const prefixentry default_precedence[5];
1174:	static const scopeentry default_scopes[3];
1668:	static timespec gaiconf_mtime;
1660:	static int gaiconf_reload_flag;
1663:	static int gaiconf_reload_flag_ever_set;
126:	static const gaih_typeproto gaih_inet_typeproto[9];
1241:	static const prefixentry *labels;
110:	static const gaih_servtuple nullserv;
1291:	static const prefixentry *precedence;
1184:	static const scopeentry *scopes;

File ../sysdeps/posix/profil.c:
34:	static size_t nsamples;
35:	static size_t pc_offset;
36:	static u_int pc_scale;
33:	static u_short *samples;

File ../sysdeps/posix/signal.c:
24:	sigset_t _sigintr;

File ../sysdeps/posix/sprofil.c:
62:	static region default_overflow_region;
60:	static unsigned int overflow_counter;
72:	static prof_info prof_info;

File ../sysdeps/posix/system.c:
35:	static sigaction intr;
37:	static __libc_lock_t lock;
35:	static sigaction quit;
36:	static int sa_refcntr;

File ../sysdeps/posix/tempname.c:
175:	static const char letters[63];

File ../sysdeps/unix/bsd/getpt.c:
33:	const char __libc_ptyname1[17];
39:	const char __libc_ptyname2[17];

File ../sysdeps/unix/clock_gettime.c:
31:	static hp_timing_t freq;

File ../sysdeps/unix/getlogin.c:
27:	static char name[33];

File ../sysdeps/unix/sysv/linux/check_pf.c:
365:	static const void *__elf_set___libc_subfreeres_element_freecache__;
65:	static cached_data *cache;
66:	static __libc_lock_t lock;
59:	static cached_data noai6ai_cached;

File ../sysdeps/unix/sysv/linux/getsourcefilter.c:
42:	static const struct {
    int sol;
    int af;
    socklen_t size;
} sol_map[7];

File ../sysdeps/unix/sysv/linux/ptsname.c:
58:	static char buffer[30];

File ../sysdeps/unix/sysv/linux/sigstack.c:
63:	static const char __evoke_link_warning_sigstack[77];

File ../sysdeps/unix/sysv/linux/ttyname.c:
41:	static char *getttyname_name;
106:	static char *ttyname_buf;

File ../sysdeps/unix/sysv/linux/x86_64/brk.c:
24:	void *__curbrk;

File ../sysdeps/unix/sysv/linux/x86_64/init-first.c:
25:	long (*__vdso_clock_gettime)(clockid_t, timespec *);
27:	long (*__vdso_getcpu)(unsigned int *, unsigned int *, void *);

File ../sysdeps/wordsize-64/../../io/ftw.c:
215:	static const int ftw_arr[7];
210:	static const int nftw_arr[7];

File ../sysdeps/x86/cacheinfo.c:
462:	long __x86_data_cache_size;
461:	long __x86_data_cache_size_half;
481:	int __x86_prefetchw;
466:	long __x86_raw_data_cache_size;
464:	long __x86_raw_data_cache_size_half;
474:	long __x86_raw_shared_cache_size;
472:	long __x86_raw_shared_cache_size_half;
470:	long __x86_shared_cache_size;
469:	long __x86_shared_cache_size_half;
477:	long __x86_shared_non_temporal_threshold;
35:	static const intel_02_cache_info intel_02_known[68];

File ../sysdeps/x86/fpu/powl_helper.c:
45:	static const long double log2e_hi;
46:	static const long double log2e_lo;
27:	static const long double powl_log_table[26];

File ../sysdeps/x86_64/fpu/multiarch/s_sincosf-fma.c:
35:	static const __v2df V0;
36:	static const __v2df V1;
37:	static const __v2df V2;
38:	static const __v2df V3;
39:	static const __v2df V4;
42:	static const __v2df VC0;
43:	static const __v2df VC1;
45:	static const __v2df v2ones;

File ../sysdeps/x86_64/multiarch/varshift.c:
21:	const int8_t ___m128i_shift_right[31];

File /build/glibc-vjB4T1/glibc-2.28/build-tree/amd64-libc/dl-tunable-list.h:
39:	static tunable_t tunable_list[24];

File /build/glibc-vjB4T1/glibc-2.28/build-tree/amd64-libc/intl/plural.c:
640:	static const yytype_int8 yycheck[55];
608:	static const yytype_uint8 yydefact[27];
622:	static const yytype_int8 yydefgoto[3];
598:	static const yytype_int8 yypact[27];
616:	static const yytype_int8 yypgoto[3];
660:	static const yytype_uint8 yyr1[14];
667:	static const yytype_uint8 yyr2[14];
652:	static const yytype_uint8 yystos[27];
630:	static const yytype_uint8 yytable[55];
525:	static const yytype_uint8 yytranslate[263];

File /build/glibc-vjB4T1/glibc-2.28/build-tree/amd64-libc/stdio-common/errlist-compat.c:
25:	const int __sys_nerr_GLIBC_2_1;
40:	const int __sys_nerr_GLIBC_2_3;
55:	const int __sys_nerr_GLIBC_2_4;
77:	static const char __evoke_link_warning_sys_errlist[68];
78:	static const char __evoke_link_warning_sys_nerr[65];

File /usr/include/c++/8/bits/basic_string.h:
101:	const std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >::size_type std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >::npos;

File /usr/include/c++/8/bits/stl_pair.h:
79:	const std::piecewise_construct_t std::piecewise_construct;

File /usr/include/c++/8/bits/uses_allocator.h:
48:	const std::allocator_arg_t std::allocator_arg;

File /usr/include/c++/8/ext/numeric_traits.h:
108:	const int __gnu_cxx::__numeric_traits_floating<double>::__max_exponent10;
108:	const int __gnu_cxx::__numeric_traits_floating<float>::__max_exponent10;
108:	const int __gnu_cxx::__numeric_traits_floating<long double>::__max_exponent10;
59:	const char __gnu_cxx::__numeric_traits_integer<char>::__max;
59:	const int __gnu_cxx::__numeric_traits_integer<int>::__max;
58:	const int __gnu_cxx::__numeric_traits_integer<int>::__min;
59:	const long __gnu_cxx::__numeric_traits_integer<long>::__max;
58:	const long __gnu_cxx::__numeric_traits_integer<long>::__min;
59:	const short __gnu_cxx::__numeric_traits_integer<short>::__max;
58:	const short __gnu_cxx::__numeric_traits_integer<short>::__min;
64:	const int __gnu_cxx::__numeric_traits_integer<unsigned long>::__digits;

File /usr/include/c++/8/iostream:
74:	static std::ios_base::Init std::__ioinit;

File /usr/include/c++/8/limits:
211:	const int std::__numeric_limits_base::digits;
214:	const int std::__numeric_limits_base::digits10;
270:	const bool std::__numeric_limits_base::has_denorm_loss;
255:	const bool std::__numeric_limits_base::has_infinity;
259:	const bool std::__numeric_limits_base::has_quiet_NaN;
263:	const bool std::__numeric_limits_base::has_signaling_NaN;
279:	const bool std::__numeric_limits_base::is_bounded;
231:	const bool std::__numeric_limits_base::is_exact;
274:	const bool std::__numeric_limits_base::is_iec559;
226:	const bool std::__numeric_limits_base::is_integer;
288:	const bool std::__numeric_limits_base::is_modulo;
223:	const bool std::__numeric_limits_base::is_signed;
206:	const bool std::__numeric_limits_base::is_specialized;
219:	const int std::__numeric_limits_base::max_digits10;
248:	const int std::__numeric_limits_base::max_exponent;
252:	const int std::__numeric_limits_base::max_exponent10;
239:	const int std::__numeric_limits_base::min_exponent;
243:	const int std::__numeric_limits_base::min_exponent10;
235:	const int std::__numeric_limits_base::radix;
294:	const bool std::__numeric_limits_base::tinyness_before;
291:	const bool std::__numeric_limits_base::traps;
397:	const int std::numeric_limits<bool>::digits;
398:	const int std::numeric_limits<bool>::digits10;
423:	const bool std::numeric_limits<bool>::has_denorm_loss;
418:	const bool std::numeric_limits<bool>::has_infinity;
419:	const bool std::numeric_limits<bool>::has_quiet_NaN;
420:	const bool std::numeric_limits<bool>::has_signaling_NaN;
438:	const bool std::numeric_limits<bool>::is_bounded;
404:	const bool std::numeric_limits<bool>::is_exact;
437:	const bool std::numeric_limits<bool>::is_iec559;
403:	const bool std::numeric_limits<bool>::is_integer;
439:	const bool std::numeric_limits<bool>::is_modulo;
402:	const bool std::numeric_limits<bool>::is_signed;
385:	const bool std::numeric_limits<bool>::is_specialized;
400:	const int std::numeric_limits<bool>::max_digits10;
415:	const int std::numeric_limits<bool>::max_exponent;
416:	const int std::numeric_limits<bool>::max_exponent10;
413:	const int std::numeric_limits<bool>::min_exponent;
414:	const int std::numeric_limits<bool>::min_exponent10;
405:	const int std::numeric_limits<bool>::radix;
445:	const bool std::numeric_limits<bool>::tinyness_before;
444:	const bool std::numeric_limits<bool>::traps;
744:	const int std::numeric_limits<char16_t>::digits;
745:	const int std::numeric_limits<char16_t>::digits10;
767:	const bool std::numeric_limits<char16_t>::has_denorm_loss;
763:	const bool std::numeric_limits<char16_t>::has_infinity;
764:	const bool std::numeric_limits<char16_t>::has_quiet_NaN;
765:	const bool std::numeric_limits<char16_t>::has_signaling_NaN;
782:	const bool std::numeric_limits<char16_t>::is_bounded;
749:	const bool std::numeric_limits<char16_t>::is_exact;
781:	const bool std::numeric_limits<char16_t>::is_iec559;
748:	const bool std::numeric_limits<char16_t>::is_integer;
783:	const bool std::numeric_limits<char16_t>::is_modulo;
747:	const bool std::numeric_limits<char16_t>::is_signed;
733:	const bool std::numeric_limits<char16_t>::is_specialized;
746:	const int std::numeric_limits<char16_t>::max_digits10;
760:	const int std::numeric_limits<char16_t>::max_exponent;
761:	const int std::numeric_limits<char16_t>::max_exponent10;
758:	const int std::numeric_limits<char16_t>::min_exponent;
759:	const int std::numeric_limits<char16_t>::min_exponent10;
750:	const int std::numeric_limits<char16_t>::radix;
786:	const bool std::numeric_limits<char16_t>::tinyness_before;
785:	const bool std::numeric_limits<char16_t>::traps;
805:	const int std::numeric_limits<char32_t>::digits;
806:	const int std::numeric_limits<char32_t>::digits10;
828:	const bool std::numeric_limits<char32_t>::has_denorm_loss;
824:	const bool std::numeric_limits<char32_t>::has_infinity;
825:	const bool std::numeric_limits<char32_t>::has_quiet_NaN;
826:	const bool std::numeric_limits<char32_t>::has_signaling_NaN;
843:	const bool std::numeric_limits<char32_t>::is_bounded;
810:	const bool std::numeric_limits<char32_t>::is_exact;
842:	const bool std::numeric_limits<char32_t>::is_iec559;
809:	const bool std::numeric_limits<char32_t>::is_integer;
844:	const bool std::numeric_limits<char32_t>::is_modulo;
808:	const bool std::numeric_limits<char32_t>::is_signed;
794:	const bool std::numeric_limits<char32_t>::is_specialized;
807:	const int std::numeric_limits<char32_t>::max_digits10;
821:	const int std::numeric_limits<char32_t>::max_exponent;
822:	const int std::numeric_limits<char32_t>::max_exponent10;
819:	const int std::numeric_limits<char32_t>::min_exponent;
820:	const int std::numeric_limits<char32_t>::min_exponent10;
811:	const int std::numeric_limits<char32_t>::radix;
847:	const bool std::numeric_limits<char32_t>::tinyness_before;
846:	const bool std::numeric_limits<char32_t>::traps;
467:	const int std::numeric_limits<char>::digits;
468:	const int std::numeric_limits<char>::digits10;
493:	const bool std::numeric_limits<char>::has_denorm_loss;
488:	const bool std::numeric_limits<char>::has_infinity;
489:	const bool std::numeric_limits<char>::has_quiet_NaN;
490:	const bool std::numeric_limits<char>::has_signaling_NaN;
508:	const bool std::numeric_limits<char>::is_bounded;
474:	const bool std::numeric_limits<char>::is_exact;
507:	const bool std::numeric_limits<char>::is_iec559;
473:	const bool std::numeric_limits<char>::is_integer;
509:	const bool std::numeric_limits<char>::is_modulo;
472:	const bool std::numeric_limits<char>::is_signed;
454:	const bool std::numeric_limits<char>::is_specialized;
470:	const int std::numeric_limits<char>::max_digits10;
485:	const int std::numeric_limits<char>::max_exponent;
486:	const int std::numeric_limits<char>::max_exponent10;
483:	const int std::numeric_limits<char>::min_exponent;
484:	const int std::numeric_limits<char>::min_exponent10;
475:	const int std::numeric_limits<char>::radix;
512:	const bool std::numeric_limits<char>::tinyness_before;
511:	const bool std::numeric_limits<char>::traps;
1684:	const int std::numeric_limits<double>::digits;
1685:	const int std::numeric_limits<double>::digits10;
1711:	const bool std::numeric_limits<double>::has_denorm_loss;
1706:	const bool std::numeric_limits<double>::has_infinity;
1707:	const bool std::numeric_limits<double>::has_quiet_NaN;
1708:	const bool std::numeric_limits<double>::has_signaling_NaN;
1728:	const bool std::numeric_limits<double>::is_bounded;
1692:	const bool std::numeric_limits<double>::is_exact;
1726:	const bool std::numeric_limits<double>::is_iec559;
1691:	const bool std::numeric_limits<double>::is_integer;
1729:	const bool std::numeric_limits<double>::is_modulo;
1690:	const bool std::numeric_limits<double>::is_signed;
1671:	const bool std::numeric_limits<double>::is_specialized;
1687:	const int std::numeric_limits<double>::max_digits10;
1703:	const int std::numeric_limits<double>::max_exponent;
1704:	const int std::numeric_limits<double>::max_exponent10;
1701:	const int std::numeric_limits<double>::min_exponent;
1702:	const int std::numeric_limits<double>::min_exponent10;
1693:	const int std::numeric_limits<double>::radix;
1732:	const bool std::numeric_limits<double>::tinyness_before;
1731:	const bool std::numeric_limits<double>::traps;
1609:	const int std::numeric_limits<float>::digits;
1610:	const int std::numeric_limits<float>::digits10;
1636:	const bool std::numeric_limits<float>::has_denorm_loss;
1631:	const bool std::numeric_limits<float>::has_infinity;
1632:	const bool std::numeric_limits<float>::has_quiet_NaN;
1633:	const bool std::numeric_limits<float>::has_signaling_NaN;
1653:	const bool std::numeric_limits<float>::is_bounded;
1617:	const bool std::numeric_limits<float>::is_exact;
1651:	const bool std::numeric_limits<float>::is_iec559;
1616:	const bool std::numeric_limits<float>::is_integer;
1654:	const bool std::numeric_limits<float>::is_modulo;
1615:	const bool std::numeric_limits<float>::is_signed;
1596:	const bool std::numeric_limits<float>::is_specialized;
1612:	const int std::numeric_limits<float>::max_digits10;
1628:	const int std::numeric_limits<float>::max_exponent;
1629:	const int std::numeric_limits<float>::max_exponent10;
1626:	const int std::numeric_limits<float>::min_exponent;
1627:	const int std::numeric_limits<float>::min_exponent10;
1618:	const int std::numeric_limits<float>::radix;
1657:	const bool std::numeric_limits<float>::tinyness_before;
1656:	const bool std::numeric_limits<float>::traps;
1009:	const int std::numeric_limits<int>::digits;
1010:	const int std::numeric_limits<int>::digits10;
1035:	const bool std::numeric_limits<int>::has_denorm_loss;
1030:	const bool std::numeric_limits<int>::has_infinity;
1031:	const bool std::numeric_limits<int>::has_quiet_NaN;
1032:	const bool std::numeric_limits<int>::has_signaling_NaN;
1050:	const bool std::numeric_limits<int>::is_bounded;
1016:	const bool std::numeric_limits<int>::is_exact;
1049:	const bool std::numeric_limits<int>::is_iec559;
1015:	const bool std::numeric_limits<int>::is_integer;
1051:	const bool std::numeric_limits<int>::is_modulo;
1014:	const bool std::numeric_limits<int>::is_signed;
996:	const bool std::numeric_limits<int>::is_specialized;
1012:	const int std::numeric_limits<int>::max_digits10;
1027:	const int std::numeric_limits<int>::max_exponent;
1028:	const int std::numeric_limits<int>::max_exponent10;
1025:	const int std::numeric_limits<int>::min_exponent;
1026:	const int std::numeric_limits<int>::min_exponent10;
1017:	const int std::numeric_limits<int>::radix;
1054:	const bool std::numeric_limits<int>::tinyness_before;
1053:	const bool std::numeric_limits<int>::traps;
1759:	const int std::numeric_limits<long double>::digits;
1760:	const int std::numeric_limits<long double>::digits10;
1786:	const bool std::numeric_limits<long double>::has_denorm_loss;
1781:	const bool std::numeric_limits<long double>::has_infinity;
1782:	const bool std::numeric_limits<long double>::has_quiet_NaN;
1783:	const bool std::numeric_limits<long double>::has_signaling_NaN;
1803:	const bool std::numeric_limits<long double>::is_bounded;
1767:	const bool std::numeric_limits<long double>::is_exact;
1801:	const bool std::numeric_limits<long double>::is_iec559;
1766:	const bool std::numeric_limits<long double>::is_integer;
1804:	const bool std::numeric_limits<long double>::is_modulo;
1765:	const bool std::numeric_limits<long double>::is_signed;
1746:	const bool std::numeric_limits<long double>::is_specialized;
1762:	const int std::numeric_limits<long double>::max_digits10;
1778:	const int std::numeric_limits<long double>::max_exponent;
1779:	const int std::numeric_limits<long double>::max_exponent10;
1776:	const int std::numeric_limits<long double>::min_exponent;
1777:	const int std::numeric_limits<long double>::min_exponent10;
1768:	const int std::numeric_limits<long double>::radix;
1807:	const bool std::numeric_limits<long double>::tinyness_before;
1806:	const bool std::numeric_limits<long double>::traps;
1288:	const int std::numeric_limits<long long>::digits;
1290:	const int std::numeric_limits<long long>::digits10;
1316:	const bool std::numeric_limits<long long>::has_denorm_loss;
1311:	const bool std::numeric_limits<long long>::has_infinity;
1312:	const bool std::numeric_limits<long long>::has_quiet_NaN;
1313:	const bool std::numeric_limits<long long>::has_signaling_NaN;
1332:	const bool std::numeric_limits<long long>::is_bounded;
1297:	const bool std::numeric_limits<long long>::is_exact;
1331:	const bool std::numeric_limits<long long>::is_iec559;
1296:	const bool std::numeric_limits<long long>::is_integer;
1333:	const bool std::numeric_limits<long long>::is_modulo;
1295:	const bool std::numeric_limits<long long>::is_signed;
1275:	const bool std::numeric_limits<long long>::is_specialized;
1293:	const int std::numeric_limits<long long>::max_digits10;
1308:	const int std::numeric_limits<long long>::max_exponent;
1309:	const int std::numeric_limits<long long>::max_exponent10;
1306:	const int std::numeric_limits<long long>::min_exponent;
1307:	const int std::numeric_limits<long long>::min_exponent10;
1298:	const int std::numeric_limits<long long>::radix;
1336:	const bool std::numeric_limits<long long>::tinyness_before;
1335:	const bool std::numeric_limits<long long>::traps;
1148:	const int std::numeric_limits<long>::digits;
1149:	const int std::numeric_limits<long>::digits10;
1174:	const bool std::numeric_limits<long>::has_denorm_loss;
1169:	const bool std::numeric_limits<long>::has_infinity;
1170:	const bool std::numeric_limits<long>::has_quiet_NaN;
1171:	const bool std::numeric_limits<long>::has_signaling_NaN;
1189:	const bool std::numeric_limits<long>::is_bounded;
1155:	const bool std::numeric_limits<long>::is_exact;
1188:	const bool std::numeric_limits<long>::is_iec559;
1154:	const bool std::numeric_limits<long>::is_integer;
1190:	const bool std::numeric_limits<long>::is_modulo;
1153:	const bool std::numeric_limits<long>::is_signed;
1135:	const bool std::numeric_limits<long>::is_specialized;
1151:	const int std::numeric_limits<long>::max_digits10;
1166:	const int std::numeric_limits<long>::max_exponent;
1167:	const int std::numeric_limits<long>::max_exponent10;
1164:	const int std::numeric_limits<long>::min_exponent;
1165:	const int std::numeric_limits<long>::min_exponent10;
1156:	const int std::numeric_limits<long>::radix;
1193:	const bool std::numeric_limits<long>::tinyness_before;
1192:	const bool std::numeric_limits<long>::traps;
869:	const int std::numeric_limits<short>::digits;
870:	const int std::numeric_limits<short>::digits10;
895:	const bool std::numeric_limits<short>::has_denorm_loss;
890:	const bool std::numeric_limits<short>::has_infinity;
891:	const bool std::numeric_limits<short>::has_quiet_NaN;
892:	const bool std::numeric_limits<short>::has_signaling_NaN;
910:	const bool std::numeric_limits<short>::is_bounded;
876:	const bool std::numeric_limits<short>::is_exact;
909:	const bool std::numeric_limits<short>::is_iec559;
875:	const bool std::numeric_limits<short>::is_integer;
911:	const bool std::numeric_limits<short>::is_modulo;
874:	const bool std::numeric_limits<short>::is_signed;
856:	const bool std::numeric_limits<short>::is_specialized;
872:	const int std::numeric_limits<short>::max_digits10;
887:	const int std::numeric_limits<short>::max_exponent;
888:	const int std::numeric_limits<short>::max_exponent10;
885:	const int std::numeric_limits<short>::min_exponent;
886:	const int std::numeric_limits<short>::min_exponent10;
877:	const int std::numeric_limits<short>::radix;
914:	const bool std::numeric_limits<short>::tinyness_before;
913:	const bool std::numeric_limits<short>::traps;
534:	const int std::numeric_limits<signed char>::digits;
535:	const int std::numeric_limits<signed char>::digits10;
561:	const bool std::numeric_limits<signed char>::has_denorm_loss;
556:	const bool std::numeric_limits<signed char>::has_infinity;
557:	const bool std::numeric_limits<signed char>::has_quiet_NaN;
558:	const bool std::numeric_limits<signed char>::has_signaling_NaN;
578:	const bool std::numeric_limits<signed char>::is_bounded;
542:	const bool std::numeric_limits<signed char>::is_exact;
577:	const bool std::numeric_limits<signed char>::is_iec559;
541:	const bool std::numeric_limits<signed char>::is_integer;
579:	const bool std::numeric_limits<signed char>::is_modulo;
540:	const bool std::numeric_limits<signed char>::is_signed;
521:	const bool std::numeric_limits<signed char>::is_specialized;
538:	const int std::numeric_limits<signed char>::max_digits10;
553:	const int std::numeric_limits<signed char>::max_exponent;
554:	const int std::numeric_limits<signed char>::max_exponent10;
551:	const int std::numeric_limits<signed char>::min_exponent;
552:	const int std::numeric_limits<signed char>::min_exponent10;
543:	const int std::numeric_limits<signed char>::radix;
582:	const bool std::numeric_limits<signed char>::tinyness_before;
581:	const bool std::numeric_limits<signed char>::traps;
604:	const int std::numeric_limits<unsigned char>::digits;
606:	const int std::numeric_limits<unsigned char>::digits10;
632:	const bool std::numeric_limits<unsigned char>::has_denorm_loss;
627:	const bool std::numeric_limits<unsigned char>::has_infinity;
628:	const bool std::numeric_limits<unsigned char>::has_quiet_NaN;
629:	const bool std::numeric_limits<unsigned char>::has_signaling_NaN;
651:	const bool std::numeric_limits<unsigned char>::is_bounded;
613:	const bool std::numeric_limits<unsigned char>::is_exact;
650:	const bool std::numeric_limits<unsigned char>::is_iec559;
612:	const bool std::numeric_limits<unsigned char>::is_integer;
652:	const bool std::numeric_limits<unsigned char>::is_modulo;
611:	const bool std::numeric_limits<unsigned char>::is_signed;
591:	const bool std::numeric_limits<unsigned char>::is_specialized;
609:	const int std::numeric_limits<unsigned char>::max_digits10;
624:	const int std::numeric_limits<unsigned char>::max_exponent;
625:	const int std::numeric_limits<unsigned char>::max_exponent10;
622:	const int std::numeric_limits<unsigned char>::min_exponent;
623:	const int std::numeric_limits<unsigned char>::min_exponent10;
614:	const int std::numeric_limits<unsigned char>::radix;
655:	const bool std::numeric_limits<unsigned char>::tinyness_before;
654:	const bool std::numeric_limits<unsigned char>::traps;
1076:	const int std::numeric_limits<unsigned int>::digits;
1078:	const int std::numeric_limits<unsigned int>::digits10;
1104:	const bool std::numeric_limits<unsigned int>::has_denorm_loss;
1099:	const bool std::numeric_limits<unsigned int>::has_infinity;
1100:	const bool std::numeric_limits<unsigned int>::has_quiet_NaN;
1101:	const bool std::numeric_limits<unsigned int>::has_signaling_NaN;
1122:	const bool std::numeric_limits<unsigned int>::is_bounded;
1085:	const bool std::numeric_limits<unsigned int>::is_exact;
1121:	const bool std::numeric_limits<unsigned int>::is_iec559;
1084:	const bool std::numeric_limits<unsigned int>::is_integer;
1123:	const bool std::numeric_limits<unsigned int>::is_modulo;
1083:	const bool std::numeric_limits<unsigned int>::is_signed;
1063:	const bool std::numeric_limits<unsigned int>::is_specialized;
1081:	const int std::numeric_limits<unsigned int>::max_digits10;
1096:	const int std::numeric_limits<unsigned int>::max_exponent;
1097:	const int std::numeric_limits<unsigned int>::max_exponent10;
1094:	const int std::numeric_limits<unsigned int>::min_exponent;
1095:	const int std::numeric_limits<unsigned int>::min_exponent10;
1086:	const int std::numeric_limits<unsigned int>::radix;
1126:	const bool std::numeric_limits<unsigned int>::tinyness_before;
1125:	const bool std::numeric_limits<unsigned int>::traps;
1358:	const int std::numeric_limits<unsigned long long>::digits;
1360:	const int std::numeric_limits<unsigned long long>::digits10;
1386:	const bool std::numeric_limits<unsigned long long>::has_denorm_loss;
1381:	const bool std::numeric_limits<unsigned long long>::has_infinity;
1382:	const bool std::numeric_limits<unsigned long long>::has_quiet_NaN;
1383:	const bool std::numeric_limits<unsigned long long>::has_signaling_NaN;
1405:	const bool std::numeric_limits<unsigned long long>::is_bounded;
1367:	const bool std::numeric_limits<unsigned long long>::is_exact;
1404:	const bool std::numeric_limits<unsigned long long>::is_iec559;
1366:	const bool std::numeric_limits<unsigned long long>::is_integer;
1406:	const bool std::numeric_limits<unsigned long long>::is_modulo;
1365:	const bool std::numeric_limits<unsigned long long>::is_signed;
1345:	const bool std::numeric_limits<unsigned long long>::is_specialized;
1363:	const int std::numeric_limits<unsigned long long>::max_digits10;
1378:	const int std::numeric_limits<unsigned long long>::max_exponent;
1379:	const int std::numeric_limits<unsigned long long>::max_exponent10;
1376:	const int std::numeric_limits<unsigned long long>::min_exponent;
1377:	const int std::numeric_limits<unsigned long long>::min_exponent10;
1368:	const int std::numeric_limits<unsigned long long>::radix;
1409:	const bool std::numeric_limits<unsigned long long>::tinyness_before;
1408:	const bool std::numeric_limits<unsigned long long>::traps;
1215:	const int std::numeric_limits<unsigned long>::digits;
1217:	const int std::numeric_limits<unsigned long>::digits10;
1243:	const bool std::numeric_limits<unsigned long>::has_denorm_loss;
1238:	const bool std::numeric_limits<unsigned long>::has_infinity;
1239:	const bool std::numeric_limits<unsigned long>::has_quiet_NaN;
1240:	const bool std::numeric_limits<unsigned long>::has_signaling_NaN;
1262:	const bool std::numeric_limits<unsigned long>::is_bounded;
1224:	const bool std::numeric_limits<unsigned long>::is_exact;
1261:	const bool std::numeric_limits<unsigned long>::is_iec559;
1223:	const bool std::numeric_limits<unsigned long>::is_integer;
1263:	const bool std::numeric_limits<unsigned long>::is_modulo;
1222:	const bool std::numeric_limits<unsigned long>::is_signed;
1202:	const bool std::numeric_limits<unsigned long>::is_specialized;
1220:	const int std::numeric_limits<unsigned long>::max_digits10;
1235:	const int std::numeric_limits<unsigned long>::max_exponent;
1236:	const int std::numeric_limits<unsigned long>::max_exponent10;
1233:	const int std::numeric_limits<unsigned long>::min_exponent;
1234:	const int std::numeric_limits<unsigned long>::min_exponent10;
1225:	const int std::numeric_limits<unsigned long>::radix;
1266:	const bool std::numeric_limits<unsigned long>::tinyness_before;
1265:	const bool std::numeric_limits<unsigned long>::traps;
936:	const int std::numeric_limits<unsigned short>::digits;
938:	const int std::numeric_limits<unsigned short>::digits10;
964:	const bool std::numeric_limits<unsigned short>::has_denorm_loss;
959:	const bool std::numeric_limits<unsigned short>::has_infinity;
960:	const bool std::numeric_limits<unsigned short>::has_quiet_NaN;
961:	const bool std::numeric_limits<unsigned short>::has_signaling_NaN;
983:	const bool std::numeric_limits<unsigned short>::is_bounded;
945:	const bool std::numeric_limits<unsigned short>::is_exact;
982:	const bool std::numeric_limits<unsigned short>::is_iec559;
944:	const bool std::numeric_limits<unsigned short>::is_integer;
984:	const bool std::numeric_limits<unsigned short>::is_modulo;
943:	const bool std::numeric_limits<unsigned short>::is_signed;
923:	const bool std::numeric_limits<unsigned short>::is_specialized;
941:	const int std::numeric_limits<unsigned short>::max_digits10;
956:	const int std::numeric_limits<unsigned short>::max_exponent;
957:	const int std::numeric_limits<unsigned short>::max_exponent10;
954:	const int std::numeric_limits<unsigned short>::min_exponent;
955:	const int std::numeric_limits<unsigned short>::min_exponent10;
946:	const int std::numeric_limits<unsigned short>::radix;
987:	const bool std::numeric_limits<unsigned short>::tinyness_before;
986:	const bool std::numeric_limits<unsigned short>::traps;
677:	const int std::numeric_limits<wchar_t>::digits;
678:	const int std::numeric_limits<wchar_t>::digits10;
704:	const bool std::numeric_limits<wchar_t>::has_denorm_loss;
699:	const bool std::numeric_limits<wchar_t>::has_infinity;
700:	const bool std::numeric_limits<wchar_t>::has_quiet_NaN;
701:	const bool std::numeric_limits<wchar_t>::has_signaling_NaN;
719:	const bool std::numeric_limits<wchar_t>::is_bounded;
685:	const bool std::numeric_limits<wchar_t>::is_exact;
718:	const bool std::numeric_limits<wchar_t>::is_iec559;
684:	const bool std::numeric_limits<wchar_t>::is_integer;
720:	const bool std::numeric_limits<wchar_t>::is_modulo;
683:	const bool std::numeric_limits<wchar_t>::is_signed;
664:	const bool std::numeric_limits<wchar_t>::is_specialized;
681:	const int std::numeric_limits<wchar_t>::max_digits10;
696:	const int std::numeric_limits<wchar_t>::max_exponent;
697:	const int std::numeric_limits<wchar_t>::max_exponent10;
694:	const int std::numeric_limits<wchar_t>::min_exponent;
695:	const int std::numeric_limits<wchar_t>::min_exponent10;
686:	const int std::numeric_limits<wchar_t>::radix;
723:	const bool std::numeric_limits<wchar_t>::tinyness_before;
722:	const bool std::numeric_limits<wchar_t>::traps;

File /usr/include/c++/8/tuple:
1642:	const std::_Swallow_assign std::ignore;

File /usr/include/c++/8/type_traits:
59:	const bool std::integral_constant<bool, false>::value;
59:	const bool std::integral_constant<bool, true>::value;
59:	const unsigned long std::integral_constant<unsigned long, 0ul>::value;

File /usr/include/c++/8/utility:
353:	const std::in_place_t std::in_place;

File C-address.c:
26:	const __locale_data _nl_C_LC_ADDRESS;

File C-collate.c:
101:	const __locale_data _nl_C_LC_COLLATE;
23:	static const char collseqmb[256];
59:	static const uint32_t collseqwc[263];

File C-ctype.c:
541:	const __locale_data _nl_C_LC_CTYPE;
33:	const char _nl_C_LC_CTYPE_class[768];
99:	const char _nl_C_LC_CTYPE_class32[1024];
443:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[1];
    uint32_t level3[4];
} _nl_C_LC_CTYPE_class_alnum;
326:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[2];
    uint32_t level3[2];
} _nl_C_LC_CTYPE_class_alpha;
404:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[1];
    uint32_t level3[2];
} _nl_C_LC_CTYPE_class_blank;
417:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[1];
    uint32_t level3[4];
} _nl_C_LC_CTYPE_class_cntrl;
339:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[1];
    uint32_t level3[2];
} _nl_C_LC_CTYPE_class_digit;
391:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[1];
    uint32_t level3[4];
} _nl_C_LC_CTYPE_class_graph;
313:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[2];
    uint32_t level3[2];
} _nl_C_LC_CTYPE_class_lower;
378:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[1];
    uint32_t level3[4];
} _nl_C_LC_CTYPE_class_print;
430:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[1];
    uint32_t level3[4];
} _nl_C_LC_CTYPE_class_punct;
365:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[1];
    uint32_t level3[2];
} _nl_C_LC_CTYPE_class_space;
300:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[2];
    uint32_t level3[2];
} _nl_C_LC_CTYPE_class_upper;
352:	const struct {
    uint32_t isctype_data[8];
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[1];
    uint32_t level3[4];
} _nl_C_LC_CTYPE_class_xdigit;
483:	const struct {
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[4];
    int32_t level3[32];
} _nl_C_LC_CTYPE_map_tolower;
464:	const struct {
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[4];
    int32_t level3[32];
} _nl_C_LC_CTYPE_map_toupper;
238:	const uint32_t _nl_C_LC_CTYPE_tolower[384];
187:	const uint32_t _nl_C_LC_CTYPE_toupper[384];
510:	const struct {
    uint32_t header[5];
    uint32_t level1[1];
    uint32_t level2[8];
    int8_t level3[33];
} _nl_C_LC_CTYPE_width;

File C-identification.c:
26:	const __locale_data _nl_C_LC_IDENTIFICATION;

File C-measurement.c:
26:	const __locale_data _nl_C_LC_MEASUREMENT;

File C-messages.c:
26:	const __locale_data _nl_C_LC_MESSAGES;

File C-monetary.c:
27:	const __locale_data _nl_C_LC_MONETARY;
25:	static const uint32_t conversion_rate[2];
24:	static const char not_available[2];

File C-name.c:
26:	const __locale_data _nl_C_LC_NAME;

File C-numeric.c:
23:	const __locale_data _nl_C_LC_NUMERIC;

File C-paper.c:
26:	const __locale_data _nl_C_LC_PAPER;

File C-telephone.c:
26:	const __locale_data _nl_C_LC_TELEPHONE;

File C-time.c:
26:	const __locale_data _nl_C_LC_TIME;

File C-translit.h:
3:	static const uint32_t translit_from_idx[1353];
119:	static const wchar_t translit_from_tbl[2706];
466:	static const uint32_t translit_to_idx[1353];
582:	static const wchar_t translit_to_tbl[4797];

File C_name.c:
11:	const char _nl_C_codeset[];
7:	const char _nl_C_name[];
8:	const char _nl_POSIX_name[];

File SYS_libc.c:
6:	const char __GI__libc_intl_domainname[];

File a64l.c:
27:	static const char a64l_table[77];

File abort.c:
35:	abort_msg_s *__GI___abort_msg;
43:	static __libc_lock_recursive_t lock;
40:	static int stage;

File arena.c:
100:	int __libc_malloc_initialized;
446:	static char *aligned_heap_area;
83:	static mstate free_list;
81:	static __libc_lock_t free_list_lock;
97:	static __libc_lock_t list_lock;
82:	static size_t narenas;
74:	static mstate thread_arena;

File argp-ba.c:
25:	const char *argp_program_bug_address;

File argp-eexst.c:
31:	error_t argp_err_exit_status;

File argp-help.c:
149:	static const uparam_name uparam_names[9];
134:	static uparams uparams;

File argp-parse.c:
93:	static volatile int _argp_hang;
161:	static const argp argp_default_argp;
99:	static const argp_option argp_default_options[5];
193:	static const argp argp_version_argp;
165:	static const argp_option argp_version_options[2];

File argp-pv.c:
24:	const char *argp_program_version;

File argp-pvh.c:
31:	void (*argp_program_version_hook)(FILE * restrict, argp_state * restrict);

File asctime.c:
29:	static const char format[32];
30:	static char result[114];

File auth_des.c:
67:	static const auth_ops authdes_ops;

File auth_none.c:
68:	static authnone_private_s authnone_private;
69:	static pthread_once_t authnone_private_guard;
52:	static const auth_ops ops;

File auth_unix.c:
66:	static const auth_ops auth_unix_ops;

File backtrace.c:
125:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
39:	static void *libgcc_handle;
36:	static _Unwind_Reason_Code (*unwind_backtrace)(_Unwind_Trace_Fn, void *);
38:	static _Unwind_Word (*unwind_getcfa)(_Unwind_Context *);
37:	static _Unwind_Ptr (*unwind_getip)(_Unwind_Context *);

File bindrsvprt.c:
53:	static int blacklist_read;
54:	static int *list;
55:	static int list_size;
125:	static __libc_lock_t lock;

File c16rtomb.c:
24:	static mbstate_t state;

File categories.def:
292:	static const value_type _nl_value_type_LC_ADDRESS[13];
41:	static const value_type _nl_value_type_LC_COLLATE[19];
67:	static const value_type _nl_value_type_LC_CTYPE[86];
330:	static const value_type _nl_value_type_LC_IDENTIFICATION[16];
322:	static const value_type _nl_value_type_LC_MEASUREMENT[2];
259:	static const value_type _nl_value_type_LC_MESSAGES[5];
140:	static const value_type _nl_value_type_LC_MONETARY[46];
279:	static const value_type _nl_value_type_LC_NAME[7];
193:	static const value_type _nl_value_type_LC_NUMERIC[6];
270:	static const value_type _nl_value_type_LC_PAPER[3];
311:	static const value_type _nl_value_type_LC_TELEPHONE[5];
207:	static const value_type _nl_value_type_LC_TIME[159];

File cfsetspeed.c:
28:	static const speed_struct speeds[32];

File clnt_perr.c:
388:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
360:	static const auth_errtab auth_errlist[8];
327:	static const char auth_errstr[198];
220:	static const rpc_errtab rpc_errlist[18];
147:	static const char rpc_errstr[451];

File clnt_raw.c:
72:	static const clnt_ops client_ops;

File clnt_tcp.c:
87:	static const clnt_ops tcp_ops;

File clnt_udp.c:
74:	static const clnt_ops udp_ops;

File clnt_unix.c:
88:	static const clnt_ops unix_ops;

File create_xid.c:
30:	static drand48_data __rpc_lrand48_data;
27:	static __libc_lock_t createxid_lock;
29:	static pid_t is_initialized;

File ctype-info.c:
64:	const __uint32_t *__ctype32_b;
67:	const __uint32_t *__ctype32_tolower;
68:	const __uint32_t *__ctype32_toupper;
63:	const unsigned short *__ctype_b;
65:	const __int32_t *__ctype_tolower;
66:	const __int32_t *__ctype_toupper;
22:	const uint16_t *__libc_tsd_CTYPE_B;
23:	const int32_t *__libc_tsd_CTYPE_TOLOWER;
24:	const int32_t *__libc_tsd_CTYPE_TOUPPER;

File cxa_at_quick_exit.c:
23:	exit_function_list *__quick_exit_funcs;
22:	static exit_function_list initial_quick;

File cxa_atexit.c:
72:	exit_function_list *__exit_funcs;
29:	__libc_lock_t __exit_funcs_lock;
73:	uint64_t __new_exitfn_called;
71:	static exit_function_list initial;

File cxa_thread_atexit_impl.c:
89:	static void *dso_symbol_cache;
90:	static link_map *lm_cache;
88:	static dtor_list *tls_dtor_list;

File databases.def:
23:	service_user *__nss_aliases_database;
24:	service_user *__nss_ethers_database;
25:	service_user *__nss_group_database;
26:	service_user *__nss_gshadow_database;
27:	service_user *__nss_hosts_database;
28:	service_user *__nss_initgroups_database;
29:	service_user *__nss_netgroup_database;
30:	service_user *__nss_networks_database;
31:	service_user *__nss_passwd_database;
32:	service_user *__nss_protocols_database;
33:	service_user *__nss_publickey_database;
34:	service_user *__nss_rpc_database;
35:	service_user *__nss_services_database;
36:	service_user *__nss_shadow_database;

File dcigettext.c:
335:	const char __GI__nl_default_dirname[];
323:	const char *_nl_current_default_domain;
319:	const char _nl_default_default_domain[];
344:	binding *_nl_domain_bindings;
436:	__libc_rwlock_t _nl_state_lock;
1667:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
277:	static void *root;
419:	static transmem_list *transmem_list;
274:	static __libc_rwlock_t tree_lock;

File des_impl.c:
12:	static const uint32_t des_SPtrans[8][64];
158:	static const uint32_t des_skb[8][64];
370:	static const char shifts2[16];

File des_soft.c:
40:	static const char partab[128];

File dl-cache.c:
37:	static cache_file *cache;
38:	static cache_file_new *cache_new;
39:	static size_t cachesize;

File dl-debug.c:
37:	r_debug _r_debug;

File dl-error-skeleton.c:
53:	static catch *catch_hook;
68:	static receiver_fct receiver;

File dl-exception.c:
30:	static const char _dl_out_of_memory[14];

File dl-libc.c:
143:	dl_open_hook *__GI__dl_open_hook;
151:	dl_open_hook *__GI__dl_open_hook2;
325:	static const void *__elf_set___libc_subfreeres_element_free_mem__;

File dl-load.c:
89:	int __stack_prot;
103:	static const r_strlenpair *capstr;
100:	static r_search_path_struct env_path_list;
105:	static size_t max_capstrlen;
442:	static size_t max_dirnamelen;
104:	static size_t ncapstr;
440:	static r_search_path_struct rtld_search_dirs;
113:	static const char system_dirs[66];
114:	static const size_t system_dirs_len[4];

File dl-minimal.c:
252:	const char __GI__itoa_lower_digits[];
39:	static void *alloc_end;
39:	static void *alloc_last_block;
39:	static void *alloc_ptr;

File dl-profile.c:
149:	static here_cg_arc_record *data;
173:	static volatile uint32_t fromidx;
172:	static uint32_t fromlimit;
171:	static here_fromstruct *froms;
177:	static unsigned int log_hashfraction;
175:	static uintptr_t lowpc;
155:	static uint32_t narcs;
160:	static volatile uint32_t *narcsp;
152:	static int running;
176:	static size_t textsize;
169:	static volatile uint16_t *tos;

File drand48-iter.c:
26:	drand48_data __libc_drand48_data;

File dso_handle.c:
20:	const void * const __dso_handle;

File efgcvt.c:
63:	static char ecvt_buffer[20];
62:	static char fcvt_buffer[20];
64:	static char *fcvt_bufptr;
63:	static char qecvt_buffer[33];
62:	static char qfcvt_buffer[33];
64:	static char *qfcvt_bufptr;

File environ.c:
7:	char **__environ;

File errno.c:
31:	int errno;
27:	int rtld_errno;

File error.c:
62:	unsigned int error_message_count;
334:	int error_one_per_line;
59:	void (*error_print_progname)(void);

File exit.c:
31:	_Bool __exit_funcs_done;

File fgetgrent.c:
28:	static char *buffer;
26:	static __libc_lock_t lock;

File fgetpwent.c:
28:	static char *buffer;
26:	static __libc_lock_t lock;

File fgetsgent.c:
31:	static char *buffer;
29:	static __libc_lock_t lock;

File fgetspent.c:
31:	static char *buffer;
29:	static __libc_lock_t lock;

File fileops.c:
1489:	const _IO_jump_t _IO_file_jumps_maybe_mmap;
1465:	const _IO_jump_t _IO_file_jumps_mmap;
1440:	const _IO_jump_t __GI__IO_file_jumps;

File finddomain.c:
51:	static loaded_l10nfile *_nl_loaded_domains;

File findlocale.c:
59:	const char _nl_default_locale_path[];
57:	loaded_l10nfile *_nl_locale_file_list[];

File fmtmsg.c:
370:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
76:	static const severity_info errorsev;
72:	static const severity_info haltsev;
84:	static const severity_info infosev;
48:	static const struct {
    uint32_t len;
    const char name[12];
} keywords[5];
30:	static __libc_lock_t lock;
68:	static const severity_info nosev;
93:	static int print;
90:	static severity_info *severity_list;
80:	static const severity_info warningsev;

File fnmatch.c:
163:	static int posixly_correct;

File forward.c:
30:	pthread_functions __libc_pthread_functions;
31:	int __libc_pthread_functions_init;

File fpioconst.c:
669:	const mp_limb_t __tens[];
1310:	const mp_power _fpioconst_pow10[15];

File fpu_control.c:
24:	fpu_control_t __fpu_control;

File fstab.c:
180:	static const void *__elf_set___libc_subfreeres_element_fstab_free__;
39:	static fstab_state fstab_state;

File gconv_builtin.c:
41:	static const builtin_map map[12];

File gconv_cache.c:
457:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
37:	static int cache_malloced;
36:	static size_t cache_size;
35:	static void *gconv_cache;

File gconv_conf.c:
45:	size_t __gconv_max_path_elem_len;
43:	path_elem *__gconv_path_elem;
97:	const char *__gconv_path_envvar;
607:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
80:	static const char builtin_aliases[999];
61:	static gconv_module builtin_modules[12];
39:	static const char default_gconv_path[32];
48:	static const path_elem empty_path_elem;
52:	static const char gconv_conf_filename[14];
58:	static const char gconv_module_ext[4];

File gconv_db.c:
36:	void *__gconv_alias_db;
42:	__libc_lock_t __gconv_lock;
39:	gconv_module *__gconv_modules_db;
835:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
120:	static void *known_derivations;
691:	static pthread_once_t once;

File gconv_dl.c:
210:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
50:	static void *loaded;
156:	static __gconv_loaded_object *release_handle;

File genops.c:
1111:	static const void *__elf_set___libc_atexit_element__IO_cleanup__;
840:	static const void *__elf_set___libc_subfreeres_element_buffer_free__;
777:	static _Bool dealloc_buffers;
778:	static FILE *freeres_list;
36:	static _IO_lock_t list_all_lock;
39:	static FILE *run_fp;
503:	static int stdio_needs_locking;

File getdate.c:
51:	int getdate_err;

File getnameinfo.c:
80:	static char *domain;

File getnetgrent.c:
24:	static char *buffer;

File getnetgrent_r.c:
37:	static __netgrent dataset;
33:	static __libc_lock_t lock;

File getopt.c:
88:	char *optarg;
108:	int opterr;
103:	int optind;
114:	int optopt;
118:	static _getopt_data getopt_data;

File getpw.c:
62:	static const char __evoke_link_warning_getpw[58];

File gets_chk.c:
75:	static const char __evoke_link_warning___gets_chk[57];

File getttyent.c:
44:	static FILE *tf;
43:	static char zapchar;

File getusershell.c:
58:	static char **curshell;
56:	static const char *okshells[3];
58:	static char **shells;
58:	static char *strings;

File getutent.c:
24:	static utmp *buffer;

File getutent_r.c:
50:	const utfuncs *__libc_utmp_jump_table;
53:	__libc_lock_t __libc_utmp_lock;
38:	const utfuncs __libc_utmp_unknown_functions;

File getutid.c:
24:	static utmp *buffer;

File getutline.c:
24:	static utmp *buffer;

File getwd_chk.c:
32:	static const char __evoke_link_warning_getwd[58];

File global-locale.c:
64:	locale_t __libc_tsd_LOCALE;
39:	__locale_struct _nl_global_locale;

File gmon.c:
71:	__bb *__bb_head;
73:	gmonparam _gmonparam;
78:	static int s_scale;

File herrno.c:
27:	int __h_errno;

File herror.c:
62:	const char * consth_errlist[5];
69:	const int h_nerr;

File hooks.c:
53:	static int using_malloc_checking;

File hsearch.c:
53:	static const void *__elf_set___libc_subfreeres_element___hdestroy__;
22:	static hsearch_data htab;

File in6_addr.c:
21:	const in6_addr __GI___in6addr_any;
26:	const in6_addr __GI___in6addr_loopback;

File inet6_option.c:
222:	static const char __evoke_link_warning_inet6_option_alloc[60];
162:	static const char __evoke_link_warning_inet6_option_append[61];
347:	static const char __evoke_link_warning_inet6_option_find[59];
130:	static const char __evoke_link_warning_inet6_option_init[59];
279:	static const char __evoke_link_warning_inet6_option_next[59];
97:	static const char __evoke_link_warning_inet6_option_space[60];

File inet_ntoa.c:
27:	static char buffer[18];

File init-misc.c:
23:	char *__progname;
22:	char *__progname_full;

File initgroups.c:
45:	static _Bool use_initgroups_entry;

File interp.c:
21:	const char __invoke_dynamic_linker__[28];

File iofopncook.c:
111:	static const _IO_jump_t _IO_cookie_jumps;

File iofwide.c:
67:	const _IO_codecvt __libio_codecvt;

File iogets.c:
72:	static const char __evoke_link_warning_gets[57];

File iopadn.c:
30:	static const char blanks[16];
32:	static const char zeroes[16];

File iopopen.c:
48:	static const _IO_jump_t _IO_proc_jumps;
50:	static _IO_proc_file *proc_file_chain;
53:	static _IO_lock_t proc_file_chain_lock;

File iowpadn.c:
30:	static const wchar_t blanks[16];
35:	static const wchar_t zeroes[16];

File itoa-digits.c:
22:	const char __GI__itoa_lower_digits[];

File itoa-udigits.c:
22:	const char __GI__itoa_upper_digits[];

File itowa-digits.c:
22:	const wchar_t _itowa_lower_digits[36];
25:	const wchar_t _itowa_upper_digits[36];

File key_call.c:
294:	cryptkeyres *(*__key_decryptsession_pk_LOCAL)(uid_t, char *);
293:	cryptkeyres *(*__key_encryptsession_pk_LOCAL)(uid_t, char *);
295:	des_block *(*__key_gendes_LOCAL)(uid_t, char *);
382:	static __libc_lock_t keycall_lock;
67:	static const timeval tottimeout;
66:	static const timeval trytimeout;

File l64a.c:
22:	static const char conv_table[64];

File lckpwdf.c:
44:	static __libc_lock_t lock;
41:	static int lock_fd;

File libc_multiple_threads.c:
26:	int __libc_multiple_threads;

File libc_pthread_init.c:
31:	unsigned long *__fork_generation_pointer;

File loadarchive.c:
45:	static const char archfname[31];
81:	static stat64 archive_stat;
90:	static locale_in_archive *archloaded;
73:	static archmapped *archmapped;
80:	static archmapped headmap;

File loadlocale.c:
36:	static const size_t _nl_category_num_items[13];
58:	static const value_type * const_nl_value_types[13];

File loadmsgcat.c:
477:	int _nl_msg_cat_cntr;

File localealias.c:
119:	static __libc_lock_t lock;
136:	static alias_map *map;
138:	static size_t maxmap;
137:	static size_t nmap;
133:	static char *string_space;
134:	static size_t string_space_act;
135:	static size_t string_space_max;

File localtime.c:
22:	tm _tmbuf;

File malloc.c:
1858:	void (*__after_morecore_hook)(void);
1848:	void (*__free_hook)(void *, const void *);
1850:	void *(*__malloc_hook)(size_t, const void *);
1843:	void (*__malloc_initialize_hook)(void);
1855:	void *(*__memalign_hook)(size_t, size_t, const void *);
363:	void *(*__morecore)(ptrdiff_t);
1852:	void *(*__realloc_hook)(void *, size_t, const void *);
1758:	static mchunkptr dumped_main_arena_end;
1757:	static mchunkptr dumped_main_arena_start;
1614:	static size_t global_max_fast;
1745:	static malloc_state main_arena;
1767:	static malloc_par mp_;
1866:	static int perturb_byte;
2907:	static tcache_perthread_struct *tcache;
2906:	static _Bool tcache_shutting_down;

File mblen.c:
26:	static mbstate_t state;

File mbrlen.c:
23:	static mbstate_t internal;

File mbrtoc16.c:
34:	static mbstate_t state;

File mbrtowc.c:
33:	static mbstate_t state;

File mbsnrtowcs.c:
35:	static mbstate_t state;

File mbsrtowcs.c:
24:	static mbstate_t state;

File mcheck.c:
39:	static void (*abortfunc)(mcheck_status);
62:	static int mcheck_used;
31:	static void (*old_free_hook)(void *, const void *);
32:	static void *(*old_malloc_hook)(size_t, const void *);
33:	static void *(*old_memalign_hook)(size_t, size_t, const void *);
35:	static void *(*old_realloc_hook)(void *, size_t, const void *);
65:	static int pedantic;
60:	static hdr *root;

File memstream.c:
36:	static const _IO_jump_t _IO_mem_jumps;

File mktemp.c:
35:	static const char __evoke_link_warning_mktemp[68];

File mktime.c:
160:	const unsigned short __mon_yday[2][13];
578:	static time_t localtime_offset;

File mntent.c:
26:	static char *getmntent_buffer;

File mtrace.c:
54:	void *mallwatch;
51:	static __libc_lock_t lock;
48:	static const char mallenv[13];
49:	static char *malloc_trace_buffer;
47:	static FILE *mallstream;
57:	static void (*tr_old_free_hook)(void *, const void *);
58:	static void *(*tr_old_malloc_hook)(size_t, const void *);
61:	static void *(*tr_old_memalign_hook)(size_t, size_t, const void *);
59:	static void *(*tr_old_realloc_hook)(void *, size_t, const void *);

File netname.c:
29:	static const char OPSYS[5];

File nscd_getgr_r.c:
68:	locked_map_ptr __gr_map_handle;
39:	int __nss_not_use_nscd_group;
72:	static const void *__elf_set___libc_subfreeres_element_gr_map_free__;

File nscd_gethst_r.c:
85:	locked_map_ptr __hst_map_handle;
135:	int __nss_have_localdomain;
30:	int __nss_not_use_nscd_hosts;
89:	static const void *__elf_set___libc_subfreeres_element_hst_map_free__;

File nscd_getpw_r.c:
37:	int __nss_not_use_nscd_passwd;
71:	static const void *__elf_set___libc_subfreeres_element_pw_map_free__;
67:	static locked_map_ptr map_handle;

File nscd_getserv_r.c:
30:	int __nss_not_use_nscd_services;
62:	locked_map_ptr __serv_map_handle;
66:	static const void *__elf_set___libc_subfreeres_element_serv_map_free__;

File nscd_netgroup.c:
28:	int __nss_not_use_nscd_netgroup;
35:	static const void *__elf_set___libc_subfreeres_element_pw_map_free__;
31:	static locked_map_ptr map_handle;

File nsswitch.c:
86:	_Bool __nss_database_custom[14];
908:	static const void *__elf_set___libc_subfreeres_element_free_defconfig__;
922:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
94:	static const char * const __nss_shlib_revision;
75:	static const struct {
    const char name[10];
    service_user **dbp;
} databases[14];
104:	static name_database_entry *defconfig_entries;
109:	static _Bool is_nscd;
90:	static __libc_lock_t lock;
111:	static void (*nscd_init_cb)(size_t, traced_file *);
98:	static name_database *service_table;

File obprintf.c:
94:	const _IO_jump_t _IO_obstack_jumps;

File obstack.c:
110:	obstack *_obstack_compat;
94:	void (*obstack_alloc_failed_handler)(void);
99:	int obstack_exit_failure;

File plural-exp.c:
48:	const expression __gettext_germanic_plural;
39:	static const expression plone;
34:	static const expression plvar;

File pmap_clnt.c:
98:	static const timeval timeout;
99:	static const timeval tottimeout;

File pmap_rmt.c:
58:	static const timeval timeout;

File psiginfo-define.h:
11:	static const uint8_t codes_11[2];
11:	static const uint8_t codes_17[6];
11:	static const uint8_t codes_29[6];
11:	static const uint8_t codes_4[8];
11:	static const uint8_t codes_5[2];
11:	static const uint8_t codes_7[3];
11:	static const uint8_t codes_8[8];
7:	static const codestrs_t_11 codestrs_11;
7:	static const codestrs_t_17 codestrs_17;
7:	static const codestrs_t_29 codestrs_29;
7:	static const codestrs_t_4 codestrs_4;
7:	static const codestrs_t_5 codestrs_5;
7:	static const codestrs_t_7 codestrs_7;
7:	static const codestrs_t_8 codestrs_8;

File random.c:
197:	static __libc_lock_t lock;
146:	static int32_t randtbl[32];
160:	static random_data unsafe_state;

File random_r.c:
143:	static const random_poly_info random_poly_info;

File rcmd.c:
431:	int __check_rhosts_file;
432:	char *__rcmd_errstr;
100:	static char *ahostbuf;

File reg-modifier.c:
33:	printf_modifier_record **__printf_modifier_table;
186:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
35:	static __libc_lock_t lock;
38:	static int next_bit;

File reg-printf.c:
27:	printf_arginfo_size_function **__printf_arginfo_table;
29:	printf_function **__printf_function_table;
31:	static __libc_lock_t lock;

File reg-type.c:
25:	printf_va_arg_function **__printf_va_arg_table;
28:	static __libc_lock_t lock;
31:	static int pa_next_type;

File regcomp.c:
245:	reg_syntax_t re_syntax_options;
726:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
132:	static const char __re_error_msgid[382];
186:	static const size_t __re_error_msgid_idx[17];
672:	static re_pattern_buffer re_comp_buf;
569:	static const bitset_word_t utf8_sb_map[4];

File regex.c:
79:	int re_max_failures;
78:	static const char __evoke_link_warning_re_max_failures[61];

File regexp.c:
34:	char *loc1;
35:	char *loc2;
40:	char *locs;

File register-atfork.c:
143:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
34:	static int atfork_lock;
32:	static _Bool fork_handler_init;
31:	static fork_handler_list fork_handlers;

File res-close.c:
144:	static const void *__elf_set___libc_subfreeres_element___res_thread_freeres__;

File res_hconf.c:
81:	hconf _res_hconf;
72:	static const cmd cmd[4];
334:	static netaddr *ifaddrs;

File res_libc.c:
94:	__res_state *__resp;
91:	__res_state _res;

File resolv_conf.c:
677:	static const void *__elf_set___libc_subfreeres_element_freeres__;
80:	static resolv_conf_global *global;
84:	static __libc_lock_t lock;

File resolv_context.c:
52:	static resolv_context *current;

File rexec.c:
44:	int rexecoptions;
45:	static char *ahostbuf;

File rpc_common.c:
45:	opaque_auth __GI__null_auth;
52:	rpc_createerr __GI_rpc_createerr;
50:	fd_set __GI_svc_fdset;
56:	int __GI_svc_max_pollfd;
54:	pollfd *__GI_svc_pollfd;

File rpc_prot.c:
123:	static const xdr_discrim reply_dscrm[3];

File rpc_thread.c:
40:	static const void *__elf_set___libc_subfreeres_element___rpc_thread_destroy__;
12:	static rpc_thread_variables __libc_tsd_RPC_VARS_mem;
13:	static rpc_thread_variables *thread_rpc_vars;

File rtld.c:
85:	char **__GI__dl_argv;
98:	uintptr_t __pointer_chk_guard_local;
84:	int _dl_argc;
86:	unsigned int _dl_skip_args;
233:	rtld_global _rtld_global;
261:	rtld_global_ro _rtld_global_ro;
136:	const char *audit_list_string;
302:	static libname_list _dl_rtld_libname;
303:	static libname_list _dl_rtld_libname2;
2331:	static int any_debug;
144:	static audit_list *audit_list;
824:	static const char *library_path;
308:	static hp_timing_t load_time;
826:	static const char *preloadlist;
307:	static hp_timing_t relocate_time;
309:	static hp_timing_t start_time;
678:	static _Bool tls_init_tp_called;
828:	static int version_info;

File ruserpass.c:
47:	static FILE *cfile;
59:	static const char tokstr[53];
80:	static const toktab toktab[7];
57:	static char tokval[100];

File setenv.c:
324:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
57:	static __libc_lock_t envlock;
85:	static void *known_values;
106:	static char **last_environ;

File setlocale.c:
124:	__libc_rwlock_t __libc_setlocale_lock;
78:	const uint8_t _nl_category_name_idxs[13];
87:	const uint8_t _nl_category_name_sizes[13];
68:	const catnamestr_t _nl_category_names;
114:	static void (* const_nl_category_postload[13])(void);

File sgetsgent.c:
28:	static __libc_lock_t lock;

File sgetspent.c:
28:	static __libc_lock_t lock;

File sofini.c:
17:	static const ui32 __FRAME_END__[1];

File stdfiles.c:
55:	_IO_FILE_plus _IO_2_1_stderr_;
53:	_IO_FILE_plus _IO_2_1_stdin_;
54:	_IO_FILE_plus _IO_2_1_stdout_;
57:	_IO_FILE_plus *__GI__IO_list_all;
53:	static _IO_lock_t _IO_stdfile_0_lock;
54:	static _IO_lock_t _IO_stdfile_1_lock;
55:	static _IO_lock_t _IO_stdfile_2_lock;
53:	static _IO_wide_data _IO_wide_data_0;
54:	static _IO_wide_data _IO_wide_data_1;
55:	static _IO_wide_data _IO_wide_data_2;

File stdio.c:
35:	FILE *stderr;
33:	FILE *stdin;
34:	FILE *stdout;

File strerror.c:
26:	static char *buf;

File strerror_l.c:
64:	static const void *__elf_set___libc_subfreeres_element___strerror_thread_freeres__;
26:	static char *last_value;

File strops.c:
353:	const _IO_jump_t _IO_str_jumps;

File strsignal.c:
25:	static __libc_key_t key;
30:	static char local_buf[100];
31:	static char *static_buf;

File svc_auth.c:
67:	static const struct {
    auth_stat (*authenticator)(svc_req *, rpc_msg *);
} svcauthsw[4];

File svc_raw.c:
60:	static const xp_ops server_ops;

File svc_tcp.c:
79:	static const xp_ops svctcp_op;
104:	static const xp_ops svctcp_rendezvous_op;

File svc_udp.c:
81:	static const xp_ops svcudp_op;

File svc_unix.c:
316:	static cmessage cm;
79:	static const xp_ops svcunix_op;
104:	static const xp_ops svcunix_rendezvous_op;

File svcauth_des.c:
96:	struct {
    u_long ncachehits;
    u_long ncachereplays;
    u_long ncachemisses;
} svcauthdes_stats;

File tempnam.c:
42:	static const char __evoke_link_warning_tempnam[56];

File tens_in_limb.c:
17:	const mp_limb_t _tens_in_limb[20];

File tmpnam.c:
50:	static const char __evoke_link_warning_tmpnam[55];
21:	static char tmpnam_buffer[20];

File tmpnam_r.c:
36:	static const char __evoke_link_warning_tmpnam_r[57];

File tzfile.c:
31:	int __use_tzfile;
60:	static leap *leaps;
59:	static size_t num_leaps;
51:	static size_t num_transitions;
54:	static size_t num_types;
58:	static long rule_dstoff;
57:	static long rule_stdoff;
52:	static internal_time_t *transitions;
53:	static unsigned char *type_idxs;
55:	static ttinfo *types;
32:	static dev_t tzfile_dev;
33:	static ino64_t tzfile_ino;
34:	static time_t tzfile_mtime;
61:	static char *tzspec;
56:	static char *zone_names;

File tzset.c:
33:	int __daylight;
34:	long __timezone;
32:	char *__tzname[2];
620:	static const void *__elf_set___libc_subfreeres_element_free_mem__;
125:	static char *old_tz;
63:	static tz_rule tz_rules[2];
41:	static __libc_lock_t tzset_lock;
77:	static tzstring_l *tzstring_list;

File utmpname.c:
31:	const char *__libc_utmp_file_name;
28:	static const char default_file_name[14];

File valid_field.c:
21:	const char __nss_invalid_field_characters[];

File valid_list_field.c:
22:	static const char invalid_characters[4];

File version.c:
23:	static const char __libc_release[7];
24:	static const char __libc_version[5];
26:	static const char banner[409];

File vfprintf.c:
2242:	static const _IO_jump_t _IO_helper_jumps;
208:	static const uint8_t jump_table[91];
201:	static const wchar_t null[7];

File vsnprintf.c:
67:	const _IO_jump_t _IO_strn_jumps;

File vsprintf_chk.c:
35:	static const _IO_jump_t _IO_str_chk_jumps;

File vswprintf.c:
66:	const _IO_jump_t _IO_wstrn_jumps;

File vtables.c:
26:	void (*IO_accept_foreign_vtables)(void);

File wcrtomb.c:
35:	static mbstate_t state;

File wcsmbsload.c:
71:	const gconv_fcts __wcsmbs_gconv_fcts_c;
50:	static const __gconv_step to_mb;
31:	static const __gconv_step to_wc;

File wcsnrtombs.c:
34:	static mbstate_t state;

File wcsrtombs.c:
35:	static mbstate_t state;

File wctomb.c:
26:	mbstate_t __wctomb_state;

File wfileops.c:
1073:	const _IO_jump_t _IO_wfile_jumps_maybe_mmap;
1049:	const _IO_jump_t _IO_wfile_jumps_mmap;
1023:	const _IO_jump_t __GI__IO_wfile_jumps;

File wmemstream.c:
37:	static const _IO_jump_t _IO_wmem_jumps;

File wstrops.c:
362:	const _IO_jump_t _IO_wstr_jumps;

File xcrypt.c:
52:	static const char hex[16];

File xdr.c:
60:	static const char xdr_zero[4];

File xdr_mem.c:
54:	static const xdr_ops xdrmem_ops;

File xdr_rec.c:
66:	static const xdr_ops xdrrec_ops;

File xdr_stdio.c:
64:	static const xdr_ops xdrstdio_ops;

File xlocale.c:
34:	const __locale_struct _nl_C_locobj;

Non-debugging symbols:
0x0000555555556000  _IO_stdin_used
0x000055555555601c  __GNU_EH_FRAME_HDR
0x000055555555620c  __FRAME_END__
0x0000555555557da0  __frame_dummy_init_array_entry
0x0000555555557da0  __init_array_start
0x0000555555557db0  __do_global_dtors_aux_fini_array_entry
0x0000555555557db0  __init_array_end
0x0000555555557db8  _DYNAMIC
0x0000555555558000  _GLOBAL_OFFSET_TABLE_
0x0000555555558058  __data_start
0x0000555555558058  data_start
0x0000555555558068  __TMC_END__
0x0000555555558068  __bss_start
0x0000555555558068  _edata
0x0000555555558080  std::cout@@GLIBCXX_3.4
0x00005555555581a0  std::cerr@@GLIBCXX_3.4
0x00005555555582b0  completed
0x00005555555582b8  _end
0x00007ffff7ff40e0  debopts
0x00007ffff7ff4340  unsecure_envvars
0x00007ffff7ff4480  audit_iface_names
0x00007ffff7ff4500  expected2
0x00007ffff7ff46e0  msg
0x00007ffff7ff4740  primes
0x00007ffff7ff4a10  expected_note
0x00007ffff7ff4a40  auxvars
0x00007ffff7ff5e0c  __PRETTY_FUNCTION__.10808
0x00007ffff7ff6c30  __PRETTY_FUNCTION__.10553
0x00007ffff7ff6c40  __PRETTY_FUNCTION__.10608
0x00007ffff7ff6c50  __PRETTY_FUNCTION__.10676
0x00007ffff7ff7198  __PRETTY_FUNCTION__.10750
0x00007ffff7ff71a8  __PRETTY_FUNCTION__.10540
0x00007ffff7ff73c8  __PRETTY_FUNCTION__.10732
0x00007ffff7ff73d8  __PRETTY_FUNCTION__.10488
0x00007ffff7ff77d0  __PRETTY_FUNCTION__.11251
0x00007ffff7ff78b8  __PRETTY_FUNCTION__.8607
0x00007ffff7ff7a40  __PRETTY_FUNCTION__.8752
0x00007ffff7ff7cd8  __PRETTY_FUNCTION__.9583
0x00007ffff7ff7e48  __PRETTY_FUNCTION__.11405
0x00007ffff7ff7e58  __PRETTY_FUNCTION__.11470
0x00007ffff7ff81f0  __PRETTY_FUNCTION__.10819
0x00007ffff7ff8200  __PRETTY_FUNCTION__.10751
0x00007ffff7ff8288  __PRETTY_FUNCTION__.8077
0x00007ffff7ff82c8  __PRETTY_FUNCTION__.7269
0x00007ffff7ff82e0  __PRETTY_FUNCTION__.10056
0x00007ffff7ff82e0  __PRETTY_FUNCTION__.10179
0x00007ffff7ff82e0  __PRETTY_FUNCTION__.10445
0x00007ffff7ff8300  preload_file
0x00007ffff7ff8320  __PRETTY_FUNCTION__.10113
0x00007ffff7ff8320  __PRETTY_FUNCTION__.10382
0x00007ffff7ff8340  __PRETTY_FUNCTION__.10462
0x00007ffff7ff8360  __PRETTY_FUNCTION__.10601
0x00007ffff7ff8380  __PRETTY_FUNCTION__.10461
0x00007ffff7ff83a0  __PRETTY_FUNCTION__.10448
0x00007ffff7ff83c0  __PRETTY_FUNCTION__.10529
0x00007ffff7ff83e0  __PRETTY_FUNCTION__.10704
0x00007ffff7ff8400  __PRETTY_FUNCTION__.9793
0x00007ffff7ff8420  __PRETTY_FUNCTION__.10033
0x00007ffff7ff8440  __PRETTY_FUNCTION__.11331
0x00007ffff7ff8460  __PRETTY_FUNCTION__.9940
0x00007ffff7ff8480  __PRETTY_FUNCTION__.8774
0x00007ffff7ff84a0  __PRETTY_FUNCTION__.9914
0x00007ffff7ff84c0  __PRETTY_FUNCTION__.9851
0x00007ffff7ff84e0  __PRETTY_FUNCTION__.9791
0x00007ffff7ff8500  __PRETTY_FUNCTION__.9741
0x00007ffff7ff8520  __PRETTY_FUNCTION__.9717
0x00007ffff7ff8540  __PRETTY_FUNCTION__.11385
0x00007ffff7ff8560  __PRETTY_FUNCTION__.11061
0x00007ffff7ff8570  __PRETTY_FUNCTION__.11088
0x00007ffff7ff8590  __PRETTY_FUNCTION__.10011
0x00007ffff7ff85b0  expected_note
0x00007ffff7ff85c0  expected
0x00007ffff7ff85d0  dummy_bucket
0x00007ffff7ff85e0  errstring
0x00007ffff7ff8620  __GNU_EH_FRAME_HDR
0x00007ffff7ffc660  dyn_temp
0x00007ffff7ffd000  _GLOBAL_OFFSET_TABLE_
0x00007ffff7ffe000  newname
0x00007ffff7ffe0c0  dl_close_state
0x00007ffff7e13010  std::__once_call
0x00007ffff7e13018  std::__once_callable
0x00007ffff7f48020  typeinfo name for std::lock_error
0x00007ffff7f48030  typeinfo name for std::error_category
0x00007ffff7f480cb  std::chrono::system_clock::is_monotonic
0x00007ffff7f48120  typeinfo name for std::__future_base::_Async_state_common
0x00007ffff7f48160  typeinfo name for __cxxabiv1::__array_type_info
0x00007ffff7f48198  typeinfo name for std::bad_alloc
0x00007ffff7f481c0  typeinfo name for std::bad_array_length
0x00007ffff7f481f0  typeinfo name for std::bad_array_new_length
0x00007ffff7f48218  typeinfo name for std::bad_cast
0x00007ffff7f48238  typeinfo name for std::bad_typeid
0x00007ffff7f48260  typeinfo name for __cxxabiv1::__class_type_info
0x00007ffff7f48370  typeinfo name for std::exception
0x00007ffff7f48380  typeinfo name for std::bad_exception
0x00007ffff7f48420  typeinfo name for __cxxabiv1::__enum_type_info
0x00007ffff7f48460  typeinfo name for __cxxabiv1::__function_type_info
0x00007ffff7f484a0  typeinfo name for __cxxabiv1::__fundamental_type_info
0x00007ffff7f484c8  typeinfo name for void
0x00007ffff7f484ca  typeinfo name for void*
0x00007ffff7f484cd  typeinfo name for void const*
0x00007ffff7f484d1  typeinfo name for bool
0x00007ffff7f484d3  typeinfo name for bool*
0x00007ffff7f484d6  typeinfo name for bool const*
0x00007ffff7f484da  typeinfo name for wchar_t
0x00007ffff7f484dc  typeinfo name for wchar_t*
0x00007ffff7f484df  typeinfo name for wchar_t const*
0x00007ffff7f484fb  typeinfo name for char
0x00007ffff7f484fd  typeinfo name for char*
0x00007ffff7f48500  typeinfo name for char const*
0x00007ffff7f48504  typeinfo name for signed char
0x00007ffff7f48506  typeinfo name for signed char*
0x00007ffff7f48509  typeinfo name for signed char const*
0x00007ffff7f4850d  typeinfo name for unsigned char
0x00007ffff7f4850f  typeinfo name for unsigned char*
0x00007ffff7f48512  typeinfo name for unsigned char const*
0x00007ffff7f48516  typeinfo name for short
0x00007ffff7f48518  typeinfo name for short*
0x00007ffff7f4851b  typeinfo name for short const*
0x00007ffff7f4851f  typeinfo name for unsigned short
0x00007ffff7f48521  typeinfo name for unsigned short*
0x00007ffff7f48524  typeinfo name for unsigned short const*
0x00007ffff7f48528  typeinfo name for int
0x00007ffff7f4852a  typeinfo name for int*
0x00007ffff7f4852d  typeinfo name for int const*
0x00007ffff7f48531  typeinfo name for unsigned int
0x00007ffff7f48533  typeinfo name for unsigned int*
0x00007ffff7f48536  typeinfo name for unsigned int const*
0x00007ffff7f4853a  typeinfo name for long
0x00007ffff7f4853c  typeinfo name for long*
0x00007ffff7f4853f  typeinfo name for long const*
0x00007ffff7f48543  typeinfo name for unsigned long
0x00007ffff7f48545  typeinfo name for unsigned long*
0x00007ffff7f48548  typeinfo name for unsigned long const*
0x00007ffff7f4854c  typeinfo name for long long
0x00007ffff7f4854e  typeinfo name for long long*
0x00007ffff7f48551  typeinfo name for long long const*
0x00007ffff7f48555  typeinfo name for unsigned long long
0x00007ffff7f48557  typeinfo name for unsigned long long*
0x00007ffff7f4855a  typeinfo name for unsigned long long const*
0x00007ffff7f4855e  typeinfo name for float
0x00007ffff7f48560  typeinfo name for float*
0x00007ffff7f48563  typeinfo name for float const*
0x00007ffff7f48567  typeinfo name for double
0x00007ffff7f48569  typeinfo name for double*
0x00007ffff7f4856c  typeinfo name for double const*
0x00007ffff7f48570  typeinfo name for long double
0x00007ffff7f48572  typeinfo name for long double*
0x00007ffff7f48575  typeinfo name for long double const*
0x00007ffff7f485a9  typeinfo name for __int128
0x00007ffff7f485ab  typeinfo name for __int128*
0x00007ffff7f485ae  typeinfo name for __int128 const*
0x00007ffff7f485b2  typeinfo name for unsigned __int128
0x00007ffff7f485b4  typeinfo name for unsigned __int128*
0x00007ffff7f485b7  typeinfo name for unsigned __int128 const*
0x00007ffff7f485bb  typeinfo name for __float128
0x00007ffff7f485bd  typeinfo name for __float128*
0x00007ffff7f485c0  typeinfo name for __float128 const*
0x00007ffff7f48625  std::nothrow
0x00007ffff7f48640  typeinfo name for __cxxabiv1::__pbase_type_info
0x00007ffff7f48680  typeinfo name for __cxxabiv1::__pointer_to_member_type_info
0x00007ffff7f486c0  typeinfo name for __cxxabiv1::__pointer_type_info
0x00007ffff7f48720  typeinfo name for __cxxabiv1::__si_class_type_info
0x00007ffff7f48748  typeinfo name for std::type_info
0x00007ffff7f48760  typeinfo name for __cxxabiv1::__vmi_class_type_info
0x00007ffff7f498b0  typeinfo name for std::codecvt<char, char, __mbstate_t>
0x00007ffff7f498d0  typeinfo name for std::codecvt<wchar_t, char, __mbstate_t>
0x00007ffff7f49900  std::tr1::__detail::__prime_list
0x00007ffff7f4a290  typeinfo name for std::ios_base::failure
0x00007ffff7f4a340  typeinfo name for std::locale::facet
0x00007ffff7f4a354  std::locale::all
0x00007ffff7f4a358  std::locale::messages
0x00007ffff7f4a35c  std::locale::monetary
0x00007ffff7f4a360  std::locale::time
0x00007ffff7f4a364  std::locale::collate
0x00007ffff7f4a368  std::locale::numeric
0x00007ffff7f4a36c  std::locale::ctype
0x00007ffff7f4a370  std::locale::none
0x00007ffff7f4a3f9  std::money_base::_S_default_pattern
0x00007ffff7f4a510  typeinfo name for std::logic_error
0x00007ffff7f4a520  typeinfo name for std::domain_error
0x00007ffff7f4a540  typeinfo name for std::invalid_argument
0x00007ffff7f4a560  typeinfo name for std::length_error
0x00007ffff7f4a580  typeinfo name for std::out_of_range
0x00007ffff7f4a5a0  typeinfo name for std::runtime_error
0x00007ffff7f4a5c0  typeinfo name for std::range_error
0x00007ffff7f4a5d0  typeinfo name for std::overflow_error
0x00007ffff7f4a5f0  typeinfo name for std::underflow_error
0x00007ffff7f4a610  typeinfo name for std::strstreambuf
0x00007ffff7f4a628  typeinfo name for std::istrstream
0x00007ffff7f4a638  typeinfo name for std::ostrstream
0x00007ffff7f4a648  typeinfo name for std::strstream
0x00007ffff7f4af18  std::chrono::_V2::steady_clock::is_steady
0x00007ffff7f4af19  std::chrono::_V2::system_clock::is_steady
0x00007ffff7f4af20  typeinfo name for std::codecvt_base
0x00007ffff7f4af70  typeinfo name for std::codecvt<char16_t, char, __mbstate_t>
0x00007ffff7f4afd0  typeinfo name for std::codecvt<char32_t, char, __mbstate_t>
0x00007ffff7f4aff0  typeinfo name for std::__codecvt_utf8_base<char16_t>
0x00007ffff7f4b010  typeinfo name for std::__codecvt_utf16_base<char16_t>
0x00007ffff7f4b040  typeinfo name for std::__codecvt_utf8_utf16_base<char16_t>
0x00007ffff7f4b070  typeinfo name for std::__codecvt_utf8_base<char32_t>
0x00007ffff7f4b090  typeinfo name for std::__codecvt_utf16_base<char32_t>
0x00007ffff7f4b0c0  typeinfo name for std::__codecvt_utf8_utf16_base<char32_t>
0x00007ffff7f4b0f0  typeinfo name for std::__codecvt_utf8_base<wchar_t>
0x00007ffff7f4b110  typeinfo name for std::__codecvt_utf16_base<wchar_t>
0x00007ffff7f4b140  typeinfo name for std::__codecvt_utf8_utf16_base<wchar_t>
0x00007ffff7f4b168  typeinfo name for std::ctype_base
0x00007ffff7f4b178  typeinfo name for std::ctype<char>
0x00007ffff7f4b188  typeinfo name for std::ctype<wchar_t>
0x00007ffff7f4b1a0  typeinfo name for std::ctype_byname<wchar_t>
0x00007ffff7f4b1b8  std::ctype<char>::table_size
0x00007ffff7f4b1c0  std::ctype_base::blank
0x00007ffff7f4b1c2  std::ctype_base::graph
0x00007ffff7f4b1c4  std::ctype_base::alnum
0x00007ffff7f4b1c6  std::ctype_base::xdigit
0x00007ffff7f4b1c8  std::ctype_base::punct
0x00007ffff7f4b1ca  std::ctype_base::digit
0x00007ffff7f4b1cc  std::ctype_base::alpha
0x00007ffff7f4b1ce  std::ctype_base::lower
0x00007ffff7f4b1d0  std::ctype_base::upper
0x00007ffff7f4b1d2  std::ctype_base::cntrl
0x00007ffff7f4b1d4  std::ctype_base::print
0x00007ffff7f4b1d6  std::ctype_base::space
0x00007ffff7f4c5c0  typeinfo name for std::future_error
0x00007ffff7f4c660  std::__detail::__prime_list
0x00007ffff7f4d068  typeinfo name for std::ios_base
0x00007ffff7f4d074  std::ios_base::end
0x00007ffff7f4d078  std::ios_base::cur
0x00007ffff7f4d07c  std::ios_base::beg
0x00007ffff7f4d080  std::ios_base::trunc
0x00007ffff7f4d084  std::ios_base::out
0x00007ffff7f4d088  std::ios_base::in
0x00007ffff7f4d08c  std::ios_base::binary
0x00007ffff7f4d090  std::ios_base::ate
0x00007ffff7f4d094  std::ios_base::app
0x00007ffff7f4d098  std::ios_base::goodbit
0x00007ffff7f4d09c  std::ios_base::failbit
0x00007ffff7f4d0a0  std::ios_base::eofbit
0x00007ffff7f4d0a4  std::ios_base::badbit
0x00007ffff7f4d0a8  std::ios_base::floatfield
0x00007ffff7f4d0ac  std::ios_base::basefield
0x00007ffff7f4d0b0  std::ios_base::adjustfield
0x00007ffff7f4d0b4  std::ios_base::uppercase
0x00007ffff7f4d0b8  std::ios_base::unitbuf
0x00007ffff7f4d0bc  std::ios_base::skipws
0x00007ffff7f4d0c0  std::ios_base::showpos
0x00007ffff7f4d0c4  std::ios_base::showpoint
0x00007ffff7f4d0c8  std::ios_base::showbase
0x00007ffff7f4d0cc  std::ios_base::scientific
0x00007ffff7f4d0d0  std::ios_base::right
0x00007ffff7f4d0d4  std::ios_base::oct
0x00007ffff7f4d0d8  std::ios_base::left
0x00007ffff7f4d0dc  std::ios_base::internal
0x00007ffff7f4d0e0  std::ios_base::hex
0x00007ffff7f4d0e4  std::ios_base::fixed
0x00007ffff7f4d0e8  std::ios_base::dec
0x00007ffff7f4d0ec  std::ios_base::boolalpha
0x00007ffff7f4d0f0  std::numeric_limits<char32_t>::round_style
0x00007ffff7f4d0f4  std::numeric_limits<char32_t>::tinyness_before
0x00007ffff7f4d0f5  std::numeric_limits<char32_t>::traps
0x00007ffff7f4d0f6  std::numeric_limits<char32_t>::is_modulo
0x00007ffff7f4d0f7  std::numeric_limits<char32_t>::is_bounded
0x00007ffff7f4d0f8  std::numeric_limits<char32_t>::is_iec559
0x00007ffff7f4d0f9  std::numeric_limits<char32_t>::has_denorm_loss
0x00007ffff7f4d0fc  std::numeric_limits<char32_t>::has_denorm
0x00007ffff7f4d100  std::numeric_limits<char32_t>::has_signaling_NaN
0x00007ffff7f4d101  std::numeric_limits<char32_t>::has_quiet_NaN
0x00007ffff7f4d102  std::numeric_limits<char32_t>::has_infinity
0x00007ffff7f4d104  std::numeric_limits<char32_t>::max_exponent10
0x00007ffff7f4d108  std::numeric_limits<char32_t>::max_exponent
0x00007ffff7f4d10c  std::numeric_limits<char32_t>::min_exponent10
0x00007ffff7f4d110  std::numeric_limits<char32_t>::min_exponent
0x00007ffff7f4d114  std::numeric_limits<char32_t>::radix
0x00007ffff7f4d118  std::numeric_limits<char32_t>::is_exact
0x00007ffff7f4d119  std::numeric_limits<char32_t>::is_integer
0x00007ffff7f4d11a  std::numeric_limits<char32_t>::is_signed
0x00007ffff7f4d11c  std::numeric_limits<char32_t>::max_digits10
0x00007ffff7f4d120  std::numeric_limits<char32_t>::digits10
0x00007ffff7f4d124  std::numeric_limits<char32_t>::digits
0x00007ffff7f4d128  std::numeric_limits<char32_t>::is_specialized
0x00007ffff7f4d12c  std::numeric_limits<char16_t>::round_style
0x00007ffff7f4d130  std::numeric_limits<char16_t>::tinyness_before
0x00007ffff7f4d131  std::numeric_limits<char16_t>::traps
0x00007ffff7f4d132  std::numeric_limits<char16_t>::is_modulo
0x00007ffff7f4d133  std::numeric_limits<char16_t>::is_bounded
0x00007ffff7f4d134  std::numeric_limits<char16_t>::is_iec559
0x00007ffff7f4d135  std::numeric_limits<char16_t>::has_denorm_loss
0x00007ffff7f4d138  std::numeric_limits<char16_t>::has_denorm
0x00007ffff7f4d13c  std::numeric_limits<char16_t>::has_signaling_NaN
0x00007ffff7f4d13d  std::numeric_limits<char16_t>::has_quiet_NaN
0x00007ffff7f4d13e  std::numeric_limits<char16_t>::has_infinity
0x00007ffff7f4d140  std::numeric_limits<char16_t>::max_exponent10
0x00007ffff7f4d144  std::numeric_limits<char16_t>::max_exponent
0x00007ffff7f4d148  std::numeric_limits<char16_t>::min_exponent10
0x00007ffff7f4d14c  std::numeric_limits<char16_t>::min_exponent
0x00007ffff7f4d150  std::numeric_limits<char16_t>::radix
0x00007ffff7f4d154  std::numeric_limits<char16_t>::is_exact
0x00007ffff7f4d155  std::numeric_limits<char16_t>::is_integer
0x00007ffff7f4d156  std::numeric_limits<char16_t>::is_signed
0x00007ffff7f4d158  std::numeric_limits<char16_t>::max_digits10
0x00007ffff7f4d15c  std::numeric_limits<char16_t>::digits10
0x00007ffff7f4d160  std::numeric_limits<char16_t>::digits
0x00007ffff7f4d164  std::numeric_limits<char16_t>::is_specialized
0x00007ffff7f4d168  std::numeric_limits<long double>::round_style
0x00007ffff7f4d16c  std::numeric_limits<long double>::tinyness_before
0x00007ffff7f4d16d  std::numeric_limits<long double>::traps
0x00007ffff7f4d16e  std::numeric_limits<long double>::is_modulo
0x00007ffff7f4d16f  std::numeric_limits<long double>::is_bounded
0x00007ffff7f4d170  std::numeric_limits<long double>::is_iec559
0x00007ffff7f4d171  std::numeric_limits<long double>::has_denorm_loss
0x00007ffff7f4d174  std::numeric_limits<long double>::has_denorm
0x00007ffff7f4d178  std::numeric_limits<long double>::has_signaling_NaN
0x00007ffff7f4d179  std::numeric_limits<long double>::has_quiet_NaN
0x00007ffff7f4d17a  std::numeric_limits<long double>::has_infinity
0x00007ffff7f4d17c  std::numeric_limits<long double>::max_exponent10
0x00007ffff7f4d180  std::numeric_limits<long double>::max_exponent
0x00007ffff7f4d184  std::numeric_limits<long double>::min_exponent10
0x00007ffff7f4d188  std::numeric_limits<long double>::min_exponent
0x00007ffff7f4d18c  std::numeric_limits<long double>::radix
0x00007ffff7f4d190  std::numeric_limits<long double>::is_exact
0x00007ffff7f4d191  std::numeric_limits<long double>::is_integer
0x00007ffff7f4d192  std::numeric_limits<long double>::is_signed
0x00007ffff7f4d194  std::numeric_limits<long double>::max_digits10
0x00007ffff7f4d198  std::numeric_limits<long double>::digits10
0x00007ffff7f4d19c  std::numeric_limits<long double>::digits
0x00007ffff7f4d1a0  std::numeric_limits<long double>::is_specialized
0x00007ffff7f4d1a4  std::numeric_limits<double>::round_style
0x00007ffff7f4d1a8  std::numeric_limits<double>::tinyness_before
0x00007ffff7f4d1a9  std::numeric_limits<double>::traps
0x00007ffff7f4d1aa  std::numeric_limits<double>::is_modulo
0x00007ffff7f4d1ab  std::numeric_limits<double>::is_bounded
0x00007ffff7f4d1ac  std::numeric_limits<double>::is_iec559
0x00007ffff7f4d1ad  std::numeric_limits<double>::has_denorm_loss
0x00007ffff7f4d1b0  std::numeric_limits<double>::has_denorm
0x00007ffff7f4d1b4  std::numeric_limits<double>::has_signaling_NaN
0x00007ffff7f4d1b5  std::numeric_limits<double>::has_quiet_NaN
0x00007ffff7f4d1b6  std::numeric_limits<double>::has_infinity
0x00007ffff7f4d1b8  std::numeric_limits<double>::max_exponent10
0x00007ffff7f4d1bc  std::numeric_limits<double>::max_exponent
0x00007ffff7f4d1c0  std::numeric_limits<double>::min_exponent10
0x00007ffff7f4d1c4  std::numeric_limits<double>::min_exponent
0x00007ffff7f4d1c8  std::numeric_limits<double>::radix
0x00007ffff7f4d1cc  std::numeric_limits<double>::is_exact
0x00007ffff7f4d1cd  std::numeric_limits<double>::is_integer
0x00007ffff7f4d1ce  std::numeric_limits<double>::is_signed
0x00007ffff7f4d1d0  std::numeric_limits<double>::max_digits10
0x00007ffff7f4d1d4  std::numeric_limits<double>::digits10
0x00007ffff7f4d1d8  std::numeric_limits<double>::digits
0x00007ffff7f4d1dc  std::numeric_limits<double>::is_specialized
0x00007ffff7f4d1e0  std::numeric_limits<float>::round_style
0x00007ffff7f4d1e4  std::numeric_limits<float>::tinyness_before
0x00007ffff7f4d1e5  std::numeric_limits<float>::traps
0x00007ffff7f4d1e6  std::numeric_limits<float>::is_modulo
0x00007ffff7f4d1e7  std::numeric_limits<float>::is_bounded
0x00007ffff7f4d1e8  std::numeric_limits<float>::is_iec559
0x00007ffff7f4d1e9  std::numeric_limits<float>::has_denorm_loss
0x00007ffff7f4d1ec  std::numeric_limits<float>::has_denorm
0x00007ffff7f4d1f0  std::numeric_limits<float>::has_signaling_NaN
0x00007ffff7f4d1f1  std::numeric_limits<float>::has_quiet_NaN
0x00007ffff7f4d1f2  std::numeric_limits<float>::has_infinity
0x00007ffff7f4d1f4  std::numeric_limits<float>::max_exponent10
0x00007ffff7f4d1f8  std::numeric_limits<float>::max_exponent
0x00007ffff7f4d1fc  std::numeric_limits<float>::min_exponent10
0x00007ffff7f4d200  std::numeric_limits<float>::min_exponent
0x00007ffff7f4d204  std::numeric_limits<float>::radix
0x00007ffff7f4d208  std::numeric_limits<float>::is_exact
0x00007ffff7f4d209  std::numeric_limits<float>::is_integer
0x00007ffff7f4d20a  std::numeric_limits<float>::is_signed
0x00007ffff7f4d20c  std::numeric_limits<float>::max_digits10
0x00007ffff7f4d210  std::numeric_limits<float>::digits10
0x00007ffff7f4d214  std::numeric_limits<float>::digits
0x00007ffff7f4d218  std::numeric_limits<float>::is_specialized
0x00007ffff7f4d21c  std::numeric_limits<unsigned __int128>::round_style
0x00007ffff7f4d220  std::numeric_limits<unsigned __int128>::tinyness_before
0x00007ffff7f4d221  std::numeric_limits<unsigned __int128>::traps
0x00007ffff7f4d222  std::numeric_limits<unsigned __int128>::is_modulo
0x00007ffff7f4d223  std::numeric_limits<unsigned __int128>::is_bounded
0x00007ffff7f4d224  std::numeric_limits<unsigned __int128>::is_iec559
0x00007ffff7f4d225  std::numeric_limits<unsigned __int128>::has_denorm_loss
0x00007ffff7f4d228  std::numeric_limits<unsigned __int128>::has_denorm
0x00007ffff7f4d22c  std::numeric_limits<unsigned __int128>::has_signaling_NaN
0x00007ffff7f4d22d  std::numeric_limits<unsigned __int128>::has_quiet_NaN
0x00007ffff7f4d22e  std::numeric_limits<unsigned __int128>::has_infinity
0x00007ffff7f4d230  std::numeric_limits<unsigned __int128>::max_exponent10
0x00007ffff7f4d234  std::numeric_limits<unsigned __int128>::max_exponent
0x00007ffff7f4d238  std::numeric_limits<unsigned __int128>::min_exponent10
0x00007ffff7f4d23c  std::numeric_limits<unsigned __int128>::min_exponent
0x00007ffff7f4d240  std::numeric_limits<unsigned __int128>::radix
0x00007ffff7f4d244  std::numeric_limits<unsigned __int128>::is_exact
0x00007ffff7f4d245  std::numeric_limits<unsigned __int128>::is_integer
0x00007ffff7f4d246  std::numeric_limits<unsigned __int128>::is_signed
0x00007ffff7f4d248  std::numeric_limits<unsigned __int128>::max_digits10
0x00007ffff7f4d24c  std::numeric_limits<unsigned __int128>::digits10
0x00007ffff7f4d250  std::numeric_limits<unsigned __int128>::digits
0x00007ffff7f4d254  std::numeric_limits<unsigned __int128>::is_specialized
0x00007ffff7f4d258  std::numeric_limits<__int128>::round_style
0x00007ffff7f4d25c  std::numeric_limits<__int128>::tinyness_before
0x00007ffff7f4d25d  std::numeric_limits<__int128>::traps
0x00007ffff7f4d25e  std::numeric_limits<__int128>::is_modulo
0x00007ffff7f4d25f  std::numeric_limits<__int128>::is_bounded
0x00007ffff7f4d260  std::numeric_limits<__int128>::is_iec559
0x00007ffff7f4d261  std::numeric_limits<__int128>::has_denorm_loss
0x00007ffff7f4d264  std::numeric_limits<__int128>::has_denorm
0x00007ffff7f4d268  std::numeric_limits<__int128>::has_signaling_NaN
0x00007ffff7f4d269  std::numeric_limits<__int128>::has_quiet_NaN
0x00007ffff7f4d26a  std::numeric_limits<__int128>::has_infinity
0x00007ffff7f4d26c  std::numeric_limits<__int128>::max_exponent10
0x00007ffff7f4d270  std::numeric_limits<__int128>::max_exponent
0x00007ffff7f4d274  std::numeric_limits<__int128>::min_exponent10
0x00007ffff7f4d278  std::numeric_limits<__int128>::min_exponent
0x00007ffff7f4d27c  std::numeric_limits<__int128>::radix
0x00007ffff7f4d280  std::numeric_limits<__int128>::is_exact
0x00007ffff7f4d281  std::numeric_limits<__int128>::is_integer
0x00007ffff7f4d282  std::numeric_limits<__int128>::is_signed
0x00007ffff7f4d284  std::numeric_limits<__int128>::max_digits10
0x00007ffff7f4d288  std::numeric_limits<__int128>::digits10
0x00007ffff7f4d28c  std::numeric_limits<__int128>::digits
0x00007ffff7f4d290  std::numeric_limits<__int128>::is_specialized
0x00007ffff7f4d294  std::numeric_limits<unsigned long long>::round_style
0x00007ffff7f4d298  std::numeric_limits<unsigned long long>::tinyness_before
0x00007ffff7f4d299  std::numeric_limits<unsigned long long>::traps
0x00007ffff7f4d29a  std::numeric_limits<unsigned long long>::is_modulo
0x00007ffff7f4d29b  std::numeric_limits<unsigned long long>::is_bounded
0x00007ffff7f4d29c  std::numeric_limits<unsigned long long>::is_iec559
0x00007ffff7f4d29d  std::numeric_limits<unsigned long long>::has_denorm_loss
0x00007ffff7f4d2a0  std::numeric_limits<unsigned long long>::has_denorm
0x00007ffff7f4d2a4  std::numeric_limits<unsigned long long>::has_signaling_NaN
0x00007ffff7f4d2a5  std::numeric_limits<unsigned long long>::has_quiet_NaN
0x00007ffff7f4d2a6  std::numeric_limits<unsigned long long>::has_infinity
0x00007ffff7f4d2a8  std::numeric_limits<unsigned long long>::max_exponent10
0x00007ffff7f4d2ac  std::numeric_limits<unsigned long long>::max_exponent
0x00007ffff7f4d2b0  std::numeric_limits<unsigned long long>::min_exponent10
0x00007ffff7f4d2b4  std::numeric_limits<unsigned long long>::min_exponent
0x00007ffff7f4d2b8  std::numeric_limits<unsigned long long>::radix
0x00007ffff7f4d2bc  std::numeric_limits<unsigned long long>::is_exact
0x00007ffff7f4d2bd  std::numeric_limits<unsigned long long>::is_integer
0x00007ffff7f4d2be  std::numeric_limits<unsigned long long>::is_signed
0x00007ffff7f4d2c0  std::numeric_limits<unsigned long long>::max_digits10
0x00007ffff7f4d2c4  std::numeric_limits<unsigned long long>::digits10
0x00007ffff7f4d2c8  std::numeric_limits<unsigned long long>::digits
0x00007ffff7f4d2cc  std::numeric_limits<unsigned long long>::is_specialized
0x00007ffff7f4d2d0  std::numeric_limits<long long>::round_style
0x00007ffff7f4d2d4  std::numeric_limits<long long>::tinyness_before
0x00007ffff7f4d2d5  std::numeric_limits<long long>::traps
0x00007ffff7f4d2d6  std::numeric_limits<long long>::is_modulo
0x00007ffff7f4d2d7  std::numeric_limits<long long>::is_bounded
0x00007ffff7f4d2d8  std::numeric_limits<long long>::is_iec559
0x00007ffff7f4d2d9  std::numeric_limits<long long>::has_denorm_loss
0x00007ffff7f4d2dc  std::numeric_limits<long long>::has_denorm
0x00007ffff7f4d2e0  std::numeric_limits<long long>::has_signaling_NaN
0x00007ffff7f4d2e1  std::numeric_limits<long long>::has_quiet_NaN
0x00007ffff7f4d2e2  std::numeric_limits<long long>::has_infinity
0x00007ffff7f4d2e4  std::numeric_limits<long long>::max_exponent10
0x00007ffff7f4d2e8  std::numeric_limits<long long>::max_exponent
0x00007ffff7f4d2ec  std::numeric_limits<long long>::min_exponent10
0x00007ffff7f4d2f0  std::numeric_limits<long long>::min_exponent
0x00007ffff7f4d2f4  std::numeric_limits<long long>::radix
0x00007ffff7f4d2f8  std::numeric_limits<long long>::is_exact
0x00007ffff7f4d2f9  std::numeric_limits<long long>::is_integer
0x00007ffff7f4d2fa  std::numeric_limits<long long>::is_signed
0x00007ffff7f4d2fc  std::numeric_limits<long long>::max_digits10
0x00007ffff7f4d300  std::numeric_limits<long long>::digits10
0x00007ffff7f4d304  std::numeric_limits<long long>::digits
0x00007ffff7f4d308  std::numeric_limits<long long>::is_specialized
0x00007ffff7f4d30c  std::numeric_limits<unsigned long>::round_style
0x00007ffff7f4d310  std::numeric_limits<unsigned long>::tinyness_before
0x00007ffff7f4d311  std::numeric_limits<unsigned long>::traps
0x00007ffff7f4d312  std::numeric_limits<unsigned long>::is_modulo
0x00007ffff7f4d313  std::numeric_limits<unsigned long>::is_bounded
0x00007ffff7f4d314  std::numeric_limits<unsigned long>::is_iec559
0x00007ffff7f4d315  std::numeric_limits<unsigned long>::has_denorm_loss
0x00007ffff7f4d318  std::numeric_limits<unsigned long>::has_denorm
0x00007ffff7f4d31c  std::numeric_limits<unsigned long>::has_signaling_NaN
0x00007ffff7f4d31d  std::numeric_limits<unsigned long>::has_quiet_NaN
0x00007ffff7f4d31e  std::numeric_limits<unsigned long>::has_infinity
0x00007ffff7f4d320  std::numeric_limits<unsigned long>::max_exponent10
0x00007ffff7f4d324  std::numeric_limits<unsigned long>::max_exponent
0x00007ffff7f4d328  std::numeric_limits<unsigned long>::min_exponent10
0x00007ffff7f4d32c  std::numeric_limits<unsigned long>::min_exponent
0x00007ffff7f4d330  std::numeric_limits<unsigned long>::radix
0x00007ffff7f4d334  std::numeric_limits<unsigned long>::is_exact
0x00007ffff7f4d335  std::numeric_limits<unsigned long>::is_integer
0x00007ffff7f4d336  std::numeric_limits<unsigned long>::is_signed
0x00007ffff7f4d338  std::numeric_limits<unsigned long>::max_digits10
0x00007ffff7f4d33c  std::numeric_limits<unsigned long>::digits10
0x00007ffff7f4d340  std::numeric_limits<unsigned long>::digits
0x00007ffff7f4d344  std::numeric_limits<unsigned long>::is_specialized
0x00007ffff7f4d348  std::numeric_limits<long>::round_style
0x00007ffff7f4d34c  std::numeric_limits<long>::tinyness_before
0x00007ffff7f4d34d  std::numeric_limits<long>::traps
0x00007ffff7f4d34e  std::numeric_limits<long>::is_modulo
0x00007ffff7f4d34f  std::numeric_limits<long>::is_bounded
0x00007ffff7f4d350  std::numeric_limits<long>::is_iec559
0x00007ffff7f4d351  std::numeric_limits<long>::has_denorm_loss
0x00007ffff7f4d354  std::numeric_limits<long>::has_denorm
0x00007ffff7f4d358  std::numeric_limits<long>::has_signaling_NaN
0x00007ffff7f4d359  std::numeric_limits<long>::has_quiet_NaN
0x00007ffff7f4d35a  std::numeric_limits<long>::has_infinity
0x00007ffff7f4d35c  std::numeric_limits<long>::max_exponent10
0x00007ffff7f4d360  std::numeric_limits<long>::max_exponent
0x00007ffff7f4d364  std::numeric_limits<long>::min_exponent10
0x00007ffff7f4d368  std::numeric_limits<long>::min_exponent
0x00007ffff7f4d36c  std::numeric_limits<long>::radix
0x00007ffff7f4d370  std::numeric_limits<long>::is_exact
0x00007ffff7f4d371  std::numeric_limits<long>::is_integer
0x00007ffff7f4d372  std::numeric_limits<long>::is_signed
0x00007ffff7f4d374  std::numeric_limits<long>::max_digits10
0x00007ffff7f4d378  std::numeric_limits<long>::digits10
0x00007ffff7f4d37c  std::numeric_limits<long>::digits
0x00007ffff7f4d380  std::numeric_limits<long>::is_specialized
0x00007ffff7f4d384  std::numeric_limits<unsigned int>::round_style
0x00007ffff7f4d388  std::numeric_limits<unsigned int>::tinyness_before
0x00007ffff7f4d389  std::numeric_limits<unsigned int>::traps
0x00007ffff7f4d38a  std::numeric_limits<unsigned int>::is_modulo
0x00007ffff7f4d38b  std::numeric_limits<unsigned int>::is_bounded
0x00007ffff7f4d38c  std::numeric_limits<unsigned int>::is_iec559
0x00007ffff7f4d38d  std::numeric_limits<unsigned int>::has_denorm_loss
0x00007ffff7f4d390  std::numeric_limits<unsigned int>::has_denorm
0x00007ffff7f4d394  std::numeric_limits<unsigned int>::has_signaling_NaN
0x00007ffff7f4d395  std::numeric_limits<unsigned int>::has_quiet_NaN
0x00007ffff7f4d396  std::numeric_limits<unsigned int>::has_infinity
0x00007ffff7f4d398  std::numeric_limits<unsigned int>::max_exponent10
0x00007ffff7f4d39c  std::numeric_limits<unsigned int>::max_exponent
0x00007ffff7f4d3a0  std::numeric_limits<unsigned int>::min_exponent10
0x00007ffff7f4d3a4  std::numeric_limits<unsigned int>::min_exponent
0x00007ffff7f4d3a8  std::numeric_limits<unsigned int>::radix
0x00007ffff7f4d3ac  std::numeric_limits<unsigned int>::is_exact
0x00007ffff7f4d3ad  std::numeric_limits<unsigned int>::is_integer
0x00007ffff7f4d3ae  std::numeric_limits<unsigned int>::is_signed
0x00007ffff7f4d3b0  std::numeric_limits<unsigned int>::max_digits10
0x00007ffff7f4d3b4  std::numeric_limits<unsigned int>::digits10
0x00007ffff7f4d3b8  std::numeric_limits<unsigned int>::digits
0x00007ffff7f4d3bc  std::numeric_limits<unsigned int>::is_specialized
0x00007ffff7f4d3c0  std::numeric_limits<int>::round_style
0x00007ffff7f4d3c4  std::numeric_limits<int>::tinyness_before
0x00007ffff7f4d3c5  std::numeric_limits<int>::traps
0x00007ffff7f4d3c6  std::numeric_limits<int>::is_modulo
0x00007ffff7f4d3c7  std::numeric_limits<int>::is_bounded
0x00007ffff7f4d3c8  std::numeric_limits<int>::is_iec559
0x00007ffff7f4d3c9  std::numeric_limits<int>::has_denorm_loss
0x00007ffff7f4d3cc  std::numeric_limits<int>::has_denorm
0x00007ffff7f4d3d0  std::numeric_limits<int>::has_signaling_NaN
0x00007ffff7f4d3d1  std::numeric_limits<int>::has_quiet_NaN
0x00007ffff7f4d3d2  std::numeric_limits<int>::has_infinity
0x00007ffff7f4d3d4  std::numeric_limits<int>::max_exponent10
0x00007ffff7f4d3d8  std::numeric_limits<int>::max_exponent
0x00007ffff7f4d3dc  std::numeric_limits<int>::min_exponent10
0x00007ffff7f4d3e0  std::numeric_limits<int>::min_exponent
0x00007ffff7f4d3e4  std::numeric_limits<int>::radix
0x00007ffff7f4d3e8  std::numeric_limits<int>::is_exact
0x00007ffff7f4d3e9  std::numeric_limits<int>::is_integer
0x00007ffff7f4d3ea  std::numeric_limits<int>::is_signed
0x00007ffff7f4d3ec  std::numeric_limits<int>::max_digits10
0x00007ffff7f4d3f0  std::numeric_limits<int>::digits10
0x00007ffff7f4d3f4  std::numeric_limits<int>::digits
0x00007ffff7f4d3f8  std::numeric_limits<int>::is_specialized
0x00007ffff7f4d3fc  std::numeric_limits<unsigned short>::round_style
0x00007ffff7f4d400  std::numeric_limits<unsigned short>::tinyness_before
0x00007ffff7f4d401  std::numeric_limits<unsigned short>::traps
0x00007ffff7f4d402  std::numeric_limits<unsigned short>::is_modulo
0x00007ffff7f4d403  std::numeric_limits<unsigned short>::is_bounded
0x00007ffff7f4d404  std::numeric_limits<unsigned short>::is_iec559
0x00007ffff7f4d405  std::numeric_limits<unsigned short>::has_denorm_loss
0x00007ffff7f4d408  std::numeric_limits<unsigned short>::has_denorm
0x00007ffff7f4d40c  std::numeric_limits<unsigned short>::has_signaling_NaN
0x00007ffff7f4d40d  std::numeric_limits<unsigned short>::has_quiet_NaN
0x00007ffff7f4d40e  std::numeric_limits<unsigned short>::has_infinity
0x00007ffff7f4d410  std::numeric_limits<unsigned short>::max_exponent10
0x00007ffff7f4d414  std::numeric_limits<unsigned short>::max_exponent
0x00007ffff7f4d418  std::numeric_limits<unsigned short>::min_exponent10
0x00007ffff7f4d41c  std::numeric_limits<unsigned short>::min_exponent
0x00007ffff7f4d420  std::numeric_limits<unsigned short>::radix
0x00007ffff7f4d424  std::numeric_limits<unsigned short>::is_exact
0x00007ffff7f4d425  std::numeric_limits<unsigned short>::is_integer
0x00007ffff7f4d426  std::numeric_limits<unsigned short>::is_signed
0x00007ffff7f4d428  std::numeric_limits<unsigned short>::max_digits10
0x00007ffff7f4d42c  std::numeric_limits<unsigned short>::digits10
0x00007ffff7f4d430  std::numeric_limits<unsigned short>::digits
0x00007ffff7f4d434  std::numeric_limits<unsigned short>::is_specialized
0x00007ffff7f4d438  std::numeric_limits<short>::round_style
0x00007ffff7f4d43c  std::numeric_limits<short>::tinyness_before
0x00007ffff7f4d43d  std::numeric_limits<short>::traps
0x00007ffff7f4d43e  std::numeric_limits<short>::is_modulo
0x00007ffff7f4d43f  std::numeric_limits<short>::is_bounded
0x00007ffff7f4d440  std::numeric_limits<short>::is_iec559
0x00007ffff7f4d441  std::numeric_limits<short>::has_denorm_loss
0x00007ffff7f4d444  std::numeric_limits<short>::has_denorm
0x00007ffff7f4d448  std::numeric_limits<short>::has_signaling_NaN
0x00007ffff7f4d449  std::numeric_limits<short>::has_quiet_NaN
0x00007ffff7f4d44a  std::numeric_limits<short>::has_infinity
0x00007ffff7f4d44c  std::numeric_limits<short>::max_exponent10
0x00007ffff7f4d450  std::numeric_limits<short>::max_exponent
0x00007ffff7f4d454  std::numeric_limits<short>::min_exponent10
0x00007ffff7f4d458  std::numeric_limits<short>::min_exponent
0x00007ffff7f4d45c  std::numeric_limits<short>::radix
0x00007ffff7f4d460  std::numeric_limits<short>::is_exact
0x00007ffff7f4d461  std::numeric_limits<short>::is_integer
0x00007ffff7f4d462  std::numeric_limits<short>::is_signed
0x00007ffff7f4d464  std::numeric_limits<short>::max_digits10
0x00007ffff7f4d468  std::numeric_limits<short>::digits10
0x00007ffff7f4d46c  std::numeric_limits<short>::digits
0x00007ffff7f4d470  std::numeric_limits<short>::is_specialized
0x00007ffff7f4d474  std::numeric_limits<wchar_t>::round_style
0x00007ffff7f4d478  std::numeric_limits<wchar_t>::tinyness_before
0x00007ffff7f4d479  std::numeric_limits<wchar_t>::traps
0x00007ffff7f4d47a  std::numeric_limits<wchar_t>::is_modulo
0x00007ffff7f4d47b  std::numeric_limits<wchar_t>::is_bounded
0x00007ffff7f4d47c  std::numeric_limits<wchar_t>::is_iec559
0x00007ffff7f4d47d  std::numeric_limits<wchar_t>::has_denorm_loss
0x00007ffff7f4d480  std::numeric_limits<wchar_t>::has_denorm
0x00007ffff7f4d484  std::numeric_limits<wchar_t>::has_signaling_NaN
0x00007ffff7f4d485  std::numeric_limits<wchar_t>::has_quiet_NaN
0x00007ffff7f4d486  std::numeric_limits<wchar_t>::has_infinity
0x00007ffff7f4d488  std::numeric_limits<wchar_t>::max_exponent10
0x00007ffff7f4d48c  std::numeric_limits<wchar_t>::max_exponent
0x00007ffff7f4d490  std::numeric_limits<wchar_t>::min_exponent10
0x00007ffff7f4d494  std::numeric_limits<wchar_t>::min_exponent
0x00007ffff7f4d498  std::numeric_limits<wchar_t>::radix
0x00007ffff7f4d49c  std::numeric_limits<wchar_t>::is_exact
0x00007ffff7f4d49d  std::numeric_limits<wchar_t>::is_integer
0x00007ffff7f4d49e  std::numeric_limits<wchar_t>::is_signed
0x00007ffff7f4d4a0  std::numeric_limits<wchar_t>::max_digits10
0x00007ffff7f4d4a4  std::numeric_limits<wchar_t>::digits10
0x00007ffff7f4d4a8  std::numeric_limits<wchar_t>::digits
0x00007ffff7f4d4ac  std::numeric_limits<wchar_t>::is_specialized
0x00007ffff7f4d4b0  std::numeric_limits<unsigned char>::round_style
0x00007ffff7f4d4b4  std::numeric_limits<unsigned char>::tinyness_before
0x00007ffff7f4d4b5  std::numeric_limits<unsigned char>::traps
0x00007ffff7f4d4b6  std::numeric_limits<unsigned char>::is_modulo
0x00007ffff7f4d4b7  std::numeric_limits<unsigned char>::is_bounded
0x00007ffff7f4d4b8  std::numeric_limits<unsigned char>::is_iec559
0x00007ffff7f4d4b9  std::numeric_limits<unsigned char>::has_denorm_loss
0x00007ffff7f4d4bc  std::numeric_limits<unsigned char>::has_denorm
0x00007ffff7f4d4c0  std::numeric_limits<unsigned char>::has_signaling_NaN
0x00007ffff7f4d4c1  std::numeric_limits<unsigned char>::has_quiet_NaN
0x00007ffff7f4d4c2  std::numeric_limits<unsigned char>::has_infinity
0x00007ffff7f4d4c4  std::numeric_limits<unsigned char>::max_exponent10
0x00007ffff7f4d4c8  std::numeric_limits<unsigned char>::max_exponent
0x00007ffff7f4d4cc  std::numeric_limits<unsigned char>::min_exponent10
0x00007ffff7f4d4d0  std::numeric_limits<unsigned char>::min_exponent
0x00007ffff7f4d4d4  std::numeric_limits<unsigned char>::radix
0x00007ffff7f4d4d8  std::numeric_limits<unsigned char>::is_exact
0x00007ffff7f4d4d9  std::numeric_limits<unsigned char>::is_integer
0x00007ffff7f4d4da  std::numeric_limits<unsigned char>::is_signed
0x00007ffff7f4d4dc  std::numeric_limits<unsigned char>::max_digits10
0x00007ffff7f4d4e0  std::numeric_limits<unsigned char>::digits10
0x00007ffff7f4d4e4  std::numeric_limits<unsigned char>::digits
0x00007ffff7f4d4e8  std::numeric_limits<unsigned char>::is_specialized
0x00007ffff7f4d4ec  std::numeric_limits<signed char>::round_style
0x00007ffff7f4d4f0  std::numeric_limits<signed char>::tinyness_before
0x00007ffff7f4d4f1  std::numeric_limits<signed char>::traps
0x00007ffff7f4d4f2  std::numeric_limits<signed char>::is_modulo
0x00007ffff7f4d4f3  std::numeric_limits<signed char>::is_bounded
0x00007ffff7f4d4f4  std::numeric_limits<signed char>::is_iec559
0x00007ffff7f4d4f5  std::numeric_limits<signed char>::has_denorm_loss
0x00007ffff7f4d4f8  std::numeric_limits<signed char>::has_denorm
0x00007ffff7f4d4fc  std::numeric_limits<signed char>::has_signaling_NaN
0x00007ffff7f4d4fd  std::numeric_limits<signed char>::has_quiet_NaN
0x00007ffff7f4d4fe  std::numeric_limits<signed char>::has_infinity
0x00007ffff7f4d500  std::numeric_limits<signed char>::max_exponent10
0x00007ffff7f4d504  std::numeric_limits<signed char>::max_exponent
0x00007ffff7f4d508  std::numeric_limits<signed char>::min_exponent10
0x00007ffff7f4d50c  std::numeric_limits<signed char>::min_exponent
0x00007ffff7f4d510  std::numeric_limits<signed char>::radix
0x00007ffff7f4d514  std::numeric_limits<signed char>::is_exact
0x00007ffff7f4d515  std::numeric_limits<signed char>::is_integer
0x00007ffff7f4d516  std::numeric_limits<signed char>::is_signed
0x00007ffff7f4d518  std::numeric_limits<signed char>::max_digits10
0x00007ffff7f4d51c  std::numeric_limits<signed char>::digits10
0x00007ffff7f4d520  std::numeric_limits<signed char>::digits
0x00007ffff7f4d524  std::numeric_limits<signed char>::is_specialized
0x00007ffff7f4d528  std::numeric_limits<char>::round_style
0x00007ffff7f4d52c  std::numeric_limits<char>::tinyness_before
0x00007ffff7f4d52d  std::numeric_limits<char>::traps
0x00007ffff7f4d52e  std::numeric_limits<char>::is_modulo
0x00007ffff7f4d52f  std::numeric_limits<char>::is_bounded
0x00007ffff7f4d530  std::numeric_limits<char>::is_iec559
0x00007ffff7f4d531  std::numeric_limits<char>::has_denorm_loss
0x00007ffff7f4d534  std::numeric_limits<char>::has_denorm
0x00007ffff7f4d538  std::numeric_limits<char>::has_signaling_NaN
0x00007ffff7f4d539  std::numeric_limits<char>::has_quiet_NaN
0x00007ffff7f4d53a  std::numeric_limits<char>::has_infinity
0x00007ffff7f4d53c  std::numeric_limits<char>::max_exponent10
0x00007ffff7f4d540  std::numeric_limits<char>::max_exponent
0x00007ffff7f4d544  std::numeric_limits<char>::min_exponent10
0x00007ffff7f4d548  std::numeric_limits<char>::min_exponent
0x00007ffff7f4d54c  std::numeric_limits<char>::radix
0x00007ffff7f4d550  std::numeric_limits<char>::is_exact
0x00007ffff7f4d551  std::numeric_limits<char>::is_integer
0x00007ffff7f4d552  std::numeric_limits<char>::is_signed
0x00007ffff7f4d554  std::numeric_limits<char>::max_digits10
0x00007ffff7f4d558  std::numeric_limits<char>::digits10
0x00007ffff7f4d55c  std::numeric_limits<char>::digits
0x00007ffff7f4d560  std::numeric_limits<char>::is_specialized
0x00007ffff7f4d564  std::numeric_limits<bool>::round_style
0x00007ffff7f4d568  std::numeric_limits<bool>::tinyness_before
0x00007ffff7f4d569  std::numeric_limits<bool>::traps
0x00007ffff7f4d56a  std::numeric_limits<bool>::is_modulo
0x00007ffff7f4d56b  std::numeric_limits<bool>::is_bounded
0x00007ffff7f4d56c  std::numeric_limits<bool>::is_iec559
0x00007ffff7f4d56d  std::numeric_limits<bool>::has_denorm_loss
0x00007ffff7f4d570  std::numeric_limits<bool>::has_denorm
0x00007ffff7f4d574  std::numeric_limits<bool>::has_signaling_NaN
0x00007ffff7f4d575  std::numeric_limits<bool>::has_quiet_NaN
0x00007ffff7f4d576  std::numeric_limits<bool>::has_infinity
0x00007ffff7f4d578  std::numeric_limits<bool>::max_exponent10
0x00007ffff7f4d57c  std::numeric_limits<bool>::max_exponent
0x00007ffff7f4d580  std::numeric_limits<bool>::min_exponent10
0x00007ffff7f4d584  std::numeric_limits<bool>::min_exponent
0x00007ffff7f4d588  std::numeric_limits<bool>::radix
0x00007ffff7f4d58c  std::numeric_limits<bool>::is_exact
0x00007ffff7f4d58d  std::numeric_limits<bool>::is_integer
0x00007ffff7f4d58e  std::numeric_limits<bool>::is_signed
0x00007ffff7f4d590  std::numeric_limits<bool>::max_digits10
0x00007ffff7f4d594  std::numeric_limits<bool>::digits10
0x00007ffff7f4d598  std::numeric_limits<bool>::digits
0x00007ffff7f4d59c  std::numeric_limits<bool>::is_specialized
0x00007ffff7f4d5a0  std::__numeric_limits_base::round_style
0x00007ffff7f4d5a4  std::__numeric_limits_base::tinyness_before
0x00007ffff7f4d5a5  std::__numeric_limits_base::traps
0x00007ffff7f4d5a6  std::__numeric_limits_base::is_modulo
0x00007ffff7f4d5a7  std::__numeric_limits_base::is_bounded
0x00007ffff7f4d5a8  std::__numeric_limits_base::is_iec559
0x00007ffff7f4d5a9  std::__numeric_limits_base::has_denorm_loss
0x00007ffff7f4d5ac  std::__numeric_limits_base::has_denorm
0x00007ffff7f4d5b0  std::__numeric_limits_base::has_signaling_NaN
0x00007ffff7f4d5b1  std::__numeric_limits_base::has_quiet_NaN
0x00007ffff7f4d5b2  std::__numeric_limits_base::has_infinity
0x00007ffff7f4d5b4  std::__numeric_limits_base::max_exponent10
0x00007ffff7f4d5b8  std::__numeric_limits_base::max_exponent
0x00007ffff7f4d5bc  std::__numeric_limits_base::min_exponent10
0x00007ffff7f4d5c0  std::__numeric_limits_base::min_exponent
0x00007ffff7f4d5c4  std::__numeric_limits_base::radix
0x00007ffff7f4d5c8  std::__numeric_limits_base::is_exact
0x00007ffff7f4d5c9  std::__numeric_limits_base::is_integer
0x00007ffff7f4d5ca  std::__numeric_limits_base::is_signed
0x00007ffff7f4d5cc  std::__numeric_limits_base::max_digits10
0x00007ffff7f4d5d0  std::__numeric_limits_base::digits10
0x00007ffff7f4d5d4  std::__numeric_limits_base::digits
0x00007ffff7f4d5d8  std::__numeric_limits_base::is_specialized
0x00007ffff7f4d5d9  std::placeholders::_29
0x00007ffff7f4d5da  std::placeholders::_28
0x00007ffff7f4d5db  std::placeholders::_27
0x00007ffff7f4d5dc  std::placeholders::_26
0x00007ffff7f4d5dd  std::placeholders::_25
0x00007ffff7f4d5de  std::placeholders::_24
0x00007ffff7f4d5df  std::placeholders::_23
0x00007ffff7f4d5e0  std::placeholders::_22
0x00007ffff7f4d5e1  std::placeholders::_21
0x00007ffff7f4d5e2  std::placeholders::_20
0x00007ffff7f4d5e3  std::placeholders::_19
0x00007ffff7f4d5e4  std::placeholders::_18
0x00007ffff7f4d5e5  std::placeholders::_17
0x00007ffff7f4d5e6  std::placeholders::_16
0x00007ffff7f4d5e7  std::placeholders::_15
0x00007ffff7f4d5e8  std::placeholders::_14
0x00007ffff7f4d5e9  std::placeholders::_13
0x00007ffff7f4d5ea  std::placeholders::_12
0x00007ffff7f4d5eb  std::placeholders::_11
0x00007ffff7f4d5ec  std::placeholders::_10
0x00007ffff7f4d5ed  std::placeholders::_9
0x00007ffff7f4d5ee  std::placeholders::_8
0x00007ffff7f4d5ef  std::placeholders::_7
0x00007ffff7f4d5f0  std::placeholders::_6
0x00007ffff7f4d5f1  std::placeholders::_5
0x00007ffff7f4d5f2  std::placeholders::_4
0x00007ffff7f4d5f3  std::placeholders::_3
0x00007ffff7f4d5f4  std::placeholders::_2
0x00007ffff7f4d5f5  std::placeholders::_1
0x00007ffff7f4d9c0  typeinfo name for std::system_error
0x00007ffff7f4da80  typeinfo name for std::thread::_State
0x00007ffff7f4dfd0  typeinfo name for std::ios_base::failure[abi:cxx11]
0x00007ffff7f4e560  typeinfo name for std::ctype_byname<char>
0x00007ffff7f4e580  typeinfo name for std::basic_stringbuf<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f4e5c0  typeinfo name for std::basic_istringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f4e600  typeinfo name for std::basic_ostringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f4e640  typeinfo name for std::basic_stringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f4e680  typeinfo name for std::basic_stringbuf<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f4e6c0  typeinfo name for std::basic_istringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f4e700  typeinfo name for std::basic_ostringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f4e740  typeinfo name for std::basic_stringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f4e8ca  std::string::_Rep::_S_terminal
0x00007ffff7f4e8d0  std::string::_Rep::_S_max_size
0x00007ffff7f4e8d8  std::string::npos
0x00007ffff7f4e8e0  std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >::_Rep::_S_terminal
0x00007ffff7f4e8e8  std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >::_Rep::_S_max_size
0x00007ffff7f4e8f0  std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >::npos
0x00007ffff7f4ea38  typeinfo name for std::money_base
0x00007ffff7f4ea50  typeinfo name for std::messages_base
0x00007ffff7f4ea68  typeinfo name for std::time_base
0x00007ffff7f4ea80  typeinfo name for std::__cxx11::collate<char>
0x00007ffff7f4eaa0  typeinfo name for std::__cxx11::collate_byname<char>
0x00007ffff7f4eac0  typeinfo name for std::__cxx11::numpunct<char>
0x00007ffff7f4eae0  typeinfo name for std::__cxx11::numpunct_byname<char>
0x00007ffff7f4eb20  typeinfo name for std::__cxx11::moneypunct<char, true>
0x00007ffff7f4eb40  typeinfo name for std::__cxx11::moneypunct<char, false>
0x00007ffff7f4eb60  typeinfo name for std::__cxx11::messages<char>
0x00007ffff7f4eb80  typeinfo name for std::__cxx11::moneypunct_byname<char, false>
0x00007ffff7f4ebc0  typeinfo name for std::__cxx11::moneypunct_byname<char, true>
0x00007ffff7f4ec00  typeinfo name for std::__cxx11::money_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4ec60  typeinfo name for std::__cxx11::money_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4ecc0  typeinfo name for std::__cxx11::time_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4ed20  typeinfo name for std::__cxx11::time_get_byname<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4ed80  typeinfo name for std::__cxx11::messages_byname<char>
0x00007ffff7f4eda1  std::__cxx11::moneypunct_byname<char, true>::intl
0x00007ffff7f4eda2  std::__cxx11::moneypunct_byname<char, false>::intl
0x00007ffff7f4eda3  std::__cxx11::moneypunct<char, true>::intl
0x00007ffff7f4eda4  std::__cxx11::moneypunct<char, false>::intl
0x00007ffff7f4eee0  typeinfo name for std::__cxx11::collate<wchar_t>
0x00007ffff7f4ef00  typeinfo name for std::__cxx11::collate_byname<wchar_t>
0x00007ffff7f4ef20  typeinfo name for std::__cxx11::numpunct<wchar_t>
0x00007ffff7f4ef40  typeinfo name for std::__cxx11::numpunct_byname<wchar_t>
0x00007ffff7f4ef80  typeinfo name for std::__cxx11::moneypunct<wchar_t, true>
0x00007ffff7f4efa0  typeinfo name for std::__cxx11::moneypunct<wchar_t, false>
0x00007ffff7f4efc0  typeinfo name for std::__cxx11::messages<wchar_t>
0x00007ffff7f4efe0  typeinfo name for std::__cxx11::moneypunct_byname<wchar_t, false>
0x00007ffff7f4f020  typeinfo name for std::__cxx11::moneypunct_byname<wchar_t, true>
0x00007ffff7f4f060  typeinfo name for std::__cxx11::money_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f4f0c0  typeinfo name for std::__cxx11::money_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f4f120  typeinfo name for std::__cxx11::time_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f4f180  typeinfo name for std::__cxx11::time_get_byname<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f4f1e0  typeinfo name for std::__cxx11::messages_byname<wchar_t>
0x00007ffff7f4f201  std::__cxx11::moneypunct_byname<wchar_t, true>::intl
0x00007ffff7f4f202  std::__cxx11::moneypunct_byname<wchar_t, false>::intl
0x00007ffff7f4f203  std::__cxx11::moneypunct<wchar_t, true>::intl
0x00007ffff7f4f204  std::__cxx11::moneypunct<wchar_t, false>::intl
0x00007ffff7f4f220  typeinfo name for __gnu_cxx::stdio_sync_filebuf<char, std::char_traits<char> >
0x00007ffff7f4f260  typeinfo name for __gnu_cxx::stdio_sync_filebuf<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f4f2a0  typeinfo name for __gnu_cxx::stdio_filebuf<char, std::char_traits<char> >
0x00007ffff7f4f2e0  typeinfo name for __gnu_cxx::stdio_filebuf<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f4f460  typeinfo name for std::basic_filebuf<char, std::char_traits<char> >
0x00007ffff7f4f4a0  typeinfo name for std::basic_ifstream<char, std::char_traits<char> >
0x00007ffff7f4f4e0  typeinfo name for std::basic_ofstream<char, std::char_traits<char> >
0x00007ffff7f4f520  typeinfo name for std::basic_fstream<char, std::char_traits<char> >
0x00007ffff7f4f560  typeinfo name for std::basic_filebuf<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f4f5a0  typeinfo name for std::basic_ifstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f4f5e0  typeinfo name for std::basic_ofstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f4f620  typeinfo name for std::basic_fstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f4f660  typeinfo name for std::basic_ios<char, std::char_traits<char> >
0x00007ffff7f4f6a0  typeinfo name for std::basic_ios<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f4f6c2  typeinfo name for std::iostream
0x00007ffff7f4f6e0  typeinfo name for std::basic_iostream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f4f708  typeinfo name for std::istream
0x00007ffff7f4f720  typeinfo name for std::basic_istream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f4f880  typeinfo name for std::collate<char>
0x00007ffff7f4f890  typeinfo name for std::collate_byname<char>
0x00007ffff7f4f8a8  typeinfo name for std::numpunct<char>
0x00007ffff7f4f8c0  typeinfo name for std::numpunct_byname<char>
0x00007ffff7f4f8e0  typeinfo name for std::num_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4f920  typeinfo name for std::num_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4f980  typeinfo name for std::__timepunct<char>
0x00007ffff7f4f9a0  typeinfo name for std::moneypunct<char, true>
0x00007ffff7f4f9c0  typeinfo name for std::moneypunct<char, false>
0x00007ffff7f4f9d8  typeinfo name for std::messages<char>
0x00007ffff7f4fa00  typeinfo name for std::__codecvt_abstract_base<char, char, __mbstate_t>
0x00007ffff7f4fa40  typeinfo name for std::codecvt_byname<char, char, __mbstate_t>
0x00007ffff7f4fa70  typeinfo name for std::moneypunct_byname<char, false>
0x00007ffff7f4fa90  typeinfo name for std::moneypunct_byname<char, true>
0x00007ffff7f4fac0  typeinfo name for std::money_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4fb00  typeinfo name for std::money_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4fb40  typeinfo name for std::time_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4fb80  typeinfo name for std::time_put_byname<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4fbe0  typeinfo name for std::time_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4fc20  typeinfo name for std::time_get_byname<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f4fc70  typeinfo name for std::messages_byname<char>
0x00007ffff7f4fc90  typeinfo name for std::__ctype_abstract_base<char>
0x00007ffff7f4fcad  std::moneypunct_byname<char, true>::intl
0x00007ffff7f4fcae  std::moneypunct_byname<char, false>::intl
0x00007ffff7f4fcaf  std::moneypunct<char, true>::intl
0x00007ffff7f4fcb0  std::moneypunct<char, false>::intl
0x00007ffff7f4fcb1  typeinfo name for std::ostream
0x00007ffff7f4fcc0  typeinfo name for std::basic_ostream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f4fd00  typeinfo name for std::__cxx11::basic_stringbuf<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f4fd40  typeinfo name for std::__cxx11::basic_istringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f4fd80  typeinfo name for std::__cxx11::basic_ostringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f4fdc0  typeinfo name for std::__cxx11::basic_stringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f4fe00  typeinfo name for std::__cxx11::basic_stringbuf<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f4fe40  typeinfo name for std::__cxx11::basic_istringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f4fe80  typeinfo name for std::__cxx11::basic_ostringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f4fec0  typeinfo name for std::__cxx11::basic_stringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f4ff00  typeinfo name for std::basic_streambuf<char, std::char_traits<char> >
0x00007ffff7f4ff40  typeinfo name for std::basic_streambuf<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f4ffe0  std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >::npos
0x00007ffff7f50120  typeinfo name for std::collate<wchar_t>
0x00007ffff7f50130  typeinfo name for std::collate_byname<wchar_t>
0x00007ffff7f50150  typeinfo name for std::__ctype_abstract_base<wchar_t>
0x00007ffff7f50170  typeinfo name for std::numpunct<wchar_t>
0x00007ffff7f50180  typeinfo name for std::numpunct_byname<wchar_t>
0x00007ffff7f501a0  typeinfo name for std::num_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f501e0  typeinfo name for std::num_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f50240  typeinfo name for std::__timepunct<wchar_t>
0x00007ffff7f50260  typeinfo name for std::moneypunct<wchar_t, true>
0x00007ffff7f50280  typeinfo name for std::moneypunct<wchar_t, false>
0x00007ffff7f50298  typeinfo name for std::messages<wchar_t>
0x00007ffff7f502c0  typeinfo name for std::__codecvt_abstract_base<wchar_t, char, __mbstate_t>
0x00007ffff7f50300  typeinfo name for std::codecvt_byname<wchar_t, char, __mbstate_t>
0x00007ffff7f50330  typeinfo name for std::moneypunct_byname<wchar_t, false>
0x00007ffff7f50350  typeinfo name for std::moneypunct_byname<wchar_t, true>
0x00007ffff7f50380  typeinfo name for std::money_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f503c0  typeinfo name for std::money_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f50400  typeinfo name for std::time_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f50440  typeinfo name for std::time_put_byname<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f504a0  typeinfo name for std::time_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f504e0  typeinfo name for std::time_get_byname<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f50530  typeinfo name for std::messages_byname<wchar_t>
0x00007ffff7f50547  std::moneypunct_byname<wchar_t, true>::intl
0x00007ffff7f50548  std::moneypunct_byname<wchar_t, false>::intl
0x00007ffff7f50549  std::moneypunct<wchar_t, true>::intl
0x00007ffff7f5054a  std::moneypunct<wchar_t, false>::intl
0x00007ffff7f50550  std::__cxx11::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >::npos
0x00007ffff7f88468  typeinfo for std::lock_error
0x00007ffff7f88480  typeinfo for std::error_category
0x00007ffff7f884c0  vtable for std::lock_error
0x00007ffff7f884e8  vtable for std::error_category
0x00007ffff7f885c0  typeinfo for std::__future_base::_State_base
0x00007ffff7f885d0  typeinfo for std::__future_base::_Async_state_common
0x00007ffff7f885e8  vtable for std::__future_base::_State_base
0x00007ffff7f88610  vtable for std::__future_base::_Async_state_common
0x00007ffff7f88638  typeinfo for __cxxabiv1::__array_type_info
0x00007ffff7f88650  vtable for __cxxabiv1::__array_type_info
0x00007ffff7f88690  typeinfo for std::bad_alloc
0x00007ffff7f886a8  vtable for std::bad_alloc
0x00007ffff7f886d0  typeinfo for std::bad_array_length
0x00007ffff7f886e8  vtable for std::bad_array_length
0x00007ffff7f88710  typeinfo for std::bad_array_new_length
0x00007ffff7f88728  vtable for std::bad_array_new_length
0x00007ffff7f88750  typeinfo for std::bad_cast
0x00007ffff7f88768  vtable for std::bad_cast
0x00007ffff7f88790  typeinfo for std::bad_typeid
0x00007ffff7f887a8  vtable for std::bad_typeid
0x00007ffff7f887d0  typeinfo for __cxxabiv1::__class_type_info
0x00007ffff7f887e8  vtable for __cxxabiv1::__class_type_info
0x00007ffff7f888c0  typeinfo for std::exception
0x00007ffff7f888d0  typeinfo for std::bad_exception
0x00007ffff7f888e8  typeinfo for __cxxabiv1::__forced_unwind
0x00007ffff7f888f8  typeinfo for __cxxabiv1::__foreign_exception
0x00007ffff7f88908  vtable for std::exception
0x00007ffff7f88930  vtable for std::bad_exception
0x00007ffff7f88958  typeinfo for __cxxabiv1::__enum_type_info
0x00007ffff7f88970  vtable for __cxxabiv1::__enum_type_info
0x00007ffff7f889b0  typeinfo for __cxxabiv1::__function_type_info
0x00007ffff7f889c8  vtable for __cxxabiv1::__function_type_info
0x00007ffff7f88a08  typeinfo for __cxxabiv1::__fundamental_type_info
0x00007ffff7f88a20  vtable for __cxxabiv1::__fundamental_type_info
0x00007ffff7f88a60  typeinfo for __float128 const*
0x00007ffff7f88a80  typeinfo for __float128*
0x00007ffff7f88aa0  typeinfo for __float128
0x00007ffff7f88ab0  typeinfo for unsigned __int128 const*
0x00007ffff7f88ad0  typeinfo for unsigned __int128*
0x00007ffff7f88af0  typeinfo for unsigned __int128
0x00007ffff7f88b00  typeinfo for __int128 const*
0x00007ffff7f88b20  typeinfo for __int128*
0x00007ffff7f88b40  typeinfo for __int128
0x00007ffff7f88b50  typeinfo for decltype(nullptr) const*
0x00007ffff7f88b70  typeinfo for decltype(nullptr)*
0x00007ffff7f88b90  typeinfo for decltype(nullptr)
0x00007ffff7f88ba0  typeinfo for decimal128 const*
0x00007ffff7f88bc0  typeinfo for decimal128*
0x00007ffff7f88be0  typeinfo for decimal128
0x00007ffff7f88bf0  typeinfo for decimal64 const*
0x00007ffff7f88c10  typeinfo for decimal64*
0x00007ffff7f88c30  typeinfo for decimal64
0x00007ffff7f88c40  typeinfo for decimal32 const*
0x00007ffff7f88c60  typeinfo for decimal32*
0x00007ffff7f88c80  typeinfo for decimal32
0x00007ffff7f88c90  typeinfo for long double const*
0x00007ffff7f88cb0  typeinfo for long double*
0x00007ffff7f88cd0  typeinfo for long double
0x00007ffff7f88ce0  typeinfo for double const*
0x00007ffff7f88d00  typeinfo for double*
0x00007ffff7f88d20  typeinfo for double
0x00007ffff7f88d30  typeinfo for float const*
0x00007ffff7f88d50  typeinfo for float*
0x00007ffff7f88d70  typeinfo for float
0x00007ffff7f88d80  typeinfo for unsigned long long const*
0x00007ffff7f88da0  typeinfo for unsigned long long*
0x00007ffff7f88dc0  typeinfo for unsigned long long
0x00007ffff7f88dd0  typeinfo for long long const*
0x00007ffff7f88df0  typeinfo for long long*
0x00007ffff7f88e10  typeinfo for long long
0x00007ffff7f88e20  typeinfo for unsigned long const*
0x00007ffff7f88e40  typeinfo for unsigned long*
0x00007ffff7f88e60  typeinfo for unsigned long
0x00007ffff7f88e70  typeinfo for long const*
0x00007ffff7f88e90  typeinfo for long*
0x00007ffff7f88eb0  typeinfo for long
0x00007ffff7f88ec0  typeinfo for unsigned int const*
0x00007ffff7f88ee0  typeinfo for unsigned int*
0x00007ffff7f88f00  typeinfo for unsigned int
0x00007ffff7f88f10  typeinfo for int const*
0x00007ffff7f88f30  typeinfo for int*
0x00007ffff7f88f50  typeinfo for int
0x00007ffff7f88f60  typeinfo for unsigned short const*
0x00007ffff7f88f80  typeinfo for unsigned short*
0x00007ffff7f88fa0  typeinfo for unsigned short
0x00007ffff7f88fb0  typeinfo for short const*
0x00007ffff7f88fd0  typeinfo for short*
0x00007ffff7f88ff0  typeinfo for short
0x00007ffff7f89000  typeinfo for unsigned char const*
0x00007ffff7f89020  typeinfo for unsigned char*
0x00007ffff7f89040  typeinfo for unsigned char
0x00007ffff7f89050  typeinfo for signed char const*
0x00007ffff7f89070  typeinfo for signed char*
0x00007ffff7f89090  typeinfo for signed char
0x00007ffff7f890a0  typeinfo for char const*
0x00007ffff7f890c0  typeinfo for char*
0x00007ffff7f890e0  typeinfo for char
0x00007ffff7f890f0  typeinfo for char32_t const*
0x00007ffff7f89110  typeinfo for char32_t*
0x00007ffff7f89130  typeinfo for char32_t
0x00007ffff7f89140  typeinfo for char16_t const*
0x00007ffff7f89160  typeinfo for char16_t*
0x00007ffff7f89180  typeinfo for char16_t
0x00007ffff7f89190  typeinfo for wchar_t const*
0x00007ffff7f891b0  typeinfo for wchar_t*
0x00007ffff7f891d0  typeinfo for wchar_t
0x00007ffff7f891e0  typeinfo for bool const*
0x00007ffff7f89200  typeinfo for bool*
0x00007ffff7f89220  typeinfo for bool
0x00007ffff7f89230  typeinfo for void const*
0x00007ffff7f89250  typeinfo for void*
0x00007ffff7f89270  typeinfo for void
0x00007ffff7f892c0  typeinfo for std::nested_exception
0x00007ffff7f892d0  vtable for std::nested_exception
0x00007ffff7f892f0  typeinfo for __cxxabiv1::__pbase_type_info
0x00007ffff7f89308  vtable for __cxxabiv1::__pbase_type_info
0x00007ffff7f89350  typeinfo for __cxxabiv1::__pointer_to_member_type_info
0x00007ffff7f89368  vtable for __cxxabiv1::__pointer_to_member_type_info
0x00007ffff7f893b0  typeinfo for __cxxabiv1::__pointer_type_info
0x00007ffff7f893c8  vtable for __cxxabiv1::__pointer_type_info
0x00007ffff7f89410  typeinfo for __cxxabiv1::__si_class_type_info
0x00007ffff7f89428  vtable for __cxxabiv1::__si_class_type_info
0x00007ffff7f89480  typeinfo for std::type_info
0x00007ffff7f89490  vtable for std::type_info
0x00007ffff7f894d0  typeinfo for __cxxabiv1::__vmi_class_type_info
0x00007ffff7f894e8  vtable for __cxxabiv1::__vmi_class_type_info
0x00007ffff7f89540  typeinfo for std::codecvt<char, char, __mbstate_t>
0x00007ffff7f89558  typeinfo for std::codecvt<wchar_t, char, __mbstate_t>
0x00007ffff7f89570  vtable for std::codecvt<char, char, __mbstate_t>
0x00007ffff7f895c8  vtable for std::codecvt<wchar_t, char, __mbstate_t>
0x00007ffff7f89620  typeinfo for std::ios_base::failure
0x00007ffff7f89638  vtable for std::ios_base::failure
0x00007ffff7f89660  typeinfo for std::locale::facet
0x00007ffff7f89670  vtable for std::locale::facet
0x00007ffff7f89958  typeinfo for std::logic_error
0x00007ffff7f89970  typeinfo for std::domain_error
0x00007ffff7f89988  typeinfo for std::invalid_argument
0x00007ffff7f899a0  typeinfo for std::length_error
0x00007ffff7f899b8  typeinfo for std::out_of_range
0x00007ffff7f899d0  typeinfo for std::runtime_error
0x00007ffff7f899e8  typeinfo for std::range_error
0x00007ffff7f89a00  typeinfo for std::overflow_error
0x00007ffff7f89a18  typeinfo for std::underflow_error
0x00007ffff7f89a30  vtable for std::logic_error
0x00007ffff7f89a58  vtable for std::domain_error
0x00007ffff7f89a80  vtable for std::invalid_argument
0x00007ffff7f89aa8  vtable for std::length_error
0x00007ffff7f89ad0  vtable for std::out_of_range
0x00007ffff7f89af8  vtable for std::runtime_error
0x00007ffff7f89b20  vtable for std::range_error
0x00007ffff7f89b48  vtable for std::overflow_error
0x00007ffff7f89b70  vtable for std::underflow_error
0x00007ffff7f89b98  typeinfo for std::strstreambuf
0x00007ffff7f89bb0  typeinfo for std::istrstream
0x00007ffff7f89bc8  typeinfo for std::ostrstream
0x00007ffff7f89be0  typeinfo for std::strstream
0x00007ffff7f89bf8  vtable for std::strstreambuf
0x00007ffff7f89cc8  VTT for std::istrstream
0x00007ffff7f89ce8  vtable for std::istrstream
0x00007ffff7f89d88  VTT for std::ostrstream
0x00007ffff7f89da8  vtable for std::ostrstream
0x00007ffff7f89f10  VTT for std::strstream
0x00007ffff7f89f60  vtable for std::strstream
0x00007ffff7f8a128  typeinfo for std::codecvt_base
0x00007ffff7f8a170  typeinfo for std::codecvt<char16_t, char, __mbstate_t>
0x00007ffff7f8a1c0  typeinfo for std::codecvt<char32_t, char, __mbstate_t>
0x00007ffff7f8a1d8  typeinfo for std::__codecvt_utf8_base<char16_t>
0x00007ffff7f8a1f0  typeinfo for std::__codecvt_utf16_base<char16_t>
0x00007ffff7f8a208  typeinfo for std::__codecvt_utf8_utf16_base<char16_t>
0x00007ffff7f8a220  typeinfo for std::__codecvt_utf8_base<char32_t>
0x00007ffff7f8a238  typeinfo for std::__codecvt_utf16_base<char32_t>
0x00007ffff7f8a250  typeinfo for std::__codecvt_utf8_utf16_base<char32_t>
0x00007ffff7f8a268  typeinfo for std::__codecvt_utf8_base<wchar_t>
0x00007ffff7f8a280  typeinfo for std::__codecvt_utf16_base<wchar_t>
0x00007ffff7f8a298  typeinfo for std::__codecvt_utf8_utf16_base<wchar_t>
0x00007ffff7f8a360  vtable for std::codecvt<char16_t, char, __mbstate_t>
0x00007ffff7f8a3b8  vtable for std::codecvt<char32_t, char, __mbstate_t>
0x00007ffff7f8a410  vtable for std::__codecvt_utf8_base<char16_t>
0x00007ffff7f8a468  vtable for std::__codecvt_utf8_base<char32_t>
0x00007ffff7f8a4c0  vtable for std::__codecvt_utf8_base<wchar_t>
0x00007ffff7f8a518  vtable for std::__codecvt_utf16_base<char16_t>
0x00007ffff7f8a570  vtable for std::__codecvt_utf16_base<char32_t>
0x00007ffff7f8a5c8  vtable for std::__codecvt_utf16_base<wchar_t>
0x00007ffff7f8a620  vtable for std::__codecvt_utf8_utf16_base<char16_t>
0x00007ffff7f8a678  vtable for std::__codecvt_utf8_utf16_base<char32_t>
0x00007ffff7f8a6d0  vtable for std::__codecvt_utf8_utf16_base<wchar_t>
0x00007ffff7f8a728  typeinfo for std::ctype_base
0x00007ffff7f8a738  typeinfo for std::ctype<char>
0x00007ffff7f8a770  typeinfo for std::ctype<wchar_t>
0x00007ffff7f8a788  typeinfo for std::ctype_byname<wchar_t>
0x00007ffff7f8a7a0  vtable for std::ctype<char>
0x00007ffff7f8a800  vtable for std::ctype<wchar_t>
0x00007ffff7f8a880  vtable for std::ctype_byname<wchar_t>
0x00007ffff7f8a900  typeinfo for std::bad_function_call
0x00007ffff7f8a918  vtable for std::bad_function_call
0x00007ffff7f8a940  typeinfo for std::future_error
0x00007ffff7f8a958  typeinfo for std::__future_base::_Result_base
0x00007ffff7f8a9d0  vtable for std::future_error
0x00007ffff7f8a9f8  vtable for std::__future_base::_Result_base
0x00007ffff7f8aa20  typeinfo for std::ios_base
0x00007ffff7f8aa30  vtable for std::ios_base
0x00007ffff7f8aa50  typeinfo for std::regex_error
0x00007ffff7f8aa68  vtable for std::regex_error
0x00007ffff7f8aa90  typeinfo for std::bad_weak_ptr
0x00007ffff7f8aaa8  vtable for std::bad_weak_ptr
0x00007ffff7f8aad0  typeinfo for std::_V2::error_category
0x00007ffff7f8aae0  typeinfo for std::system_error
0x00007ffff7f8abc8  vtable for std::_V2::error_category
0x00007ffff7f8ac18  vtable for std::system_error
0x00007ffff7f8ac40  typeinfo for std::thread::_State
0x00007ffff7f8ac50  vtable for std::thread::_State
0x00007ffff7f8b2a8  typeinfo for std::ios_base::failure[abi:cxx11]
0x00007ffff7f8b368  vtable for std::ios_base::failure[abi:cxx11]
0x00007ffff7f8bae0  typeinfo for std::ctype_byname<char>
0x00007ffff7f8baf8  vtable for std::ctype_byname<char>
0x00007ffff7f8bb58  typeinfo for std::basic_stringbuf<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8bb70  typeinfo for std::basic_istringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8bb88  typeinfo for std::basic_ostringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8bba0  typeinfo for std::basic_stringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8bbb8  typeinfo for std::basic_stringbuf<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8bbd0  typeinfo for std::basic_istringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8bbe8  typeinfo for std::basic_ostringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8bc00  typeinfo for std::basic_stringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8bc18  vtable for std::basic_stringbuf<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8bce8  VTT for std::basic_istringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8bd08  vtable for std::basic_istringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8bda8  VTT for std::basic_ostringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8bdc8  vtable for std::basic_ostringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8bf30  VTT for std::basic_stringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8bf80  vtable for std::basic_stringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8bff8  vtable for std::basic_stringbuf<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8c0c8  VTT for std::basic_istringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8c0e8  vtable for std::basic_istringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8c188  VTT for std::basic_ostringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8c1a8  vtable for std::basic_ostringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8c310  VTT for std::basic_stringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8c360  vtable for std::basic_stringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8c3d8  typeinfo for std::money_base
0x00007ffff7f8c3e8  typeinfo for std::messages_base
0x00007ffff7f8c3f8  typeinfo for std::time_base
0x00007ffff7f8c408  typeinfo for std::__cxx11::collate<char>
0x00007ffff7f8c420  typeinfo for std::__cxx11::collate_byname<char>
0x00007ffff7f8c438  typeinfo for std::__cxx11::numpunct<char>
0x00007ffff7f8c450  typeinfo for std::__cxx11::numpunct_byname<char>
0x00007ffff7f8c468  typeinfo for std::__cxx11::moneypunct<char, true>
0x00007ffff7f8c4a0  typeinfo for std::__cxx11::moneypunct<char, false>
0x00007ffff7f8c4d8  typeinfo for std::__cxx11::messages<char>
0x00007ffff7f8c510  typeinfo for std::__cxx11::moneypunct_byname<char, false>
0x00007ffff7f8c528  typeinfo for std::__cxx11::moneypunct_byname<char, true>
0x00007ffff7f8c540  typeinfo for std::__cxx11::money_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8c558  typeinfo for std::__cxx11::money_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8c570  typeinfo for std::__cxx11::time_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8c5a8  typeinfo for std::__cxx11::time_get_byname<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8c5c0  typeinfo for std::__cxx11::messages_byname<char>
0x00007ffff7f8c5d8  vtable for std::__cxx11::collate<char>
0x00007ffff7f8c610  vtable for std::__cxx11::collate_byname<char>
0x00007ffff7f8c648  vtable for std::__cxx11::numpunct<char>
0x00007ffff7f8c690  vtable for std::__cxx11::numpunct_byname<char>
0x00007ffff7f8c6d8  vtable for std::__cxx11::moneypunct<char, true>
0x00007ffff7f8c740  vtable for std::__cxx11::moneypunct<char, false>
0x00007ffff7f8c7a8  vtable for std::__cxx11::messages<char>
0x00007ffff7f8c7e0  vtable for std::__cxx11::moneypunct_byname<char, false>
0x00007ffff7f8c848  vtable for std::__cxx11::moneypunct_byname<char, true>
0x00007ffff7f8c8b0  vtable for std::__cxx11::money_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8c8e0  vtable for std::__cxx11::money_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8c910  vtable for std::__cxx11::time_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8c968  vtable for std::__cxx11::time_get_byname<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8c9c0  vtable for std::__cxx11::messages_byname<char>
0x00007ffff7f8c9f8  typeinfo for std::__cxx11::collate<wchar_t>
0x00007ffff7f8ca10  typeinfo for std::__cxx11::collate_byname<wchar_t>
0x00007ffff7f8ca28  typeinfo for std::__cxx11::numpunct<wchar_t>
0x00007ffff7f8ca40  typeinfo for std::__cxx11::numpunct_byname<wchar_t>
0x00007ffff7f8ca58  typeinfo for std::__cxx11::moneypunct<wchar_t, true>
0x00007ffff7f8ca90  typeinfo for std::__cxx11::moneypunct<wchar_t, false>
0x00007ffff7f8cac8  typeinfo for std::__cxx11::messages<wchar_t>
0x00007ffff7f8cb00  typeinfo for std::__cxx11::moneypunct_byname<wchar_t, false>
0x00007ffff7f8cb18  typeinfo for std::__cxx11::moneypunct_byname<wchar_t, true>
0x00007ffff7f8cb30  typeinfo for std::__cxx11::money_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8cb48  typeinfo for std::__cxx11::money_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8cb60  typeinfo for std::__cxx11::time_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8cb98  typeinfo for std::__cxx11::time_get_byname<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8cbb0  typeinfo for std::__cxx11::messages_byname<wchar_t>
0x00007ffff7f8cbc8  vtable for std::__cxx11::collate<wchar_t>
0x00007ffff7f8cc00  vtable for std::__cxx11::collate_byname<wchar_t>
0x00007ffff7f8cc38  vtable for std::__cxx11::numpunct<wchar_t>
0x00007ffff7f8cc80  vtable for std::__cxx11::numpunct_byname<wchar_t>
0x00007ffff7f8ccc8  vtable for std::__cxx11::moneypunct<wchar_t, true>
0x00007ffff7f8cd30  vtable for std::__cxx11::moneypunct<wchar_t, false>
0x00007ffff7f8cd98  vtable for std::__cxx11::messages<wchar_t>
0x00007ffff7f8cdd0  vtable for std::__cxx11::moneypunct_byname<wchar_t, false>
0x00007ffff7f8ce38  vtable for std::__cxx11::moneypunct_byname<wchar_t, true>
0x00007ffff7f8cea0  vtable for std::__cxx11::money_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8ced0  vtable for std::__cxx11::money_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8cf00  vtable for std::__cxx11::time_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8cf58  vtable for std::__cxx11::time_get_byname<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8cfb0  vtable for std::__cxx11::messages_byname<wchar_t>
0x00007ffff7f8cfe8  typeinfo for __gnu_cxx::stdio_sync_filebuf<char, std::char_traits<char> >
0x00007ffff7f8d000  typeinfo for __gnu_cxx::stdio_sync_filebuf<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8d018  typeinfo for __gnu_cxx::stdio_filebuf<char, std::char_traits<char> >
0x00007ffff7f8d030  typeinfo for __gnu_cxx::stdio_filebuf<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8d048  vtable for __gnu_cxx::stdio_sync_filebuf<char, std::char_traits<char> >
0x00007ffff7f8d0c8  vtable for __gnu_cxx::stdio_sync_filebuf<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8d248  typeinfo for std::basic_filebuf<char, std::char_traits<char> >
0x00007ffff7f8d260  typeinfo for std::basic_ifstream<char, std::char_traits<char> >
0x00007ffff7f8d278  typeinfo for std::basic_ofstream<char, std::char_traits<char> >
0x00007ffff7f8d290  typeinfo for std::basic_fstream<char, std::char_traits<char> >
0x00007ffff7f8d2a8  typeinfo for std::basic_filebuf<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8d2c0  typeinfo for std::basic_ifstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8d2d8  typeinfo for std::basic_ofstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8d2f0  typeinfo for std::basic_fstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8d308  vtable for std::basic_filebuf<char, std::char_traits<char> >
0x00007ffff7f8d3d8  VTT for std::basic_ifstream<char, std::char_traits<char> >
0x00007ffff7f8d3f8  vtable for std::basic_ifstream<char, std::char_traits<char> >
0x00007ffff7f8d498  VTT for std::basic_ofstream<char, std::char_traits<char> >
0x00007ffff7f8d4b8  vtable for std::basic_ofstream<char, std::char_traits<char> >
0x00007ffff7f8d620  VTT for std::basic_fstream<char, std::char_traits<char> >
0x00007ffff7f8d670  vtable for std::basic_fstream<char, std::char_traits<char> >
0x00007ffff7f8d6e8  vtable for std::basic_filebuf<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8d7b8  VTT for std::basic_ifstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8d7d8  vtable for std::basic_ifstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8d878  VTT for std::basic_ofstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8d898  vtable for std::basic_ofstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8da00  VTT for std::basic_fstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8da50  vtable for std::basic_fstream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8dac8  typeinfo for std::basic_ios<char, std::char_traits<char> >
0x00007ffff7f8dae0  typeinfo for std::basic_ios<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8daf8  vtable for std::basic_ios<char, std::char_traits<char> >
0x00007ffff7f8db18  vtable for std::basic_ios<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8db38  typeinfo for std::iostream
0x00007ffff7f8db70  typeinfo for std::basic_iostream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8dc48  VTT for std::iostream
0x00007ffff7f8dc80  vtable for std::iostream
0x00007ffff7f8dd98  VTT for std::basic_iostream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8ddd0  vtable for std::basic_iostream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8de48  typeinfo for std::istream
0x00007ffff7f8de70  typeinfo for std::basic_istream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8de98  VTT for std::istream
0x00007ffff7f8dea8  vtable for std::istream
0x00007ffff7f8def8  VTT for std::basic_istream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8df08  vtable for std::basic_istream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8df58  typeinfo for std::collate<char>
0x00007ffff7f8df70  typeinfo for std::collate_byname<char>
0x00007ffff7f8df88  typeinfo for std::numpunct<char>
0x00007ffff7f8dfa0  typeinfo for std::numpunct_byname<char>
0x00007ffff7f8dfb8  typeinfo for std::num_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8dfd0  typeinfo for std::num_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e000  typeinfo for std::__timepunct<char>
0x00007ffff7f8e018  typeinfo for std::moneypunct<char, true>
0x00007ffff7f8e050  typeinfo for std::moneypunct<char, false>
0x00007ffff7f8e088  typeinfo for std::messages<char>
0x00007ffff7f8e0c0  typeinfo for std::__codecvt_abstract_base<char, char, __mbstate_t>
0x00007ffff7f8e0f8  typeinfo for std::codecvt_byname<char, char, __mbstate_t>
0x00007ffff7f8e110  typeinfo for std::moneypunct_byname<char, false>
0x00007ffff7f8e128  typeinfo for std::moneypunct_byname<char, true>
0x00007ffff7f8e140  typeinfo for std::money_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e158  typeinfo for std::money_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e170  typeinfo for std::time_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e188  typeinfo for std::time_put_byname<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e1a0  typeinfo for std::time_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e1d8  typeinfo for std::time_get_byname<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e1f0  typeinfo for std::messages_byname<char>
0x00007ffff7f8e208  typeinfo for std::__ctype_abstract_base<char>
0x00007ffff7f8e240  vtable for std::collate<char>
0x00007ffff7f8e278  vtable for std::collate_byname<char>
0x00007ffff7f8e2b0  vtable for std::numpunct<char>
0x00007ffff7f8e2f8  vtable for std::numpunct_byname<char>
0x00007ffff7f8e340  vtable for std::num_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e3b8  vtable for std::num_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e438  vtable for std::__timepunct<char>
0x00007ffff7f8e458  vtable for std::moneypunct<char, true>
0x00007ffff7f8e4c0  vtable for std::moneypunct<char, false>
0x00007ffff7f8e528  vtable for std::messages<char>
0x00007ffff7f8e560  vtable for std::__codecvt_abstract_base<char, char, __mbstate_t>
0x00007ffff7f8e5b8  vtable for std::codecvt_byname<char, char, __mbstate_t>
0x00007ffff7f8e610  vtable for std::moneypunct_byname<char, false>
0x00007ffff7f8e678  vtable for std::moneypunct_byname<char, true>
0x00007ffff7f8e6e0  vtable for std::money_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e710  vtable for std::money_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e740  vtable for std::time_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e768  vtable for std::time_put_byname<char, std::ostreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e790  vtable for std::time_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e7e0  vtable for std::time_get_byname<char, std::istreambuf_iterator<char, std::char_traits<char> > >
0x00007ffff7f8e830  vtable for std::messages_byname<char>
0x00007ffff7f8e868  vtable for std::__ctype_abstract_base<char>
0x00007ffff7f8e8e8  typeinfo for std::ostream
0x00007ffff7f8e910  typeinfo for std::basic_ostream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8e938  VTT for std::ostream
0x00007ffff7f8e948  vtable for std::ostream
0x00007ffff7f8e998  VTT for std::basic_ostream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8e9a8  vtable for std::basic_ostream<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8e9f8  typeinfo for std::__cxx11::basic_stringbuf<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8ea10  typeinfo for std::__cxx11::basic_istringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8ea28  typeinfo for std::__cxx11::basic_ostringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8ea40  typeinfo for std::__cxx11::basic_stringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8ea58  typeinfo for std::__cxx11::basic_stringbuf<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8ea70  typeinfo for std::__cxx11::basic_istringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8ea88  typeinfo for std::__cxx11::basic_ostringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8eaa0  typeinfo for std::__cxx11::basic_stringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8eab8  vtable for std::__cxx11::basic_stringbuf<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8eb88  VTT for std::__cxx11::basic_istringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8eba8  vtable for std::__cxx11::basic_istringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8ec48  VTT for std::__cxx11::basic_ostringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8ec68  vtable for std::__cxx11::basic_ostringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8edd0  VTT for std::__cxx11::basic_stringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8ee20  vtable for std::__cxx11::basic_stringstream<char, std::char_traits<char>, std::allocator<char> >
0x00007ffff7f8ee98  vtable for std::__cxx11::basic_stringbuf<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8ef68  VTT for std::__cxx11::basic_istringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8ef88  vtable for std::__cxx11::basic_istringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8f028  VTT for std::__cxx11::basic_ostringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8f048  vtable for std::__cxx11::basic_ostringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8f1b0  VTT for std::__cxx11::basic_stringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8f200  vtable for std::__cxx11::basic_stringstream<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >
0x00007ffff7f8f278  typeinfo for std::basic_streambuf<char, std::char_traits<char> >
0x00007ffff7f8f288  typeinfo for std::basic_streambuf<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8f298  vtable for std::basic_streambuf<char, std::char_traits<char> >
0x00007ffff7f8f318  vtable for std::basic_streambuf<wchar_t, std::char_traits<wchar_t> >
0x00007ffff7f8f398  typeinfo for std::collate<wchar_t>
0x00007ffff7f8f3b0  typeinfo for std::collate_byname<wchar_t>
0x00007ffff7f8f3c8  typeinfo for std::__ctype_abstract_base<wchar_t>
0x00007ffff7f8f400  typeinfo for std::numpunct<wchar_t>
0x00007ffff7f8f418  typeinfo for std::numpunct_byname<wchar_t>
0x00007ffff7f8f430  typeinfo for std::num_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8f448  typeinfo for std::num_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8f478  typeinfo for std::__timepunct<wchar_t>
0x00007ffff7f8f490  typeinfo for std::moneypunct<wchar_t, true>
0x00007ffff7f8f4c8  typeinfo for std::moneypunct<wchar_t, false>
0x00007ffff7f8f500  typeinfo for std::messages<wchar_t>
0x00007ffff7f8f538  typeinfo for std::__codecvt_abstract_base<wchar_t, char, __mbstate_t>
0x00007ffff7f8f570  typeinfo for std::codecvt_byname<wchar_t, char, __mbstate_t>
0x00007ffff7f8f588  typeinfo for std::moneypunct_byname<wchar_t, false>
0x00007ffff7f8f5a0  typeinfo for std::moneypunct_byname<wchar_t, true>
0x00007ffff7f8f5b8  typeinfo for std::money_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8f5d0  typeinfo for std::money_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8f5e8  typeinfo for std::time_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8f600  typeinfo for std::time_put_byname<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8f618  typeinfo for std::time_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8f650  typeinfo for std::time_get_byname<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8f668  typeinfo for std::messages_byname<wchar_t>
0x00007ffff7f8f680  vtable for std::collate<wchar_t>
0x00007ffff7f8f6b8  vtable for std::collate_byname<wchar_t>
0x00007ffff7f8f6f0  vtable for std::__ctype_abstract_base<wchar_t>
0x00007ffff7f8f770  vtable for std::numpunct<wchar_t>
0x00007ffff7f8f7b8  vtable for std::numpunct_byname<wchar_t>
0x00007ffff7f8f800  vtable for std::num_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8f878  vtable for std::num_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8f8f8  vtable for std::__timepunct<wchar_t>
0x00007ffff7f8f918  vtable for std::moneypunct<wchar_t, true>
0x00007ffff7f8f980  vtable for std::moneypunct<wchar_t, false>
0x00007ffff7f8f9e8  vtable for std::messages<wchar_t>
0x00007ffff7f8fa20  vtable for std::__codecvt_abstract_base<wchar_t, char, __mbstate_t>
0x00007ffff7f8fa78  vtable for std::codecvt_byname<wchar_t, char, __mbstate_t>
0x00007ffff7f8fad0  vtable for std::moneypunct_byname<wchar_t, false>
0x00007ffff7f8fb38  vtable for std::moneypunct_byname<wchar_t, true>
0x00007ffff7f8fba0  vtable for std::money_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8fbd0  vtable for std::money_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8fc00  vtable for std::time_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8fc28  vtable for std::time_put_byname<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8fc50  vtable for std::time_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8fca0  vtable for std::time_get_byname<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >
0x00007ffff7f8fcf0  vtable for std::messages_byname<wchar_t>
0x00007ffff7f92a38  std::__num_base::_S_atoms_out
0x00007ffff7f92a40  std::__num_base::_S_atoms_in
0x00007ffff7f92a48  std::money_base::_S_atoms
0x00007ffff7f92a60  std::__timepunct_cache<wchar_t>::_S_timezones
0x00007ffff7f92ae0  std::__timepunct_cache<char>::_S_timezones
0x00007ffff7f92be8  std::adopt_lock
0x00007ffff7f92be9  std::try_to_lock
0x00007ffff7f92bea  std::defer_lock
0x00007ffff7f92bf0  std::future_category
0x00007ffff7f92f20  std::codecvt<wchar_t, char, __mbstate_t>::id
0x00007ffff7f92f28  std::codecvt<char, char, __mbstate_t>::id
0x00007ffff7f93780  std::wclog
0x00007ffff7f938a0  std::wcerr
0x00007ffff7f939c0  std::wcout
0x00007ffff7f93ae0  std::wcin
0x00007ffff7f93c00  std::clog
0x00007ffff7f93d20  std::cerr
0x00007ffff7f93e40  std::cout
0x00007ffff7f93f60  std::cin
0x00007ffff7f958c0  std::codecvt<char32_t, char, __mbstate_t>::id
0x00007ffff7f958c8  std::codecvt<char16_t, char, __mbstate_t>::id
0x00007ffff7f958e8  std::ctype<wchar_t>::id
0x00007ffff7f958f0  std::ctype<char>::id
0x00007ffff7f95d60  std::string::_Rep::_S_empty_rep_storage
0x00007ffff7f95d80  std::basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t> >::_Rep::_S_empty_rep_storage
0x00007ffff7f95da0  guard variable for std::__cxx11::collate<char>::id
0x00007ffff7f95da8  guard variable for std::__cxx11::messages<char>::id
0x00007ffff7f95db0  guard variable for std::__cxx11::time_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95db8  guard variable for std::__cxx11::numpunct<char>::id
0x00007ffff7f95dc0  guard variable for std::__cxx11::money_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95dc8  guard variable for std::__cxx11::money_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95dd0  guard variable for std::__cxx11::moneypunct<char, true>::id
0x00007ffff7f95dd8  guard variable for std::__cxx11::moneypunct<char, false>::id
0x00007ffff7f95de0  std::__cxx11::collate<char>::id
0x00007ffff7f95de8  std::__cxx11::messages<char>::id
0x00007ffff7f95df0  std::__cxx11::time_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95df8  std::__cxx11::numpunct<char>::id
0x00007ffff7f95e00  std::__cxx11::money_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95e08  std::__cxx11::money_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95e10  std::__cxx11::moneypunct<char, true>::id
0x00007ffff7f95e18  std::__cxx11::moneypunct<char, false>::id
0x00007ffff7f95e20  guard variable for std::__cxx11::collate<wchar_t>::id
0x00007ffff7f95e28  guard variable for std::__cxx11::messages<wchar_t>::id
0x00007ffff7f95e30  guard variable for std::__cxx11::time_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95e38  guard variable for std::__cxx11::numpunct<wchar_t>::id
0x00007ffff7f95e40  guard variable for std::__cxx11::money_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95e48  guard variable for std::__cxx11::money_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95e50  guard variable for std::__cxx11::moneypunct<wchar_t, true>::id
0x00007ffff7f95e58  guard variable for std::__cxx11::moneypunct<wchar_t, false>::id
0x00007ffff7f95e60  std::__cxx11::collate<wchar_t>::id
0x00007ffff7f95e68  std::__cxx11::messages<wchar_t>::id
0x00007ffff7f95e70  std::__cxx11::time_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95e78  std::__cxx11::numpunct<wchar_t>::id
0x00007ffff7f95e80  std::__cxx11::money_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95e88  std::__cxx11::money_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95e90  std::__cxx11::moneypunct<wchar_t, true>::id
0x00007ffff7f95e98  std::__cxx11::moneypunct<wchar_t, false>::id
0x00007ffff7f95ea0  guard variable for std::collate<char>::id
0x00007ffff7f95ea8  guard variable for std::messages<char>::id
0x00007ffff7f95eb0  guard variable for std::time_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95eb8  guard variable for std::time_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95ec0  guard variable for std::__timepunct<char>::id
0x00007ffff7f95ec8  guard variable for std::num_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95ed0  guard variable for std::num_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95ed8  guard variable for std::numpunct<char>::id
0x00007ffff7f95ee0  guard variable for std::money_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95ee8  guard variable for std::money_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95ef0  guard variable for std::moneypunct<char, true>::id
0x00007ffff7f95ef8  guard variable for std::moneypunct<char, false>::id
0x00007ffff7f95f00  std::collate<char>::id
0x00007ffff7f95f08  std::messages<char>::id
0x00007ffff7f95f10  std::time_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95f18  std::time_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95f20  std::__timepunct<char>::id
0x00007ffff7f95f28  std::num_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95f30  std::num_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95f38  std::numpunct<char>::id
0x00007ffff7f95f40  std::money_put<char, std::ostreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95f48  std::money_get<char, std::istreambuf_iterator<char, std::char_traits<char> > >::id
0x00007ffff7f95f50  std::moneypunct<char, true>::id
0x00007ffff7f95f58  std::moneypunct<char, false>::id
0x00007ffff7f95f60  guard variable for std::collate<wchar_t>::id
0x00007ffff7f95f68  guard variable for std::messages<wchar_t>::id
0x00007ffff7f95f70  guard variable for std::time_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95f78  guard variable for std::time_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95f80  guard variable for std::__timepunct<wchar_t>::id
0x00007ffff7f95f88  guard variable for std::num_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95f90  guard variable for std::num_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95f98  guard variable for std::numpunct<wchar_t>::id
0x00007ffff7f95fa0  guard variable for std::money_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95fa8  guard variable for std::money_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95fb0  guard variable for std::moneypunct<wchar_t, true>::id
0x00007ffff7f95fb8  guard variable for std::moneypunct<wchar_t, false>::id
0x00007ffff7f95fc0  std::collate<wchar_t>::id
0x00007ffff7f95fc8  std::messages<wchar_t>::id
0x00007ffff7f95fd0  std::time_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95fd8  std::time_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95fe0  std::__timepunct<wchar_t>::id
0x00007ffff7f95fe8  std::num_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95ff0  std::num_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f95ff8  std::numpunct<wchar_t>::id
0x00007ffff7f96000  std::money_put<wchar_t, std::ostreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f96008  std::money_get<wchar_t, std::istreambuf_iterator<wchar_t, std::char_traits<wchar_t> > >::id
0x00007ffff7f96010  std::moneypunct<wchar_t, true>::id
0x00007ffff7f96018  std::moneypunct<wchar_t, false>::id
0x00007ffff7d3d010  ldbl_min
0x00007ffff7d3d080  othermask
0x00007ffff7d3d0b0  signmask
0x00007ffff7d3d860  __PRETTY_FUNCTION__.10812
0x00007ffff7d3d890  inf_zero
0x00007ffff7d3d890  infinity
0x00007ffff7d3d9f0  c0
0x00007ffff7d3da00  c1
0x00007ffff7d3da10  csat
0x00007ffff7d3ef18  limit
0x00007ffff7d3ef28  p63
0x00007ffff7d3ef30  p64
0x00007ffff7d3ef38  p78
0x00007ffff7d3ef40  pm79
0x00007ffff7d3ef50  minf_mzero
0x00007ffff7d3ef50  minfinity
0x00007ffff7d3ef58  mzero
0x00007ffff7d3fe10  zero_nan
0x00007ffff7d3fe18  nan
0x00007ffff7d40620  limit
0x00007ffff7d406c0  c0
0x00007ffff7d406d0  c1
0x00007ffff7d46fa0  pr
0x00007ffff7d55dc0  c1
0x00007ffff7d55dc0  c1
0x00007ffff7d55dc0  c1
0x00007ffff7d56118  hpinv
0x00007ffff7d56118  hpinv
0x00007ffff7d56118  hpinv
0x00007ffff7d56780  ln2b
0x00007ffff7d567a0  Lv.11498
0x00007ffff7d57e40  Lu.11497
0x00007ffff7d589a0  ln2a
0x00007ffff7d589a8  a3
0x00007ffff7d589b0  a2
0x00007ffff7d589c0  Iv.11496
0x00007ffff7d59510  delv
0x00007ffff7d59518  delu
0x00007ffff7d59520  h2
0x00007ffff7d59540  Iu.11495
0x00007ffff7d59af0  h1
0x00007ffff7d59af8  b0
0x00007ffff7d59b00  b1
0x00007ffff7d59b08  b2
0x00007ffff7d59b10  b3
0x00007ffff7d59b18  b4
0x00007ffff7d59b20  b5
0x00007ffff7d59b28  b6
0x00007ffff7d59b30  b8
0x00007ffff7d59b38  b7
0x00007ffff7d59b40  sqrt_2
0x00007ffff7d59b48  u03
0x00007ffff7d59b50  two54
0x00007ffff7d59b60  two54
0x00007ffff7d59b60  two54
0x00007ffff7d59b60  two54
0x00007ffff7d63aa8  a3
0x00007ffff7d63aa8  a3
0x00007ffff7d63aa8  a3
0x00007ffff7d63aa8  b0
0x00007ffff7d63aa8  b0
0x00007ffff7d63aa8  b0
0x00007ffff7d63aa8  d3
0x00007ffff7d63aa8  d3
0x00007ffff7d63aa8  d3
0x00007ffff7d63b00  toint
0x00007ffff7d63b00  toint
0x00007ffff7d63b00  toint
0x00007ffff7d63ba0  pr
0x00007ffff7d6edc8  mp1
0x00007ffff7d6edc8  mp1
0x00007ffff7d6edc8  mp1
0x00007ffff7d6edd0  mp2
0x00007ffff7d6edd0  mp2
0x00007ffff7d6edd0  mp2
0x00007ffff7d6edd8  pp3
0x00007ffff7d6edd8  pp3
0x00007ffff7d6edd8  pp3
0x00007ffff7d6ede0  pp4
0x00007ffff7d6ede0  pp4
0x00007ffff7d6ede0  pp4
0x00007ffff7d6ee00  u27
0x00007ffff7d6ee00  u28
0x00007ffff7d6ee08  u23
0x00007ffff7d6ee10  u24
0x00007ffff7d6ee18  u21
0x00007ffff7d6ee20  u22
0x00007ffff7d6ee28  u19
0x00007ffff7d6ee28  u20
0x00007ffff7d6ee30  ua17
0x00007ffff7d6ee30  ua18
0x00007ffff7d6ee38  u15
0x00007ffff7d6ee40  u16
0x00007ffff7d6ee48  g5
0x00007ffff7d6ee50  u11
0x00007ffff7d6ee50  u12
0x00007ffff7d6ee58  ub17
0x00007ffff7d6ee58  ub25
0x00007ffff7d6ee58  ub9
0x00007ffff7d6ee60  u17
0x00007ffff7d6ee60  u25
0x00007ffff7d6ee60  u9
0x00007ffff7d6ee68  ub10
0x00007ffff7d6ee68  ub18
0x00007ffff7d6ee68  ub26
0x00007ffff7d6ee70  u10
0x00007ffff7d6ee70  u18
0x00007ffff7d6ee70  u26
0x00007ffff7d6ee78  u7
0x00007ffff7d6ee80  u8
0x00007ffff7d6ee88  pp4
0x00007ffff7d6ee90  pp3
0x00007ffff7d6ee98  u13
0x00007ffff7d6ee98  u5
0x00007ffff7d6eea0  u14
0x00007ffff7d6eea0  u6
0x00007ffff7d6eea8  gy1
0x00007ffff7d6eeb0  mp3
0x00007ffff7d6eeb8  mp2
0x00007ffff7d6eec0  mp1
0x00007ffff7d6eec8  toint
0x00007ffff7d6eed0  hpinv
0x00007ffff7d6eed8  g4
0x00007ffff7d6eee0  u4
0x00007ffff7d6eee8  ub3
0x00007ffff7d6eef0  ua10
0x00007ffff7d6eef0  ua25
0x00007ffff7d6eef0  ua26
0x00007ffff7d6eef0  ua3
0x00007ffff7d6eef0  ua9
0x00007ffff7d6eef8  u3
0x00007ffff7d6ef00  e1
0x00007ffff7d6ef08  e0
0x00007ffff7d6ef20  xfg
0x00007ffff7d70660  mfftnhf
0x00007ffff7d70668  g3
0x00007ffff7d70670  u2
0x00007ffff7d70678  aa3
0x00007ffff7d70680  aa5
0x00007ffff7d70688  a5
0x00007ffff7d70690  aa7
0x00007ffff7d70698  a7
0x00007ffff7d706a0  aa9
0x00007ffff7d706a8  a9
0x00007ffff7d706b0  aa11
0x00007ffff7d706b8  a11
0x00007ffff7d706c0  aa13
0x00007ffff7d706c8  a13
0x00007ffff7d706d0  a15
0x00007ffff7d706d8  a17
0x00007ffff7d706e0  a19
0x00007ffff7d706e8  a21
0x00007ffff7d706f0  a23
0x00007ffff7d706f8  a27
0x00007ffff7d70700  a25
0x00007ffff7d70708  u1
0x00007ffff7d70710  a3
0x00007ffff7d70710  d3
0x00007ffff7d70718  d5
0x00007ffff7d70720  d7
0x00007ffff7d70728  d11
0x00007ffff7d70730  d9
0x00007ffff7d70738  g2
0x00007ffff7d70738  gy2
0x00007ffff7d70740  g1
0x00007ffff7d733c0  mask
0x00007ffff7d84b88  cc1
0x00007ffff7d84b88  cc1
0x00007ffff7d84b88  cc1
0x00007ffff7d84b90  cc2
0x00007ffff7d84b90  cc2
0x00007ffff7d84b90  cc2
0x00007ffff7d84b98  c2
0x00007ffff7d84b98  c2
0x00007ffff7d84b98  c2
0x00007ffff7d84ba0  cc3
0x00007ffff7d84ba0  cc3
0x00007ffff7d84ba0  cc3
0x00007ffff7d84ba8  c3
0x00007ffff7d84ba8  c3
0x00007ffff7d84ba8  c3
0x00007ffff7d84bb0  cc4
0x00007ffff7d84bb0  cc4
0x00007ffff7d84bb0  cc4
0x00007ffff7d84bb8  c4
0x00007ffff7d84bb8  c4
0x00007ffff7d84bb8  c4
0x00007ffff7d84c60  np1
0x00007ffff7d851c0  mp3halfs
0x00007ffff7d85320  mphalf
0x00007ffff7d8c2d8  ln2b
0x00007ffff7d8c2d8  ln2b
0x00007ffff7d8c2d8  ln2b
0x00007ffff7d8c2e0  ln2a
0x00007ffff7d8c2e0  ln2a
0x00007ffff7d8c2e0  ln2a
0x00007ffff7d8c2f0  a3
0x00007ffff7d8c2f0  a3
0x00007ffff7d8c2f0  a3
0x00007ffff7d8c2f8  a2
0x00007ffff7d8c2f8  a2
0x00007ffff7d8c2f8  a2
0x00007ffff7d8c300  delv
0x00007ffff7d8c300  delv
0x00007ffff7d8c300  delv
0x00007ffff7d8c308  delu
0x00007ffff7d8c308  delu
0x00007ffff7d8c308  delu
0x00007ffff7d8c310  h2
0x00007ffff7d8c310  h2
0x00007ffff7d8c310  h2
0x00007ffff7d8c318  h1
0x00007ffff7d8c318  h1
0x00007ffff7d8c318  h1
0x00007ffff7d8c320  b1
0x00007ffff7d8c320  b1
0x00007ffff7d8c320  b1
0x00007ffff7d8c328  b2
0x00007ffff7d8c328  b2
0x00007ffff7d8c328  b2
0x00007ffff7d8c330  b3
0x00007ffff7d8c330  b3
0x00007ffff7d8c330  b3
0x00007ffff7d8c338  b4
0x00007ffff7d8c338  b4
0x00007ffff7d8c338  b4
0x00007ffff7d8c340  b5
0x00007ffff7d8c340  b5
0x00007ffff7d8c340  b5
0x00007ffff7d8c348  b6
0x00007ffff7d8c348  b6
0x00007ffff7d8c348  b6
0x00007ffff7d8c350  b8
0x00007ffff7d8c350  b8
0x00007ffff7d8c350  b8
0x00007ffff7d8c358  b7
0x00007ffff7d8c358  b7
0x00007ffff7d8c358  b7
0x00007ffff7d8c360  sqrt_2
0x00007ffff7d8c360  sqrt_2
0x00007ffff7d8c360  sqrt_2
0x00007ffff7d8c368  u03
0x00007ffff7d8c368  u03
0x00007ffff7d8c368  u03
0x00007ffff7d8c380  Lv.7103
0x00007ffff7d8da20  Lu.7102
0x00007ffff7d8e580  Iv.7101
0x00007ffff7d8f0e0  Iu.7100
0x00007ffff7d99560  pr
0x00007ffff7d99560  pr
0x00007ffff7d99560  pr
0x00007ffff7da9920  pr
0x00007ffff7db4710  u27
0x00007ffff7db4710  u27
0x00007ffff7db4710  u27
0x00007ffff7db4710  u28
0x00007ffff7db4710  u28
0x00007ffff7db4710  u28
0x00007ffff7db4718  u23
0x00007ffff7db4718  u23
0x00007ffff7db4718  u23
0x00007ffff7db4720  u24
0x00007ffff7db4720  u24
0x00007ffff7db4720  u24
0x00007ffff7db4728  u21
0x00007ffff7db4728  u21
0x00007ffff7db4728  u21
0x00007ffff7db4730  u22
0x00007ffff7db4730  u22
0x00007ffff7db4730  u22
0x00007ffff7db4738  u19
0x00007ffff7db4738  u19
0x00007ffff7db4738  u19
0x00007ffff7db4738  u20
0x00007ffff7db4738  u20
0x00007ffff7db4738  u20
0x00007ffff7db4740  ua17
0x00007ffff7db4740  ua17
0x00007ffff7db4740  ua17
0x00007ffff7db4740  ua18
0x00007ffff7db4740  ua18
0x00007ffff7db4740  ua18
0x00007ffff7db4748  u15
0x00007ffff7db4748  u15
0x00007ffff7db4748  u15
0x00007ffff7db4750  u16
0x00007ffff7db4750  u16
0x00007ffff7db4750  u16
0x00007ffff7db4758  g5
0x00007ffff7db4758  g5
0x00007ffff7db4758  g5
0x00007ffff7db4760  u11
0x00007ffff7db4760  u11
0x00007ffff7db4760  u11
0x00007ffff7db4760  u12
0x00007ffff7db4760  u12
0x00007ffff7db4760  u12
0x00007ffff7db4768  ub17
0x00007ffff7db4768  ub17
0x00007ffff7db4768  ub17
0x00007ffff7db4768  ub25
0x00007ffff7db4768  ub25
0x00007ffff7db4768  ub25
0x00007ffff7db4768  ub9
0x00007ffff7db4768  ub9
0x00007ffff7db4768  ub9
0x00007ffff7db4770  u17
0x00007ffff7db4770  u17
0x00007ffff7db4770  u17
0x00007ffff7db4770  u25
0x00007ffff7db4770  u25
0x00007ffff7db4770  u25
0x00007ffff7db4770  u9
0x00007ffff7db4770  u9
0x00007ffff7db4770  u9
0x00007ffff7db4778  ub10
0x00007ffff7db4778  ub10
0x00007ffff7db4778  ub10
0x00007ffff7db4778  ub18
0x00007ffff7db4778  ub18
0x00007ffff7db4778  ub18
0x00007ffff7db4778  ub26
0x00007ffff7db4778  ub26
0x00007ffff7db4778  ub26
0x00007ffff7db4780  u10
0x00007ffff7db4780  u10
0x00007ffff7db4780  u10
0x00007ffff7db4780  u18
0x00007ffff7db4780  u18
0x00007ffff7db4780  u18
0x00007ffff7db4780  u26
0x00007ffff7db4780  u26
0x00007ffff7db4780  u26
0x00007ffff7db4788  u7
0x00007ffff7db4788  u7
0x00007ffff7db4788  u7
0x00007ffff7db4790  u8
0x00007ffff7db4790  u8
0x00007ffff7db4790  u8
0x00007ffff7db4798  u13
0x00007ffff7db4798  u13
0x00007ffff7db4798  u13
0x00007ffff7db4798  u5
0x00007ffff7db4798  u5
0x00007ffff7db4798  u5
0x00007ffff7db47a0  u14
0x00007ffff7db47a0  u14
0x00007ffff7db47a0  u14
0x00007ffff7db47a0  u6
0x00007ffff7db47a0  u6
0x00007ffff7db47a0  u6
0x00007ffff7db47a8  gy1
0x00007ffff7db47a8  gy1
0x00007ffff7db47a8  gy1
0x00007ffff7db47b0  mp3
0x00007ffff7db47b0  mp3
0x00007ffff7db47b0  mp3
0x00007ffff7db47b8  g4
0x00007ffff7db47b8  g4
0x00007ffff7db47b8  g4
0x00007ffff7db47c0  u4
0x00007ffff7db47c0  u4
0x00007ffff7db47c0  u4
0x00007ffff7db47c8  ub3
0x00007ffff7db47c8  ub3
0x00007ffff7db47c8  ub3
0x00007ffff7db47d0  ua10
0x00007ffff7db47d0  ua10
0x00007ffff7db47d0  ua10
0x00007ffff7db47d0  ua25
0x00007ffff7db47d0  ua25
0x00007ffff7db47d0  ua25
0x00007ffff7db47d0  ua26
0x00007ffff7db47d0  ua26
0x00007ffff7db47d0  ua26
0x00007ffff7db47d0  ua3
0x00007ffff7db47d0  ua3
0x00007ffff7db47d0  ua3
0x00007ffff7db47d0  ua9
0x00007ffff7db47d0  ua9
0x00007ffff7db47d0  ua9
0x00007ffff7db47d8  u3
0x00007ffff7db47d8  u3
0x00007ffff7db47d8  u3
0x00007ffff7db47e0  e1
0x00007ffff7db47e0  e1
0x00007ffff7db47e0  e1
0x00007ffff7db47e8  e0
0x00007ffff7db47e8  e0
0x00007ffff7db47e8  e0
0x00007ffff7db47f0  mfftnhf
0x00007ffff7db47f0  mfftnhf
0x00007ffff7db47f0  mfftnhf
0x00007ffff7db47f8  g3
0x00007ffff7db47f8  g3
0x00007ffff7db47f8  g3
0x00007ffff7db4800  u2
0x00007ffff7db4800  u2
0x00007ffff7db4800  u2
0x00007ffff7db4808  aa3
0x00007ffff7db4808  aa3
0x00007ffff7db4808  aa3
0x00007ffff7db4810  aa5
0x00007ffff7db4810  aa5
0x00007ffff7db4810  aa5
0x00007ffff7db4818  a5
0x00007ffff7db4818  a5
0x00007ffff7db4818  a5
0x00007ffff7db4820  aa7
0x00007ffff7db4820  aa7
0x00007ffff7db4820  aa7
0x00007ffff7db4828  a7
0x00007ffff7db4828  a7
0x00007ffff7db4828  a7
0x00007ffff7db4830  aa9
0x00007ffff7db4830  aa9
0x00007ffff7db4830  aa9
0x00007ffff7db4838  a9
0x00007ffff7db4838  a9
0x00007ffff7db4838  a9
0x00007ffff7db4840  aa11
0x00007ffff7db4840  aa11
0x00007ffff7db4840  aa11
0x00007ffff7db4848  a11
0x00007ffff7db4848  a11
0x00007ffff7db4848  a11
0x00007ffff7db4850  aa13
0x00007ffff7db4850  aa13
0x00007ffff7db4850  aa13
0x00007ffff7db4858  a13
0x00007ffff7db4858  a13
0x00007ffff7db4858  a13
0x00007ffff7db4860  a15
0x00007ffff7db4860  a15
0x00007ffff7db4860  a15
0x00007ffff7db4868  a17
0x00007ffff7db4868  a17
0x00007ffff7db4868  a17
0x00007ffff7db4870  a19
0x00007ffff7db4870  a19
0x00007ffff7db4870  a19
0x00007ffff7db4878  a21
0x00007ffff7db4878  a21
0x00007ffff7db4878  a21
0x00007ffff7db4880  a23
0x00007ffff7db4880  a23
0x00007ffff7db4880  a23
0x00007ffff7db4888  a27
0x00007ffff7db4888  a27
0x00007ffff7db4888  a27
0x00007ffff7db4890  a25
0x00007ffff7db4890  a25
0x00007ffff7db4890  a25
0x00007ffff7db4898  u1
0x00007ffff7db4898  u1
0x00007ffff7db4898  u1
0x00007ffff7db48a0  d5
0x00007ffff7db48a0  d5
0x00007ffff7db48a0  d5
0x00007ffff7db48a8  d7
0x00007ffff7db48a8  d7
0x00007ffff7db48a8  d7
0x00007ffff7db48b0  d11
0x00007ffff7db48b0  d11
0x00007ffff7db48b0  d11
0x00007ffff7db48b8  d9
0x00007ffff7db48b8  d9
0x00007ffff7db48b8  d9
0x00007ffff7db48c0  g2
0x00007ffff7db48c0  g2
0x00007ffff7db48c0  g2
0x00007ffff7db48c0  gy2
0x00007ffff7db48c0  gy2
0x00007ffff7db48c0  gy2
0x00007ffff7db48c8  g1
0x00007ffff7db48c8  g1
0x00007ffff7db48c8  g1
0x00007ffff7db48e0  xfg
0x00007ffff7db6020  np1
0x00007ffff7db6740  mp3halfs
0x00007ffff7db68a0  mphalf
0x00007ffff7dbaea0  Lv.6934
0x00007ffff7dbc540  Lu.6933
0x00007ffff7dbd0a0  Iv.6932
0x00007ffff7dbdc00  Iu.6931
0x00007ffff7dd82e0  pr
0x00007ffff7de3080  xfg
0x00007ffff7de47c0  np1
0x00007ffff7de4ee0  mp3halfs
0x00007ffff7de5040  mphalf
0x00007ffff7de9040  Lv.6642
0x00007ffff7dea6e0  Lu.6641
0x00007ffff7deb240  Iv.6640
0x00007ffff7debda0  Iu.6639
0x00007ffff7df70c0  pr
0x00007ffff7e01e60  xfg
0x00007ffff7e035a0  np1
0x00007ffff7e036a4  __GNU_EH_FRAME_HDR
0x00007ffff7e0e71c  __FRAME_END__
0x00007ffff7e11d80  __frame_dummy_init_array_entry
0x00007ffff7e11d88  __do_global_dtors_aux_fini_array_entry
0x00007ffff7e12000  _GLOBAL_OFFSET_TABLE_
0x00007ffff7e12130  __dso_handle
0x00007ffff7e12138  _LIB_VERSION@GLIBC_2.2.5
0x00007ffff7e1213c  completed
0x00007ffff7e12140  __TMC_END__
0x00007ffff7c8f190  __cpu_model
0x00007ffff7c1f427  inmask
0x00007ffff7c1f500  slashdot
0x00007ffff7c1f520  codeset_idx
0x00007ffff7c2c040  mask
0x00007ffff7c2c200  nbits
0x00007ffff7c2c240  nbits
0x00007ffff7c2c280  nbits.12326
0x00007ffff7c2c3e0  nbits
0x00007ffff7c2fe00  step4_jumps
0x00007ffff7c2fe80  step3b_jumps
0x00007ffff7c2ff00  step4_jumps
0x00007ffff7c2ff80  step3a_jumps
0x00007ffff7c30000  step2_jumps
0x00007ffff7c30080  step1_jumps
0x00007ffff7c30100  step0_jumps
0x00007ffff7c301e0  units
0x00007ffff7c30200  step4_jumps
0x00007ffff7c30280  step3b_jumps
0x00007ffff7c30300  step4_jumps
0x00007ffff7c30380  step3a_jumps
0x00007ffff7c30400  step2_jumps
0x00007ffff7c30480  step1_jumps
0x00007ffff7c30500  step0_jumps
0x00007ffff7c317c0  result_type
0x00007ffff7c317e8  next_state
0x00007ffff7c322a0  nbits
0x00007ffff7c322e0  nbits.12466
0x00007ffff7c32320  nbits
0x00007ffff7c32360  nbits
0x00007ffff7c323d8  __PRETTY_FUNCTION__.9116
0x00007ffff7c323f0  __PRETTY_FUNCTION__.9121
0x00007ffff7c34440  CSWTCH.0
0x00007ffff7c34460  afs
0x00007ffff7c34540  CSWTCH.0
0x00007ffff7c34740  options
0x00007ffff7c35ec0  __PRETTY_FUNCTION__.9009
0x00007ffff7c37662  __PRETTY_FUNCTION__.13420
0x00007ffff7c37b33  __PRETTY_FUNCTION__.9677
0x00007ffff7c37e65  dot
0x00007ffff7c39030  longjmp_msg
0x00007ffff7c39c98  __PRETTY_FUNCTION__.9463
0x00007ffff7c39f48  aliasfile
0x00007ffff7c39fd8  __PRETTY_FUNCTION__.7982
0x00007ffff7c3a328  __PRETTY_FUNCTION__.12188
0x00007ffff7c3a328  __PRETTY_FUNCTION__.12197
0x00007ffff7c3a328  __PRETTY_FUNCTION__.12376
0x00007ffff7c3a328  __PRETTY_FUNCTION__.12385
0x00007ffff7c3a328  __PRETTY_FUNCTION__.13018
0x00007ffff7c3a328  __PRETTY_FUNCTION__.13206
0x00007ffff7c3a360  __PRETTY_FUNCTION__.8669
0x00007ffff7c3a488  __PRETTY_FUNCTION__.15265
0x00007ffff7c3a498  __PRETTY_FUNCTION__.13508
0x00007ffff7c3a4a8  __PRETTY_FUNCTION__.13551
0x00007ffff7c3a4e0  __PRETTY_FUNCTION__.10281
0x00007ffff7c3a9f8  __PRETTY_FUNCTION__.13744
0x00007ffff7c3ab08  __PRETTY_FUNCTION__.11409
0x00007ffff7c3b890  __PRETTY_FUNCTION__.13213
0x00007ffff7c3b8a0  __PRETTY_FUNCTION__.13168
0x00007ffff7c3b8b0  __PRETTY_FUNCTION__.13138
0x00007ffff7c3b8c0  __PRETTY_FUNCTION__.12690
0x00007ffff7c3b8d0  __PRETTY_FUNCTION__.12722
0x00007ffff7c3b8e0  __PRETTY_FUNCTION__.13101
0x00007ffff7c3b8f0  __PRETTY_FUNCTION__.13389
0x00007ffff7c3b900  __PRETTY_FUNCTION__.13038
0x00007ffff7c3b910  __PRETTY_FUNCTION__.13027
0x00007ffff7c3b920  __PRETTY_FUNCTION__.12683
0x00007ffff7c3b930  __PRETTY_FUNCTION__.13350
0x00007ffff7c3b940  __PRETTY_FUNCTION__.12983
0x00007ffff7c3b950  __PRETTY_FUNCTION__.13065
0x00007ffff7c3b960  __PRETTY_FUNCTION__.13060
0x00007ffff7c3b970  __PRETTY_FUNCTION__.13282
0x00007ffff7c3b980  __PRETTY_FUNCTION__.13406
0x00007ffff7c3bb48  __PRETTY_FUNCTION__.8287
0x00007ffff7c3bbe0  __PRETTY_FUNCTION__.8435
0x00007ffff7c3bca0  __PRETTY_FUNCTION__.10291
0x00007ffff7c3bd50  __PRETTY_FUNCTION__.10302
0x00007ffff7c3bd60  __PRETTY_FUNCTION__.10298
0x00007ffff7c3bd98  __PRETTY_FUNCTION__.10304
0x00007ffff7c3bda8  __PRETTY_FUNCTION__.10305
0x00007ffff7c3bdb8  __PRETTY_FUNCTION__.10306
0x00007ffff7c3be38  __PRETTY_FUNCTION__.9094
0x00007ffff7c3bed0  __PRETTY_FUNCTION__.9209
0x00007ffff7c3bf10  __PRETTY_FUNCTION__.10304
0x00007ffff7c3bf20  __PRETTY_FUNCTION__.10322
0x00007ffff7c3bfc8  __PRETTY_FUNCTION__.6928
0x00007ffff7c3c028  __PRETTY_FUNCTION__.9874
0x00007ffff7c3c028  __PRETTY_FUNCTION__.9879
0x00007ffff7c3c060  __PRETTY_FUNCTION__.9617
0x00007ffff7c3c070  __PRETTY_FUNCTION__.9895
0x00007ffff7c3c080  __PRETTY_FUNCTION__.9943
0x00007ffff7c3c0f8  __PRETTY_FUNCTION__.13301
0x00007ffff7c3c108  __PRETTY_FUNCTION__.13288
0x00007ffff7c3c118  __PRETTY_FUNCTION__.13486
0x00007ffff7c3c128  __PRETTY_FUNCTION__.13418
0x00007ffff7c3c138  __PRETTY_FUNCTION__.12355
0x00007ffff7c3c178  cs_path
0x00007ffff7c3c408  __PRETTY_FUNCTION__.15790
0x00007ffff7c3c418  __PRETTY_FUNCTION__.16015
0x00007ffff7c3c448  __PRETTY_FUNCTION__.12412
0x00007ffff7c3c458  __PRETTY_FUNCTION__.12509
0x00007ffff7c3c468  __PRETTY_FUNCTION__.12804
0x00007ffff7c3c478  __PRETTY_FUNCTION__.12429
0x00007ffff7c3c488  __PRETTY_FUNCTION__.12421
0x00007ffff7c3c5d8  __PRETTY_FUNCTION__.8648
0x00007ffff7c3c610  __PRETTY_FUNCTION__.9706
0x00007ffff7c3c648  __PRETTY_FUNCTION__.10160
0x00007ffff7c3c6d0  __PRETTY_FUNCTION__.11466
0x00007ffff7c3cad0  __PRETTY_FUNCTION__.9715
0x00007ffff7c3cb48  __PRETTY_FUNCTION__.6144
0x00007ffff7c3cc88  __PRETTY_FUNCTION__.13582
0x00007ffff7c3cc98  __PRETTY_FUNCTION__.13404
0x00007ffff7c3ce78  __PRETTY_FUNCTION__.12657
0x00007ffff7c3cf20  __PRETTY_FUNCTION__.4068
0x00007ffff7c3cf60  __PRETTY_FUNCTION__.7854
0x00007ffff7c3d0e8  fmt
0x00007ffff7c3d1f0  __PRETTY_FUNCTION__.9374
0x00007ffff7c3d200  __PRETTY_FUNCTION__.9386
0x00007ffff7c3d308  __PRETTY_FUNCTION__.10012
0x00007ffff7c3d450  __func__.12167
0x00007ffff7c3d4c0  __func__.12112
0x00007ffff7c3d560  __func__.15280
0x00007ffff7c3d5c8  __func__.12183
0x00007ffff7c3d728  __func__.7991
0x00007ffff7c3d738  __func__.8169
0x00007ffff7c3d748  __func__.8132
0x00007ffff7c3d758  __func__.8162
0x00007ffff7c3d7a0  __PRETTY_FUNCTION__.14411
0x00007ffff7c3d7b0  __PRETTY_FUNCTION__.14273
0x00007ffff7c3d7c0  __PRETTY_FUNCTION__.9534
0x00007ffff7c3d7d0  __PRETTY_FUNCTION__.10537
0x00007ffff7c3d7e0  __PRETTY_FUNCTION__.10565
0x00007ffff7c3d7f0  __PRETTY_FUNCTION__.10584
0x00007ffff7c3d870  __PRETTY_FUNCTION__.9114
0x00007ffff7c3d890  __PRETTY_FUNCTION__.9636
0x00007ffff7c3d8b0  __PRETTY_FUNCTION__.12693
0x00007ffff7c3d8d0  __PRETTY_FUNCTION__.8985
0x00007ffff7c3d8f0  __PRETTY_FUNCTION__.11853
0x00007ffff7c3d910  __PRETTY_FUNCTION__.11681
0x00007ffff7c3d930  __PRETTY_FUNCTION__.11493
0x00007ffff7c3d950  __PRETTY_FUNCTION__.11290
0x00007ffff7c3d970  __PRETTY_FUNCTION__.11112
0x00007ffff7c3d990  __PRETTY_FUNCTION__.10800
0x00007ffff7c3d9b0  __PRETTY_FUNCTION__.9669
0x00007ffff7c3d9d0  __PRETTY_FUNCTION__.9661
0x00007ffff7c3d9f0  __PRETTY_FUNCTION__.10245
0x00007ffff7c3da10  __PRETTY_FUNCTION__.9713
0x00007ffff7c3da30  __PRETTY_FUNCTION__.9829
0x00007ffff7c3da50  __PRETTY_FUNCTION__.9789
0x00007ffff7c3da90  errstr
0x00007ffff7c3dad0  __PRETTY_FUNCTION__.12247
0x00007ffff7c3daf0  __PRETTY_FUNCTION__.12238
0x00007ffff7c3db10  __PRETTY_FUNCTION__.12238
0x00007ffff7c3db30  __PRETTY_FUNCTION__.13068
0x00007ffff7c3db50  __PRETTY_FUNCTION__.13715
0x00007ffff7c3db50  __PRETTY_FUNCTION__.13739
0x00007ffff7c3db70  __PRETTY_FUNCTION__.13482
0x00007ffff7c3db90  __PRETTY_FUNCTION__.13902
0x00007ffff7c3dbb0  __PRETTY_FUNCTION__.11497
0x00007ffff7c3dbb0  __PRETTY_FUNCTION__.12279
0x00007ffff7c3dbc0  __PRETTY_FUNCTION__.12227
0x00007ffff7c3dbe0  __PRETTY_FUNCTION__.11551
0x00007ffff7c3dc00  __PRETTY_FUNCTION__.11516
0x00007ffff7c3dc20  __PRETTY_FUNCTION__.13392
0x00007ffff7c3dc40  __PRETTY_FUNCTION__.12733
0x00007ffff7c3dc60  __PRETTY_FUNCTION__.12796
0x00007ffff7c3dc80  __PRETTY_FUNCTION__.8634
0x00007ffff7c3dca0  __PRETTY_FUNCTION__.10221
0x00007ffff7c3dcc0  __PRETTY_FUNCTION__.12420
0x00007ffff7c3dce0  __PRETTY_FUNCTION__.12420
0x00007ffff7c3dd00  __PRETTY_FUNCTION__.12429
0x00007ffff7c3dd20  __PRETTY_FUNCTION__.13250
0x00007ffff7c3dd40  __PRETTY_FUNCTION__.6966
0x00007ffff7c3dd60  default_tzdir
0x00007ffff7c3dd80  __PRETTY_FUNCTION__.8614
0x00007ffff7c3dda0  __PRETTY_FUNCTION__.14007
0x00007ffff7c3ddc0  __PRETTY_FUNCTION__.12721
0x00007ffff7c3dde0  __PRETTY_FUNCTION__.11467
0x00007ffff7c3de00  __PRETTY_FUNCTION__.11496
0x00007ffff7c3de20  __PRETTY_FUNCTION__.9684
0x00007ffff7c3de40  __PRETTY_FUNCTION__.9905
0x00007ffff7c3de60  __PRETTY_FUNCTION__.10202
0x00007ffff7c3de80  __PRETTY_FUNCTION__.11531
0x00007ffff7c3dea0  __PRETTY_FUNCTION__.12537
0x00007ffff7c3dec0  __PRETTY_FUNCTION__.10174
0x00007ffff7c3dee0  __PRETTY_FUNCTION__.4540
0x00007ffff7c3df00  __PRETTY_FUNCTION__.4530
0x00007ffff7c3df20  __PRETTY_FUNCTION__.4521
0x00007ffff7c3df40  __PRETTY_FUNCTION__.14939
0x00007ffff7c3df60  __PRETTY_FUNCTION__.9410
0x00007ffff7c3df80  __PRETTY_FUNCTION__.10125
0x00007ffff7c3dfa0  __PRETTY_FUNCTION__.10155
0x00007ffff7c3dfc0  __PRETTY_FUNCTION__.10090
0x00007ffff7c3dfe0  __PRETTY_FUNCTION__.10035
0x00007ffff7c3e000  __PRETTY_FUNCTION__.10027
0x00007ffff7c3e020  __func__.15383
0x00007ffff7c3e030  __func__.11181
0x00007ffff7c3e040  __PRETTY_FUNCTION__.14204
0x00007ffff7c3e060  __PRETTY_FUNCTION__.10498
0x00007ffff7c3e070  __PRETTY_FUNCTION__.10544
0x00007ffff7c3e2a0  __PRETTY_FUNCTION__.12197
0x00007ffff7c3e2e0  __PRETTY_FUNCTION__.12282
0x00007ffff7c3e320  __PRETTY_FUNCTION__.12025
0x00007ffff7c3e360  __PRETTY_FUNCTION__.12110
0x00007ffff7c3e3a0  __PRETTY_FUNCTION__.11938
0x00007ffff7c3e3c0  __PRETTY_FUNCTION__.11766
0x00007ffff7c3e3e0  __PRETTY_FUNCTION__.11590
0x00007ffff7c3e400  __PRETTY_FUNCTION__.11382
0x00007ffff7c3e420  __PRETTY_FUNCTION__.11196
0x00007ffff7c3e460  __PRETTY_FUNCTION__.11026
0x00007ffff7c3e4a0  __PRETTY_FUNCTION__.10886
0x00007ffff7c3e4e0  __PRETTY_FUNCTION__.10765
0x00007ffff7c3e520  __PRETTY_FUNCTION__.10653
0x00007ffff7c3e540  __PRETTY_FUNCTION__.10533
0x00007ffff7c3e5c0  bad_key_err
0x00007ffff7c3e600  __PRETTY_FUNCTION__.13723
0x00007ffff7c3e6d0  signmask
0x00007ffff7c3e6e0  othermask
0x00007ffff7c3e950  max
0x00007ffff7c3f0e0  _sys_nerr@@GLIBC_2.12
0x00007ffff7c3f0e0  sys_nerr@@GLIBC_2.12
0x00007ffff7c3f0e4  _sys_nerr@GLIBC_2.2.5
0x00007ffff7c3f0e4  sys_nerr@GLIBC_2.2.5
0x00007ffff7c3f0e8  _sys_nerr@GLIBC_2.3
0x00007ffff7c3f0e8  sys_nerr@GLIBC_2.3
0x00007ffff7c3f0ec  _sys_nerr@GLIBC_2.4
0x00007ffff7c3f0ec  sys_nerr@GLIBC_2.4
0x00007ffff7c4034c  __GNU_EH_FRAME_HDR
0x00007ffff7c6e560  _sys_errlist@@GLIBC_2.12
0x00007ffff7c6e560  _sys_errlist@GLIBC_2.2.5
0x00007ffff7c6e560  _sys_errlist@GLIBC_2.3
0x00007ffff7c6e560  _sys_errlist@GLIBC_2.4
0x00007ffff7c6e560  sys_errlist@@GLIBC_2.12
0x00007ffff7c6e560  sys_errlist@GLIBC_2.2.5
0x00007ffff7c6e560  sys_errlist@GLIBC_2.3
0x00007ffff7c6e560  sys_errlist@GLIBC_2.4
0x00007ffff7c6e9a0  __old2_sys_siglist
0x00007ffff7c6e9a0  _old2_sys_siglist
0x00007ffff7c6e9a0  _sys_siglist
0x00007ffff7c6e9a0  _sys_siglist@@GLIBC_2.3.3
0x00007ffff7c6e9a0  _sys_siglist@GLIBC_2.2.5
0x00007ffff7c6e9a0  sys_siglist@@GLIBC_2.3.3
0x00007ffff7c6e9a0  sys_siglist@GLIBC_2.2.5
0x00007ffff7c6ebc0  __old2_sys_sigabbrev
0x00007ffff7c6ebc0  sys_sigabbrev
0x00007ffff7c6ebc0  sys_sigabbrev@@GLIBC_2.3.3
0x00007ffff7c6ebc0  sys_sigabbrev@GLIBC_2.2.5
0x00007ffff7c70000  _GLOBAL_OFFSET_TABLE_
0x00007ffff7c70260  may_shrink_heap
0x00007ffff7c70358  cached_result
0x00007ffff7c70428  num_ifs
0x00007ffff7c7042c  startport
0x00007ffff7c70434  tty_gid
0x00007ffff7c706e0  __ctype32_toupper@GLIBC_2.2.5
0x00007ffff7c706e8  __ctype32_tolower@GLIBC_2.2.5
0x00007ffff7c706f0  __ctype_toupper@GLIBC_2.2.5
0x00007ffff7c706f8  __ctype_tolower@GLIBC_2.2.5
0x00007ffff7c70700  __ctype32_b@GLIBC_2.2.5
0x00007ffff7c70708  __ctype_b@GLIBC_2.2.5
0x00007ffff7c71858  DW.ref.__gcc_personality_v0
0x00007ffff7c71a18  modcounter
0x00007ffff7c71a1c  lock
0x00007ffff7c71b80  result
0x00007ffff7c71c18  output_charset_cache
0x00007ffff7c71c20  output_charset_cached
0x00007ffff7c71c28  freemem_size
0x00007ffff7c71c30  freemem
0x00007ffff7c71c38  lock
0x00007ffff7c71ca0  lock
0x00007ffff7c71ce0  lock
0x00007ffff7c71cf0  locale_alias_path
0x00007ffff7c71d48  phys_pages
0x00007ffff7c71d50  pagesize
0x00007ffff7c725b8  state
0x00007ffff7c72738  sysconf_symloop_max
0x00007ffff7c72740  result
0x00007ffff7c72760  nore
0x00007ffff7c727a0  noexpr
0x00007ffff7c727c0  yesre
0x00007ffff7c72800  yesexpr
0x00007ffff7c72808  once
0x00007ffff7c72818  name
0x00007ffff7c72858  value
0x00007ffff7c728f0  __malloc_initialize_hook@GLIBC_2.2.5
0x00007ffff7c728f8  next_to_use
0x00007ffff7c72900  narenas_limit
0x00007ffff7c72980  added_atexit_handler
0x00007ffff7c729b8  _obstack@GLIBC_2.2.5
0x00007ffff7c729c0  already_called
0x00007ffff7c729e0  once
0x00007ffff7c72a68  olds
0x00007ffff7c72a80  state
0x00007ffff7c72aa0  rdata
0x00007ffff7c72ad0  init
0x00007ffff7c72bac  is_initialized
0x00007ffff7c72c90  gmtime_offset
0x00007ffff7c72ca0  tmbuf
0x00007ffff7c72ce0  resbuf
0x00007ffff7c72d00  buffer_size
0x00007ffff7c72d20  buffer_size
0x00007ffff7c72d40  resbuf
0x00007ffff7c72d80  resbuf
0x00007ffff7c72da0  buffer_size
0x00007ffff7c72dc0  resbuf
0x00007ffff7c72de0  buffer_size
0x00007ffff7c72e10  start_fct
0x00007ffff7c72e18  startp
0x00007ffff7c72e20  startp_initialized
0x00007ffff7c72e28  start_fct.12552
0x00007ffff7c72e30  startp.12551
0x00007ffff7c72e38  startp_initialized.12550
0x00007ffff7c72e40  resbuf
0x00007ffff7c72e70  buffer_size
0x00007ffff7c72e80  buffer_size
0x00007ffff7c72ea0  resbuf
0x00007ffff7c72ee0  resbuf
0x00007ffff7c72f10  buffer_size
0x00007ffff7c72f20  resbuf.10754
0x00007ffff7c72f50  buffer_size.10753
0x00007ffff7c72f80  start_fct
0x00007ffff7c72f88  startp
0x00007ffff7c72f90  startp_initialized
0x00007ffff7c72f98  start_fct.12548
0x00007ffff7c72fa0  startp.12547
0x00007ffff7c72fa8  startp_initialized.12546
0x00007ffff7c73040  lock
0x00007ffff7c73044  once
0x00007ffff7c73088  namelen
0x00007ffff7c73090  buflen
0x00007ffff7c73098  tiocgsid_does_not_work
0x00007ffff7c73140  m
0x00007ffff7c73168  once
0x00007ffff7c73180  tty
0x00007ffff7c731c0  line
0x00007ffff7c73278  bufsize
0x00007ffff7c73280  buf
0x00007ffff7c73400  old_file_name
0x00007ffff7c73408  old_line_number
0x00007ffff7c73410  timestamp
0x00007ffff7c73418  locs@GLIBC_2.2.5
0x00007ffff7c73420  loc2@GLIBC_2.2.5
0x00007ffff7c73428  loc1@GLIBC_2.2.5
0x00007ffff7c73430  last_type
0x00007ffff7c73434  last_family
0x00007ffff7c73440  oact
0x00007ffff7c734e0  otimer
0x00007ffff7c73600  buffer_size
0x00007ffff7c73620  resbuf
0x00007ffff7c73680  resbuf
0x00007ffff7c736c8  buffer_size
0x00007ffff7c736e0  resbuf
0x00007ffff7c73728  buffer_size
0x00007ffff7c73730  buffer
0x00007ffff7c73740  resbuf
0x00007ffff7c73788  buffer_size
0x00007ffff7c737b8  start_fct
0x00007ffff7c737c0  startp
0x00007ffff7c737c8  startp_initialized
0x00007ffff7c737e0  buffer_size
0x00007ffff7c73800  resbuf
0x00007ffff7c73840  resbuf
0x00007ffff7c73860  buffer_size
0x00007ffff7c73880  resbuf
0x00007ffff7c738a0  buffer_size
0x00007ffff7c738a8  buffer
0x00007ffff7c738c0  resbuf
0x00007ffff7c738e0  buffer_size
0x00007ffff7c73910  start_fct
0x00007ffff7c73918  startp
0x00007ffff7c73920  startp_initialized
0x00007ffff7c73f78  result
0x00007ffff7c73f80  once
0x00007ffff7c73fc0  resbuf
0x00007ffff7c73fe0  buffer_size
0x00007ffff7c73ff0  start_fct
0x00007ffff7c73ff8  startp
0x00007ffff7c74000  startp_initialized
0x00007ffff7c74020  resbuf
0x00007ffff7c74040  buffer_size
0x00007ffff7c74060  resbuf
0x00007ffff7c74080  buffer_size
0x00007ffff7c74090  start_fct
0x00007ffff7c74098  startp
0x00007ffff7c740a0  startp_initialized
0x00007ffff7c740a8  start_fct
0x00007ffff7c740b0  startp
0x00007ffff7c740b8  startp_initialized
0x00007ffff7c740c0  buffer_size
0x00007ffff7c740e0  resbuf
0x00007ffff7c74130  resbuf
0x00007ffff7c74148  buffer_size
0x00007ffff7c74158  start_fct
0x00007ffff7c74160  startp
0x00007ffff7c74168  startp_initialized
0x00007ffff7c74170  resbuf
0x00007ffff7c74188  buffer_size
0x00007ffff7c741a0  buffer_size.11919
0x00007ffff7c741b0  resbuf.11923
0x00007ffff7c741f0  start_fct
0x00007ffff7c741f8  startp
0x00007ffff7c74200  startp_initialized
0x00007ffff7c74210  resbuf
0x00007ffff7c74228  buffer_size
0x00007ffff7c74238  start_fct
0x00007ffff7c74240  startp
0x00007ffff7c74248  startp_initialized
0x00007ffff7c74250  buffer_size
0x00007ffff7c74260  resbuf
0x00007ffff7c742a0  resbuf.11975
0x00007ffff7c742b8  buffer_size.11974
0x00007ffff7c742c8  start_fct.12002
0x00007ffff7c742d0  startp.12001
0x00007ffff7c742d8  startp_initialized.12000
0x00007ffff7c742e0  resbuf
0x00007ffff7c74300  buffer_size
0x00007ffff7c74310  start_fct
0x00007ffff7c74318  startp
0x00007ffff7c74320  startp_initialized
0x00007ffff7c74340  resbuf.11978
0x00007ffff7c74360  buffer_size.11977
0x00007ffff7c74370  start_fct.12550
0x00007ffff7c74378  startp.12549
0x00007ffff7c74380  startp_initialized.12548
0x00007ffff7c743a0  buffer_size.11917
0x00007ffff7c743c0  resbuf.11921
0x00007ffff7c74408  result
0x00007ffff7c74410  start_fct
0x00007ffff7c74418  startp
0x00007ffff7c74420  asc
0x00007ffff7c74438  start_fct.10683
0x00007ffff7c74440  startp.10682
0x00007ffff7c744e0  startp
0x00007ffff7c744e8  startp_initialized
0x00007ffff7c7455c  once
0x00007ffff7c74580  buffer_size
0x00007ffff7c745a0  resbuf
0x00007ffff7c745e0  resbuf
0x00007ffff7c74600  buffer_size
0x00007ffff7c74610  start_fct
0x00007ffff7c74618  startp
0x00007ffff7c74620  startp_initialized
0x00007ffff7c74624  lock
0x00007ffff7c74628  not_first
0x00007ffff7c74630  functions
0x00007ffff7c74660  tmpbuf
0x00007ffff7c748e0  lock
0x00007ffff7c748e4  once
0x00007ffff7c74900  _res@GLIBC_2.2.5
0x00007ffff7c74bc0  default_table
0x00007ffff7c74c80  port
0x00007ffff7c74c9c  size
0x00007ffff7c74d78  start_fct
0x00007ffff7c74d80  startp
0x00007ffff7c74d88  start_fct
0x00007ffff7c74d90  startp
0x00007ffff7c74da0  svcauthdes_stats@GLIBC_2.2.5
0x00007ffff7c74dc0  buffer_size
0x00007ffff7c74dd0  resbuf
0x00007ffff7c74df0  resbuf
0x00007ffff7c74e08  buffer_size
0x00007ffff7c74e20  resbuf.10665
0x00007ffff7c74e38  buffer_size.10664
0x00007ffff7c74e68  start_fct
0x00007ffff7c74e70  startp
0x00007ffff7c74e78  startp_initialized
0x00007ffff7c74e80  start_fct.10692
0x00007ffff7c74e88  startp.10691
0x00007ffff7c74e90  startp_initialized.10690
0x00007ffff7c74ea0  cm
0x00007ffff7c74f18  start_fct
0x00007ffff7c74f20  startp
0x00007ffff7c74f40  once
0x00007ffff7c75068  crud
0x00007ffff7c7526c  devpts_mounted
0x00007ffff7c75270  have_no_dev_ptmx
0x00007ffff7c6e9a0  _sys_siglist
0x00007ffff7c6ebc0  sys_sigabbrev
0x00007ffff7c729b8  _obstack
(gdb) l
Line number 49 out of range; hello.cc has 48 lines.
(gdb) s
sayHello (name=0x7fffffffde80 "Bart SimpsonUU") at hello.cc:29
29	  std::cout << "Hello " << name << std::endl;
(gdb) s
Hello Bart SimpsonUU
30	}
(gdb) s
main (argc=3, argv=0x7fffffffdfd8) at hello.cc:41
41	    for (int i = 1; i <= argc; i++) {
(gdb) l
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
41	    for (int i = 1; i <= argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
(gdb) p i
$8 = 1
(gdb) quit
A debugging session is active.

	Inferior 1 [process 3588479] will be killed.

Quit anyway? (y or n) EOF [assumed Y]
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ nano hello.cc 
[?1049h[22;0;0t[1;24r(B[m[4l[?7h[39;49m[?1h=[?1h=[?1h=[?25l[39;49m(B[m[H[2J[22;33H(B[0;7m[ Reading File ](B[m[22;32H(B[0;7m[ Read 48 lines ](B[m[H(B[0;7m  GNU nano 3.2                        hello.cc                                  [1;79H(B[m[23d(B[0;7m^G(B[m Get Help  (B[0;7m^O(B[m Write Out (B[0;7m^W(B[m Where Is  (B[0;7m^K(B[m Cut Text  (B[0;7m^J(B[m Justify   (B[0;7m^C(B[m Cur Pos[24d(B[0;7m^X(B[m Exit[14G(B[0;7m^R(B[m Read File (B[0;7m^\(B[m Replace   (B[0;7m^U(B[m Uncut Text(B[0;7m^T(B[m To Spell  (B[0;7m^_(B[m Go To Line[22d[3d(B[0;1m[36m#include[39m(B[m (B[0;1m[33m<locale>[4d[36m#include[39m(B[m (B[0;1m[33m<iostream>[5d[36m#include[39m(B[m (B[0;1m[33m<cstdlib>[6d[36m#include[39m(B[m (B[0;1m[33m<cstring>[8d[34m/** Upcase the initial letter of each word from in, copying the[9d *  results into out.  The caller is responsible to ensure that out[10d *  has enough space for the strlen(in) characters of in.[11d */[12d(B[0m[32mvoid[13d[39m(B[mupcaseWords([32mconst[39m(B[m [32mchar[39m(B[m in[], [32mchar[39m(B[m out[])[14d{[15d [32mbool[39m(B[m inWord = false;[16;3H[32mconst[39m(B[m [32mint[39m(B[m n = std::strlen(in);[17;3H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 0; i < n; i++) {[18;5H(B[0;1m[33mif[39m(B[m (!inWord && std::isalpha(in[i])) {[19;7Hout[i] = std::toupper(in[i]);[20;5H}[21d(B[0;1m[33melse[39m(B[m {[3d[?12l[?25h[?25l[4d[?12l[?25h[?25l[5d[?12l[?25h[?25l[6d[?12l[?25h[?25l[7d[?12l[?25h[?25l[8d[?12l[?25h[?25l[9d[?12l[?25h[?25l[10d[?12l[?25h[?25l[11d[?12l[?25h[?25l[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20d[?12l[?25h[?25l[21d[?12l[?25h[?25l7[2;21r8[10S[1;24r[2;1H[K[12;7Hout[i] = in[i];[13;5H}[14dinWord = std::isalpha(in[i]);[15;3H}[16d}[18d[32mstatic[39m(B[m [32mvoid[19d[39m(B[msayHello([32mconst[39m(B[m [32mchar[39m(B[m *name)[20d{[21d std::cout << (B[0;1m[33m"Hello "[39m(B[m << name << std::endl;[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[22d[K[19d[?12l[?25h[?25l[20d[?12l[?25h[?25l[21d[?12l[?25h[?25l7[2;22r8[22d[10S[1;24r[2;1H[K[12d}[15d[32mint[16d[39m(B[mmain([32mint[39m(B[m argc, [32mconst[39m(B[m [32mchar[39m(B[m *argv[])[17d{[18d (B[0;1m[33mif[39m(B[m (argc == 1) {[19;5Hstd::cerr << (B[0;1m[33m"usage: "[39m(B[m << argv[0] << (B[0;1m[33m" NAME..."[39m(B[m << std::endl;[20;5Hstd::exit(1);[21;3H}[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20d[?12l[?25h[?25l[2;22r[22;1H[10S[1;24r[2;1H[K[12d  (B[0;1m[33melse[39m(B[m {[13;5H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 1; i <= argc; i++) {[14;7H[32mconst[39m(B[m [32mchar[39m(B[m *name = argv[i];[15;7H[32mchar[39m(B[m friendlyName[strlen(name)+1];[16;7HupcaseWords(name, friendlyName);[17;7HsayHello(friendlyName);[18;5H}[19;3H}[20d}[12d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[18d[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l  [?12l[?25h[?25l[10G[?12l[?25h[?25l[C[?12l[?25h[?25l[13G[?12l[?25h[?25l[14;26H[?12l[?25h[?25l[A[?12l[?25h[?25l[?12l[?25h[?25l[1;71H(B[0;7mModified(B[m[13;24H[1P[?12l[?25h[?25l[23;14H       (B[0;7mM-D(B[m DOS Format      (B[0;7mM-A(B[m Append          (B[0;7mM-B(B[m Backup File[24;2H(B[0;7mC(B[m Cancel           (B[0;7mM-M(B[m Mac Format      (B[0;7mM-P(B[m Prepend         (B[0;7m^T(B[m To Files[K[22d(B[0;7mFile Name to Write: hello.cc                                                    [22;1H(B[m[22;29H[?12l[?25h[?25l[K[1;79H[1;71H(B[0;7m        (B[m[22;32H(B[0;7m[ Wrote 48 lines ](B[m[23;14H(B[0;7m^O(B[m Write Out (B[0;7m^W(B[m Where Is  (B[0;7m^K(B[m Cut Text  (B[0;7m^J(B[m Justify   (B[0;7m^C(B[m Cur Pos[24;2H(B[0;7mX(B[m Exit      (B[0;7m^R(B[m Read File (B[0;7m^\(B[m Replace   (B[0;7m^U(B[m Uncut Text(B[0;7m^T(B[m To Spell  (B[0;7m^_(B[m Go To Line[22d[13;24H[?12l[?25h[?25l[22d[J[24;80H[?12l[?25h[24;1H[?1049l[23;0;0t[?1l>]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ ./hello ''b'a'r't' 's' [A]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ [C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ci'm'p's'o'n'[C ''l'i's'a' 's'i'm'p's'o'n'
Hello Bart SimpsonïU
Hello Lisa SimpsonïU
Segmentation fault
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ ./hello 'bart simpson' 'lisa simpson'[A]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ [2Pnano hello.cc 
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[4Pgdb hello[C
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) stat[Krt ''b'a'r't' 's'i'm'p's'o'n' '[1P'[C ''l'i's'a' 's'i'm'p's'o'n'
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/2-hello/hello 'bart simpson' 'lisa simpson'

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffdfd8) at hello.cc:36
warning: Source file is more recent than executable.
36	  if (argc == 1) {
(gdb) l
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
(gdb) help l
List specified function or line.
With no argument, lists ten more lines after or around previous listing.
"list -" lists the ten lines before a previous ten-line listing.
One argument specifies a line, and ten lines are listed around that line.
Two arguments with comma between specify starting and ending lines to list.
Lines can be specified in these ways:
  LINENUM, to list around that line in current file,
  FILE:LINENUM, to list around that line in that file,
  FUNCTION, to list around beginning of that function,
  FILE:FUNCTION, to distinguish among like-named static functions.
  *ADDRESS, to list around the line containing that address.
With two args, if one is empty, it stands for ten lines away from
the other arg.

By default, when a single location is given, display ten lines.
This can be changed using "set listsize", and the current value
can be shown using "show listsize".
(gdb) l
41	    for (int i = 1; i < argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) l-
Undefined command: "l-".  Try "help".
(gdb) l -
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
(gdb) l
41	    for (int i = 1; i < argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) hep[Klp status
Status inquiries.

List of commands:

info -- Generic command for showing things about the program being debugged
info address -- Describe where symbol SYM is stored
info all-registers -- List of all registers and their contents
info args -- Argument variables of current stack frame
info auto-load -- Print current status of auto-loaded files
info auto-load gdb-scripts -- Print the list of automatically loaded sequences of commands
info auto-load libthread-db -- Print the list of loaded inferior specific libthread_db
info auto-load local-gdbinit -- Print whether current directory .gdbinit file has been loaded
info auto-load python-scripts -- Print the list of automatically loaded Python scripts
info auxv -- Display the inferior's auxiliary vector
info bookmarks -- Status of user-settable bookmarks
info breakpoints -- Status of specified breakpoints (all user-settable breakpoints if no argument)
info checkpoints -- IDs of currently known checkpoints
info classes -- All Objective-C classes
--Type <RET> for more, q to quit, c to continue without paging--[K--Type <RET> for more, q to quit, c to continue without paging--
info common -- Print out the values contained in a Fortran COMMON block
info copying -- Conditions for redistributing copies of GDB
info dcache -- Print information on the dcache performance
info display -- Expressions to display when program stops
info exceptions -- List all Ada exception names
info extensions -- All filename extensions associated with a source language
info files -- Names of targets and files being debugged
info float -- Print the status of the floating point unit
info frame -- All about selected stack frame
info frame-filter -- List all registered Python frame-filters
info functions -- All function names
info guile -- Prefix command for Guile info displays
info handle -- What debugger does when program gets various signals
info inferiors -- Print a list of inferiors being managed
info line -- Core addresses of the code for a source line
info locals -- Local variables of current stack frame
info macro -- Show the definition of MACRO
info macros -- Show the definitions of all macros at LINESPEC
info mem -- Memory region attributes
info os -- Show OS data ARG
info pretty-printer -- GDB command to list all registered pretty-printers
info probes -- Show available static probes
info probes all -- Show information about all type of probes
info probes dtrace -- Show information about DTrace static probes
info probes stap -- Show information about SystemTap static probes
info proc -- Show /proc process information about any running process
info proc all -- List all available /proc info
info proc cmdline -- List command line arguments of the process
info proc cwd -- List current working directory of the process
info proc exe -- List absolute filename for executable of the process
info proc mappings -- List of mapped memory regions
info proc stat -- List process info from /proc/PID/stat
info proc status -- List process info from /proc/PID/status
info program -- Execution status of the program
info record -- Info record options
info registers -- List of integer registers and their contents
info scope -- List the variables local to a scope
info selectors -- All Objective-C selectors
--Type <RET> for more, q to quit, c to continue without paging--
info set -- Show all GDB settings
info sharedlibrary -- Status of loaded shared object libraries
info signals -- What debugger does when program gets various signals
info skip -- Display the status of skips
info source -- Information about the current source file
info sources -- Source files in the program
info stack -- Backtrace of the stack
info static-tracepoint-markers -- List target static tracepoints markers
info symbol -- Describe what symbol is at location ADDR
info target -- Names of targets and files being debugged
info tasks -- Provide information about all known Ada tasks
info terminal -- Print inferior's saved terminal status
info threads -- Display currently known threads
info tracepoints -- Status of specified tracepoints (all tracepoints if no argument)
info tvariables -- Status of trace state variables and their values
info type-printers -- GDB command to list all registered type-printers
info types -- All type names
info unwinder -- GDB command to list unwinders
info variables -- All global and static variable names
info vector -- Print the status of the vector unit
info vtbl -- Show the virtual function table for a C++ object
info warranty -- Various kinds of warranty you do not have
info watchpoints -- Status of specified watchpoints (all watchpoints if no argument)
info win -- List of all displayed windows
info xmethod -- GDB command to list registered xmethod matchers
macro -- Prefix for commands dealing with C preprocessor macros
macro define -- Define a new C/C++ preprocessor macro
macro expand -- Fully expand any C/C++ preprocessor macro invocations in EXPRESSION
macro expand-once -- Expand C/C++ preprocessor macro invocations appearing directly in EXPRESSION
macro list -- List all the macros defined using the `macro define' command
macro undef -- Remove the definition of the C/C++ preprocessor macro with the given name
show -- Generic command for showing things about the debugger
show ada -- Generic command for showing Ada-specific settings
show ada print-signatures -- Show whether the output of formal and return types for functions in the overloads selection menu is activated
show ada trust-PAD-over-XVS -- Show whether an optimization trusting PAD types over XVS types is activated
show agent -- Show debugger's willingness to use agent as a helper
show annotate -- Show annotation_level
show architecture -- Show architecture of target
--Type <RET> for more, q to quit, c to continue without paging--q
Quit
(gdb) l
Line number 49 out of range; hello.cc has 48 lines.
(gdb) l -
39	  }
40	  else {
41	    for (int i = 1; i < argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) n
41	    for (int i = 1; i < argc; i++) {
(gdb) p i
$1 = 21845
(gdb) n
46	    }
(gdb) n
42	      const char *name = argv[i];
(gdb) p i
$2 = 1
(gdb) p i
$3 = 1
(gdb) p i
$4 = 1
(gdb) p argc
$5 = 3
(gdb) n
43	      char friendlyName[strlen(name)+1];
(gdb) n
44	      upcaseWords(name, friendlyName);
(gdb) 
45	      sayHello(friendlyName);
(gdb) p i
$6 = 1
(gdb) 
$7 = 1
(gdb) 
$8 = 1
(gdb) 
$9 = 1
(gdb) 
$10 = 1
(gdb) n
Hello Bart SimpsonUU
41	    for (int i = 1; i < argc; i++) {
(gdb) p i
$11 = 1
(gdb) 
$12 = 1
(gdb) p i
$13 = 1
(gdb) n
46	    }
(gdb) o[Kp i
$14 = 2
(gdb) n
42	      const char *name = argv[i];
(gdb) l
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
41	    for (int i = 1; i < argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
(gdb) l - [K
27	sayHello(const char *name)
28	{
29	  std::cout << "Hello " << name << std::endl;
30	}
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
(gdb) l
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
41	    for (int i = 1; i < argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
(gdb) p *name
$15 = 98 'b'
(gdb) n
43	      char friendlyName[strlen(name)+1];
(gdb) n[Knp *name
$16 = 108 'l'
(gdb) n
44	      upcaseWords(name, friendlyName);
(gdb) p *friendlyname@10
No symbol "friendlyname" in current context.
(gdb) n[Kp *friendlyname@10[C[C[C[C[C[Cn[Kp *friendlyname@10[1Pame@10Name@10
$17 = "Bart Sim}S"
(gdb) p *name@10
$18 = "lisa simps"
(gdb) p *name@10[K5
$19 = "lisa simpson\000SH"
(gdb) p *name@150friendlyName@10[K5
$20 = "Bart Sim}SUUUU"
(gdb) p *friendlyName@15[K20
$21 = "Bart Sim}SUUUU\000\000\330\337\377\377\377\177\000\000\377\377\000\000\003\000\000\000\200\336\377\377\377\177\000\000\f\000\000\000\000\000\000\000\323\342\377\377\377\177\000\000\265TUU\002\000\000\000\060E\376\367\377\177\000\000\000\000\000\000\000\000\000\000\300PUUUU\000\000\320\337\377\377\377\177", '\000' <repeats 18 times>, "pTUUUU\000"
(gdb) l
39	  }
40	  else {
41	    for (int i = 1; i < argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) n
45	      sayHello(friendlyName);
(gdb) prever[K[K[K[K[K[Kreverse-next
Target native does not support this command.
(gdb) q
A debugging session is active.

	Inferior 1 [process 3589118] will be killed.

Quit anyway? (y or n) u
Please answer y or n.
A debugging session is active.

	Inferior 1 [process 3589118] will be killed.

Quit anyway? (y or n) y
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ gdb hello ./hello 'bart simpson' 'lisa simpson'gdb hello [K
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start ''b'a'r't' 's'i'm'p's'o'n'[C ''l'i's'a' 's'i'm'p's'o'n'
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/2-hello/hello 'bart simpson' 'lisa simpson'

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffdfd8) at hello.cc:36
warning: Source file is more recent than executable.
36	  if (argc == 1) {
(gdb) l
31	
32	
33	int
34	main(int argc, const char *argv[])
35	{
36	  if (argc == 1) {
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
38	    std::exit(1);
39	  }
40	  else {
(gdb) l
41	    for (int i = 1; i < argc; i++) {
42	      const char *name = argv[i];
43	      char friendlyName[strlen(name)+1];
44	      upcaseWords(name, friendlyName);
45	      sayHello(friendlyName);
46	    }
47	  }
48	}
(gdb) b upCAs[K[K[KcaseWords
Breakpoint 2 at 0x5555555551b5: file hello.cc, line 13.
(gdb) c
Continuing.

Breakpoint 2, upcaseWords (in=0x7fffffffe2c5 "bart simpson", out=0x7fffffffde80 "") at hello.cc:13
13	  bool inWord = false;
(gdb) backtrace
#0  upcaseWords (in=0x7fffffffe2c5 "bart simpson", out=0x7fffffffde80 "") at hello.cc:13
#1  0x00005555555553e3 in main (argc=3, argv=0x7fffffffdfd8) at hello.cc:44
(gdb) l
8	 *  has enough space for the strlen(in) characters of in.
9	 */
10	void
11	upcaseWords(const char in[], char out[])
12	{
13	  bool inWord = false;
14	  const int n = std::strlen(in);
15	  for (int i = 0; i < n; i++) {
16	    if (!inWord && std::isalpha(in[i])) {
17	      out[i] = std::toupper(in[i]);
(gdb) l
18	    }
19	    else {
20	      out[i] = in[i];
21	    }
22	    inWord = std::isalpha(in[i]);
23	  }
24	}
25	
26	static void
27	sayHello(const char *name)
(gdb) q
A debugging session is active.

	Inferior 1 [process 3590885] will be killed.

Quit anyway? (y or n) y
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ nano hello.cc 
[?1049h[22;0;0t[1;39r(B[m[4l[?7h[39;49m[?1h=[?1h=[?1h=[?25l[39;49m(B[m[H[2J[37;77H(B[0;7m[ Reading File ](B[m[37;83H(B[0;7m 48 lines ](B[m[H(B[0;7m  GNU nano 3.2                                                                    hello.cc                                                                               [1;168H(B[m[38d(B[0;7m^G(B[m Get Help     (B[0;7m^O(B[m Write Out    (B[0;7m^W(B[m Where Is     (B[0;7m^K(B[m Cut Text     (B[0;7m^J(B[m Justify[81G(B[0;7m^C(B[m Cur Pos[97G(B[0;7mM-U(B[m Undo[38;113H(B[0;7mM-A(B[m Mark Text   (B[0;7mM-](B[m To Bracket  (B[0;7mM-Q(B[m Previous[39d(B[0;7m^X(B[m Exit[39;17H(B[0;7m^R(B[m Read File    (B[0;7m^\(B[m Replace[49G(B[0;7m^U(B[m Uncut Text   (B[0;7m^T(B[m To Spell     (B[0;7m^_(B[m Go To Line   (B[0;7mM-E(B[m Redo[39;113H(B[0;7mM-6(B[m Copy Text   (B[0;7m^Q(B[m Where Was    (B[0;7mM-W(B[m Next[37d[3d(B[0;1m[36m#include[39m(B[m (B[0;1m[33m<locale>[4d[36m#include[39m(B[m (B[0;1m[33m<iostream>[5d[36m#include[39m(B[m (B[0;1m[33m<cstdlib>[6d[36m#include[39m(B[m (B[0;1m[33m<cstring>[8d[34m/** Upcase the initial letter of each word from in, copying the[9d *  results into out.  The caller is responsible to ensure that out[10d *  has enough space for the strlen(in) characters of in.[11d */[12d(B[0m[32mvoid[13d[39m(B[mupcaseWords([32mconst[39m(B[m [32mchar[39m(B[m in[], [32mchar[39m(B[m out[])[14d{[15d [32mbool[39m(B[m inWord = false;[16;3H[32mconst[39m(B[m [32mint[39m(B[m n = std::strlen(in);[17;3H(B[0;1m[33mfor[39m(B[m ([32mint[39m(B[m i = 0; i < n; i++) {[18;5H(B[0;1m[33mif[39m(B[m (!inWord && std::isalpha(in[i])) {[19;7Hout[i] = std::toupper(in[i]);[20;5H}[21d(B[0;1m[33melse[39m(B[m {[22;7Hout[i] = in[i];[23;5H}[24dinWord = std::isalpha(in[i]);[25;3H}[26d}[28d[32mstatic[39m(B[m [32mvoid[29d[39m(B[msayHello([32mconst[39m(B[m [32mchar[39m(B[m *name)[30d{[31d std::cout << (B[0;1m[33m"Hello "[39m(B[m << name << std::endl;[32d}[35d[32mint[36d[39m(B[mmain([32mint[39m(B[m argc, [32mconst[39m(B[m [32mchar[39m(B[m *argv[])[3d[?12l[?25h[?25l[4d[?12l[?25h[?25l[5d[?12l[?25h[?25l[6d[?12l[?25h[?25l[7d[?12l[?25h[?25l[8d[?12l[?25h[?25l[9d[?12l[?25h[?25l[10d[?12l[?25h[?25l[11d[?12l[?25h[?25l[12d[?12l[?25h[?25l[13d[?12l[?25h[?25l[14d[?12l[?25h[?25l[15d[?12l[?25h[?25l[16d[?12l[?25h[?25l[17d[?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20d[?12l[?25h[?25l[21d[?12l[?25h[?25l[22d[?12l[?25h[?25l[23d[?12l[?25h[?25l[24d[?12l[?25h[?25l[25d[?12l[?25h[?25l[26d[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[37d[K[23d[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l[A[?12l[?25h[?25l [?12l[?25h[?25l [?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l [?12l[?25h[?25l([?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l[C[?12l[?25h[?25l [?12l[?25h[?25l[18d[?12l[?25h[?25l[19d[?12l[?25h[?25l[20;6H[?12l[?25h[?25l[21;11H[?12l[?25h[?25l[22di[?12l[?25h[?25l[23;6H[?12l[?25h[?25l[24;12H[?12l[?25h[?25l[25;4H[?12l[?25h[?25l[1;160H(B[0;7mModified(B[m[26;36r[26;1HM[1;39r[26;1H[?12l[?25h[?25l[8G[42m[1K [49m(B[m[?12l[?25h[?25l[K[?12l[?25h[?25l[42m [49m(B[m[?12l[?25h[?25l[42m [49m(B[m[?12l[?25h[?25l  o[?12l[?25h[?25lu[?12l[?25h[?25lt[?12l[?25h[?25l[[?12l[?25h[?25l][?12l[?25h[?25l[?12l[?25h[?25ln][?12l[?25h[?25l][?12l[?25h[?25l=[?12l[?25h[?25l'[?12l[?25h[?25l'[?12l[?25h[?25l[?12l[?25h[?25l\'[?12l[?25h[?25l(B[0;1m[35m'\0'[39m(B[m[?12l[?25h[?25l[38;17H[26X[38;43H(B[0;7mM-D(B[m DOS Format[18X[38;81H    (B[0;7mM-A(B[m Append          [38;113H[14X[38;127H(B[0;7mM-B(B[m Backup File[K[39;2H(B[0;7mC(B[m Cancel[17G[26X[39;43H(B[0;7mM-M(B[m Mac Format[28X[39;85H(B[0;7mM-P(B[m Prepend         [39;113H[14X[39;127H(B[0;7m^T(B[m To Files[K[37d(B[0;7mFile Name to Write: hello.cc                                                                                                                                             [37;1H(B[m[37;29H[?12l[?25h[?25l[K[1;168H[1;160H(B[0;7m        (B[m[37;76H(B[0;7m[ Wrote 49 lines ](B[m[38;17H(B[0;7m^O(B[m Write Out    (B[0;7m^W(B[m Where Is     (B[0;7m^K(B[m Cut Text     (B[0;7m^J(B[m Justify[81G(B[0;7m^C(B[m Cur Pos      (B[0;7mM-U(B[m Undo[38;113H(B[0;7mM-A(B[m Mark Text   (B[0;7mM-](B[m To Bracket  (B[0;7mM-Q(B[m Previous[39;2H(B[0;7mX(B[m Exit  [17G(B[0;7m^R(B[m Read File    (B[0;7m^\(B[m Replace      (B[0;7m^U(B[m Uncut Text   (B[0;7m^T(B[m To Spell     (B[0;7m^_(B[m Go To Line   (B[0;7mM-E(B[m Redo[39;113H(B[0;7mM-6(B[m Copy Text   (B[0;7m^Q(B[m Where Was    (B[0;7mM-W(B[m Next[37d[26;13H[?12l[?25h[?25l[C[?12l[?25h[?25l[1;160H(B[0;7mModified(B[m[26;14H;[?12l[?25h[?25l[38;17H[26X[38;43H(B[0;7mM-D(B[m DOS Format[18X[38;81H    (B[0;7mM-A(B[m Append          [38;113H[14X[38;127H(B[0;7mM-B(B[m Backup File[K[39;2H(B[0;7mC(B[m Cancel[17G[26X[39;43H(B[0;7mM-M(B[m Mac Format[28X[39;85H(B[0;7mM-P(B[m Prepend         [39;113H[14X[39;127H(B[0;7m^T(B[m To Files[K[37d(B[0;7mFile Name to Write: hello.cc                                                                                                                                             [37;1H(B[m[37;29H[?12l[?25h[?25l[K[1;168H[1;160H(B[0;7m        (B[m[37;76H(B[0;7m[ Wrote 49 lines ](B[m[38;17H(B[0;7m^O(B[m Write Out    (B[0;7m^W(B[m Where Is     (B[0;7m^K(B[m Cut Text     (B[0;7m^J(B[m Justify[81G(B[0;7m^C(B[m Cur Pos      (B[0;7mM-U(B[m Undo[38;113H(B[0;7mM-A(B[m Mark Text   (B[0;7mM-](B[m To Bracket  (B[0;7mM-Q(B[m Previous[39;2H(B[0;7mX(B[m Exit  [17G(B[0;7m^R(B[m Read File    (B[0;7m^\(B[m Replace      (B[0;7m^U(B[m Uncut Text   (B[0;7m^T(B[m To Spell     (B[0;7m^_(B[m Go To Line   (B[0;7mM-E(B[m Redo[39;113H(B[0;7mM-6(B[m Copy Text   (B[0;7m^Q(B[m Where Was    (B[0;7mM-W(B[m Next[37d[26;15H[?12l[?25h[?25l[37d[J[39;169H[?12l[?25h[39;1H[?1049l[23;0;0t[?1l>]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ makenano hello.cc [4Pgdb hello[C./hello 'bart simpson' 'lisa simpson'[23Pnano hello.cc ./hello 'bart simpson' 'lisa simpson'
Hello Bart Simpson
Hello Lisa Simpson
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/2-hello[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/2-hello[01;31m (master)[00m$ cd ./[K[K../3-overload/
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/3-overload[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/3-overload[01;31m (master)[00m$ clear
[H[2J[3J]0;aservet1@remote04: ~/i240a/work/lab2/exercises/3-overload[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/3-overload[01;31m (master)[00m$ ls
Makefile  overload.cc
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/3-overload[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/3-overload[01;31m (master)[00m$ mae[K[K[Kmake \[K[K; ./overlia[K[Koad
g++ -g -Wall -std=c++17    overload.cc   -o overload
f(a) = 3; f(&a) = 4; f(a, b) = -1
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/3-overload[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/3-overload[01;31m (master)[00m$ clear
[H[2J[3J]0;aservet1@remote04: ~/i240a/work/lab2/exercises/3-overload[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/3-overload[01;31m (master)[00m$ ./overload 
f(a) = 3; f(&a) = 4; f(a, b) = -1
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/3-overload[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/3-overload[01;31m (master)[00m$ gdb overload 
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from overload...done.
(gdb) b f(int
f(int)       f(int*)      f(int, int)  
(gdb) b f(int*) 
Breakpoint 1 at 0x117d: file overload.cc, line 3.
(gdb) r
Starting program: /import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffdef8) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) p a
$1 = (int *) 0x7fffffffdef8
(gdb) p *a
$2 = 2
(gdb) p *a=5
$3 = 5
(gdb) p *a
$4 = 5
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffdef8) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) n
main () at overload.cc:15
15	    << std::endl;
(gdb) n
f(a) = 3; f(&a) = 4; f(a, b) = -1
16	}
(gdb) n
__libc_start_main (main=0x5555555551a8 <main()>, argc=1, argv=0x7fffffffdff8, init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7fffffffdfe8) at ../csu/libc-start.c:342
342	../csu/libc-start.c: No such file or directory.
(gdb) n
[Inferior 1 (process 3591734) exited normally]
(gdb) n
The program is not being run.
(gdb) n[Krun
Starting program: /import/linux/home1/aservet1/projects/i240a/work/lab2/exercises/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffdef8) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) p *a=5
$5 = 5
(gdb) n
main () at overload.cc:15
15	    << std::endl;
(gdb) n
f(a) = 3; f(&a) = 10; f(a, b) = 2
16	}
(gdb) l
11	  std::cout 
12	    << "f(a) = " << f(a)
13	    << "; f(&a) = " << f(&a)
14	    << "; f(a, b) = " << f(a, b)
15	    << std::endl;
16	}
(gdb) quit
A debugging session is active.

	Inferior 1 [process 3591764] will be killed.

Quit anyway? (y or n) y
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/3-overload[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/3-overload[01;31m (master)[00m$ ls
Makefile  [0m[01;32moverload[0m  overload.cc
]0;aservet1@remote04: ~/i240a/work/lab2/exercises/3-overload[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2/exercises/3-overload[01;31m (master)[00m$ cd ../..
]0;aservet1@remote04: ~/i240a/work/lab2[01;32maservet1@remote04[00m:[01;34m~/i240a/work/lab2[01;31m (master)[00m$ exit

Script done on 2020-02-07 23:21:56-05:00 [COMMAND_EXIT_CODE="0"]
